[
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson4 (1)",
                        "text1": "সে গরীব কিন্তু সে সৎ",
                        "text2": "He is poor but he is honest. <br> <br>এখানে দুটি বাক্যকে but দিয়ে জোড়া হয়েছে । He is poor but honest-ও লেখা যেত । কিন্তু He is poor, but is honest ঠিক নয় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson4 (2)",
                        "text1": "তার পা ভাঙা, না হলে সে জিততে পারত",
                        "text2": "He could win but for his broken leg. <br> <br>না হলে - but for । এরকমও লেখা যেত - His leg is broken, otherwise/else he could win । জিততে পারত -  could win ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson4 (3)",
                        "text1": " তিনি যে ভদ্রমহিলাকে ভালোবাসতেন তাঁকে বিয়ে করেছিলেন",
                        "text2": "He married the lady whom he loved. <br> <br>এখানে চালক বাক্য - তিনি তাঁকে (ভদ্রমহিলাকে) বিয়ে করেছিলেন । আর দ্বিতীয় বাক্য - যাকে তিনি ভালোবাসতেন । অতএব সাজিয়ে নাও - তিনি ভদ্রমহিলাকে বিয়ে করেছিলেন যাকে তিনি ভালোবাসতেন । যাকে - whom । ভদ্রমহিলা - lady (woman হবে না) । তেমনই which, that বা who এখানে ভুল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson4 (4)",
                        "text1": "কাকে কাকে নিমন্ত্রণ করতে হবে তোমার জানা উচিৎ",
                        "text2": "You should know whom you have to invite. <br> <br>এখানে চালক বাক্য - তোমার জানা উচিৎ । তাই সেটা আগে আসবে । সাজিয়ে নাও - \"তোমার জানা উচিৎ কাকে কাকে নিমন্ত্রণ করতে হবে\" । কাকে কাকে -whom হয়, Who who বা Whom whom হয় না । whom you have to invite-এর জায়গায় whom to invite-ও লেখা যায় । have to - করতে হবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson4 (5)",
                        "text1": "প্রকাশ কি জানে কখন ট্রেনটি ছাড়বে ?",
                        "text2": "Does Prakash know when the train will start ? <br> <br>এখানে দুটি জিনিস আছে - চালক বাক্য এবং প্রশ্ন । চালক বাক্য আগে ধরে নিতে হবে, সেটা হল \"প্রকাশ জানে\" । এবার উত্তর - প্রকাশ জানে কখন ট্রেনটি ছাড়বে । তাই প্রশ্নটা হল - Does Prakash know when the train will start ? মনে রাখবে, প্রশ্ন সবসময়েই চালক বাক্যের উপরই হবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson4 (6)",
                        "text1": "বিকাশ কি জানে কোন সময় ট্রেনটি ছাড়বে ?",
                        "text2": "Does Bikash know at what time the train will start ? <br> <br>আগেরটার মত একই রকম । কোন সময় - at what time । এর জায়গায় when লিখলে খুব ভুল হবে না । When - কখন । Does Bikash know what time the train will start at ? - এটাও লেখা যায় । begin লিখবে না start-এর বদলে, আগেই তোমরা start আর begin-এর তফাৎ জেনেছো ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson4 (7)",
                        "text1": "তুমি না-ও জানতে পার মার্থা কোন দেশে থাকে",
                        "text2": "You may not know the country in which Martha lives. <br> <br>এখানে চালক বাক্য - তুমি না-ও জানতে পার (You may not know) । কি জানতে না-ও পার - মার্থা কোন দেশে থাকে (The country in which Martha lives) । এখানে You may not know Martha lives in which country হবে না, কারণ তুমি কোন country সেটা জান না, Martha-কে জান না, তা তো নয় । তাই ঠিক ভাবে জোড়া সেটা হবে না । You may not know the country which Martha lives in - এটাও লেখা যায় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson4 (8)",
                        "text1": "আমি সেখানে গেছিলাম কারণ আমাকে তাই বলা হয়েছিল",
                        "text2": "I went there because I was asked to do so. <br> <br>এখানে দুটি বাক্যকে because দিয়ে জোড়া হয়েছে । দ্বিতীয় বাক্যে Passive Voice আছে, লক্ষ্য কর । এখানে so-এর ব্যবহার \"তাই\" বা \"সেরকম\" অর্থে হয়েছে , সেইজন্য অর্থে নয় । so না লিখে that-ও লেখা যেত ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson4 (9)",
                        "text1": "যেহেতু আমাকে যেতে বলা হয়েছিল, আমি সেখানে গেছিলাম",
                        "text2": "As I was asked to go, I went there. <br> <br>এটা আগেরটার মতই, শুধু বাক্য দুটি ঘোরানো আছে । কখনো because দিয়ে বাক্য শুরু করবে না । তাই এখানে as দিয়ে বাক্য শুরু হল । as-এর জায়গায় since-ও ব্যবহার করতে পার । এই since অর্থ \"যেহেতু\" । As I was asked to go, so I went there - লেখার দরকার নেই ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson4 (10)",
                        "text1": "আমাকে যেতে বলা হয়েছিল তাই আমি সেখানে গেছিলাম",
                        "text2": "I was asked to go, so I went there. <br> <br>এখানে so দিয়ে দুটো বাক্যকে জোড়া হয়েছে, so-এর অর্থ \"তাই\" । Therefore-ও ব্যবহার করা যেত ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson4 (11)",
                        "text1": "সে চাঁদে থাকতে চায় কারণ সে পাগল",
                        "text2": "He wants to live in the moon because he is mad. <br> <br>এখানে দুটি বাক্যকে because দিয়ে জোড়া আছে । because - কারণ । 'থাকা' অর্থে stay-ও ব্যবহার করতে পারো ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson4 (12)",
                        "text1": "সে পাগল বলে চাঁদে থাকতে চায়",
                        "text2": "As he is mad, he wants to live in the moon. <br> <br>আগেরটার মত, শুধু বাক্য দুটি ঘোরানো আছে । সাজিয়ে নাও - যেহেতু সে পাগল, সে চাঁদে থাকতে চায় । যেহেতু because দিয়ে বাক্য শুরু হয় না, সেইজন্য as ব্যবহার করা হল । as অর্থ যেহেতু ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson4 (13)",
                        "text1": "সে পাগল তাই সে চাঁদে থাকতে চায়",
                        "text2": "He is mad, so he wants to live in the moon. <br> <br>একই রকম, এখানে দুটি বাক্যকে so দিয়ে জোড়া হল । এখানে therefore-ও ব্যবহার করা যেত ।"
                      }
]