[
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson3 (1)",
                        "text1": "যখনই আমি তার বাড়ীর পাশ দিয়ে যাই তখনই তার সঙ্গে দেখা করি",
                        "text2": "Whenever I pass by his house, I visit him. <br> <br>আবার whenever-এর ব্যবহার হল \"যখনই\" বোঝাতে । পাশ দিয়ে যাওয়া - pass by । দেখা করা - visit (verb) । then ব্যবহার হল না এখানেও ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson3 (2)",
                        "text1": "সে কে আমি জানি না",
                        "text2": "I do not know who he is. <br> <br>এখানে Who he is দিয়ে শুরু হবে না, বাংলায় \"সে কে\" দিয়ে শুরু হলেও, কারণ কর্তা হল \"আমি\" । আমি জানি না - I do not know । এবারে জোড়ো \"সে কে\" । এখানে সবসময় লক্ষ্য রাখবে, যখন প্রশ্ন থাকবে না (এখানে যেমন), তখন who is he হবে না, who he is হবে । I do not know who is he ভুল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson3 (3)",
                        "text1": "রমা-ই সে মেয়ে যে এটা করে",
                        "text2": "Rama is the girl who does it. <br> <br>আগেরটার সঙ্গে এটার সামান্য তফাৎ আছে । আগেরটায় প্রশ্নের ভাব ছিল, এটায় নেই । তবু কিন্তু who দিয়েই এখানেও ২টো বাক্যকে জোড়া হল ।  রমা-ই সেই মেয়ে - Rama is the girl । যে এটা করে - who does it । রমা মানুষ বলে who বসল, অন্য প্রাণী হলে which বসত । who-এর জায়গায় That-ও এখানে হবে না । \"সেই মেয়ে\" আছে বলে the girl হল, that girl লিখলেও ভুল হত না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson3 (4)",
                        "text1": "মধু কিভাবে কাজটা করল, সে জানে না",
                        "text2": "He does not know how Madhu did the work. <br> <br>আগে বাক্য ২টোর ইংরিজি ভেবে নেবে - মধু কিভাবে কাজটা করল (How Madhu did the work), সে জানে না (He does not know) । \"সে জানে না\" বাক্যটাই চালনা করছে \"মধু কিভাবে কাজটা করল\" এই বাক্যকে, তাই He does not know দিয়েই শুরু হবে । He does not know how did Madhu do the work ভুল, কারণ এখানে প্রশ্ন নেই । Madhu worked নয়, Madhu did the work ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson3 (5)",
                        "text1": "একজন মিস্ত্রীর জানা উচিৎ কিভাবে গাড়ী সারানো হয়",
                        "text2": "A mechanic should know how a car is repaired. <br> <br>ভুল - How a car is repaired a mechanic should know, কারণ চালক বাক্য হচ্ছে A mechanic should know ।  car is repaired - passive voice । এর জায়গায় লিখতে পারো how one repairs a car ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson3 (6)",
                        "text1": "কেন সে এটা করল, আমার জানা নেই",
                        "text2": "I do not know why he did it. <br> <br>আমার জানা নেই - I do not know, কেন সে এটা করল - why he did it । যেহেতু \"আমার জানা নেই\" চালক বাক্য, তাই সেটা দিয়ে শুরু হল । এবার কি জানা নেই, না \"কেন সে এটা করল\" । চালক বাক্যটা আগে ধরে নেবে, তাহলে জুড়তে অসুবিধে হবে না । প্রশ্ন নেই, তাই why did he do it হবে না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson3 (7)",
                        "text1": "বাঁদর কি জানে পৃথিবী কেন গোল ?",
                        "text2": "Does a monkey know why the earth is round ? <br> <br>উত্তর - A monkey knows why the earth is round । প্রশ্ন - Does a monkey know why the earth is round ? ভুল - Why is the earth round, a monkey knows ? বা Why is the earth round, does a monkey know ? বা Does a monkey know why is the earth round ? এগুলো ভুল, কারণ চালকবাক্য হল 'বাঁদর কি জানে', অতএব সেটা প্রথমে আসবেই ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson3 (8)",
                        "text1": "কেউ কি জানে, বিকাশবাবু কোথায় থাকেন ?",
                        "text2": "Does anybody know where Bikashbabu lives ? <br> <br>চালকবাক্য - কেউ জানে । তাই উত্তর - anybody (কেউ) knows where Bikashbabu lives (চালকবাক্য আগে এল) । এবার প্রশ্ন - Does anybody know where Bikashbabu lives ? সবসময় মনে রাখবে, চালকবাক্যেরই প্রশ্ন হয় । ভুল ইংরিজি - Anybody knows where does Bikashbabu live ?, কারণ anybody knows দিয়ে প্রশ্ন বোঝানো হয় না । Does anybody know where does Bikashbabu live ? - এটাও ভুল, কারণ দুটো প্রশ্ন একসঙ্গে থাকবে না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson3 (9)",
                        "text1": "ভালোবাসা যেখানে আমি সেখানে",
                        "text2": "I am there where love is. <br> <br>চালকবাক্য হল - আমি সেখানে । তাই সাজিয়ে নাও - আমি সেখানে যেখানে ভালবাসা আছে ।  where is love লিখলে ভুল হবে । where there is love, I am there খুব কিছু ভাল ইংরিজি নয় । "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson3 (10)",
                        "text1": "আমি নিশ্চিত নই গল্পটি কি বিষয়ে",
                        "text2": "I am not sure about what the story is. <br> <br>চালকবাক্য - আমি নিশ্চিত নই । তাই সাজিয়ে নাও - আমি নিশ্চিত নই, কি বিষয়ে গল্পটা আছে । সেই হিসেবে  I am not sure about what the story is লেখা হল । I am not sure what the story is about - এরকমও লেখা যেত,  সেক্ষেত্রে preposition 'about' দিয়ে বাক্য শেষ হত । দুটোই ঠিক । কিন্তু I am not sure about what is the story ভুল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson3 (11)",
                        "text1": "বাজারটিতে যে সবজী ও ফল আছে সেগুলি কাছাকাছি গ্রাম থেকে আসে",
                        "text2": "The market has vegetables and fruits which come from nearby villages. <br> <br>চালক বাক্য - \"বাজারটিতে যে সবজী ও ফল আছে\" । সাজিয়ে নাও - \"বাজারটিতে সবজী ও ফল আছে যেগুলি কাছাকাছি গ্রাম থেকে আসে\" । কাছাকাছি - nearby । এখানে who হল না, which হল কারণ which দিয়ে যাকে বোঝানো হচ্ছে, সেটা জিনিস, মানুষ নয় । which-এর জায়গায় that-ও হতে পারত । এরকমও লেখা যেত, the vegetables and fruits of the market come from nearby villages - তবে সেটা সরল বাক্য হত ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson3 (12)",
                        "text1": "সেই লোকটি কে যে তোমার ঘরে ছিল ?",
                        "text2": "Who is the man who was in your room ? <br> <br>এখানে who দিয়ে দুটি বাক্যকে জোড়া হল । প্রথম বাক্যে who প্রশ্ন বোঝাচ্ছে (কে ?), আর দ্বিতীয় বাক্যের আগে who দিয়ে সেটাকে প্রথম বাক্যের সঙ্গে জোড়া হল । Who is the man in your room হবে না, কারণ \"কে তোমার ঘরে ছিল\" প্রশ্নটা নয় । এখানে দ্বিতীয় who এর জায়গায় which হবে না, কারণ who দিয়ে প্রাণীকে বোঝানো হচ্ছে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson3 (13)",
                        "text1": "কোন কোন ফল তোমার ভাল লাগে যেগুলি উপকারী ?",
                        "text2": "Which fruits do you like which are helpful ? <br> <br>এখানে দুটি শব্দকে which দিয়ে জোড়া হয়েছে  । লক্ষ্য কর, এখানে দুবার which ব্যবহার হয়েছে - একবার \"কোন কোন\" বোঝাতে, আর একবার দুটো বাক্যকে জুড়তে । কোন কোন ফল - which fruits । which which fruits হবে না । which helpful fruits do you like লিখলে বাংলায় যা চাওয়া হয়েছে তা ঠিক বোঝানো হত না ।"
                      }
]