[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson10 (1)",
                        "text1": "এই গ্রামে কোনো ভালো মানুষ নেই",
                        "text2": "There is no good man in this village. <br> <br>যদিও no বসল good-এর আগে, যেটা একটা adjective, এই উদাহরণ কিন্তু কোন ব্যতিক্রম নয় । কারণ হল এই যে, আসলে no বসেছে man-এর সঙ্গেই বা man-এর জন্যই । এখন man যদি good-ই হয় (বা bad), তবে তো আর তার জন্য not বসানো যায় না । There is not a good man in this village লিখলেও ভুল হয় না । কিন্তু There is not good man in this village ভুল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson10 (2)",
                        "text1": "এই গ্রামে একটাও ভালো মানুষ নেই",
                        "text2": "There is not even one good man in this village. <br> <br>Not even আর one-এর ব্যবহার লক্ষ্য কর । Not even মানে হল \"একটাও নয়\" । আর এখানে a good man হবে না, one good man লিখতেই হবে । কারণ যখন পরিষ্কার করে সংখ্যা বোঝানো হয় বা তার ওপর জোর দেওয়া হয়, তখন a না লিখে one লেখা ঠিক । He is a good man এটা ঠিক, এখানে He is one good man লিখলে ভুল হত । কারণ এই বাক্যে good man-এর ওপর জোর আছে, \"একজন\"-এর ওপর নয় বা এখানে সংখ্যা বোঝানো উদ্দেশ্যও নয় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson10 (3)",
                        "text1": "আমি তোমায় বলেছিলাম, আমি তোমায় গল্প বলেছিলাম",
                        "text2": "I told you, I told a story to you. <br> <br>আগে একটা উদাহরণে আছে, I told to you হবে না, I told you হবে । এই অনর্থক preposition-এর ব্যবহার (এখানে যেমন to) ত্যাগ করতে হবে । \"আমাকে\", \"তোমাকে\", \"তাকে\" ইত্যাদি (দ্বিতীয়া বিভক্তি) থাকলে এই to বা অন্য কোন preposition লিখবে না । যেমন, I love to you, I learn in English, I play to cricket সব ভুল প্রয়োগ । say to অবশ্য এর ব্যতিক্রম । আর দ্বিতীয়া ছাড়া অন্য কোন বিভক্তি থাকলে (যেমন, \"বিপদ থেকে\" বা \"তাপসের\" বা \"নদীতে\") সবসময় preposition ব্যবহার হবেই । এবার লক্ষ্য কর, দুটো দ্বিতীয়া বিভক্তি (যেমন, \"তোমায়\" আর \"গল্প\") থাকলে দুভাবে লেখা যেতে পারে । এক - I told a story to you, দুই - I told you a story । ভুল - I told to you a story বা I told a story you ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson10 (4)",
                        "text1": "আমি তোমায় দিয়েছি, আমি তোমায় চিঠি দিয়েছি",
                        "text2": "I have given you, I have given letter to you. <br> <br>আগের উদাহরণের নিয়ম এখানেও প্রযোজ্য । I have given to you কখনো লিখবে না, কারণ \"তোমায়\" দ্বিতীয়া বিভক্তি আর তার সঙ্গে preposition বসে না । আবার পরের বাক্যে to বসল আগের উদাহরণের মতই, যেহেতু দুটো দ্বিতীয়া বিভক্তি আছে (\"তোমায়\" আর \"চিঠি\") । এখানেও ভুল - I have given letter you বা I have given to you a letter । আগের মতই লিখতে পারো - I have given you a letter ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson10 (5)",
                        "text1": "অভেদ ইংরাজি শেখায়, অভেদ আমাদের ইংরাজি শেখায়",
                        "text2": "Abheda teaches English, Abheda teaches us English. <br> <br>\"ইংরাজি শেখায়\" মানে \"ইংরাজিকে শেখায়\" - দ্বিতীয়া বিভক্তি । তাই Abheda teaches English হল, কোনো preposition বসল না । তাই ভুল - Abheda teaches in English । আবার দেখ, পরের বাক্যে (দুটো দ্বিতীয়া বিভক্তি) Abheda teaches us English হল, কোন preposition বসল না । Abheda teaches English us লিখলে ভুল হত, এখানে to us লিখতেই হবে - Abheda teaches English to us । জেনে রাখবে,  teach - পড়ানো, learn - শেখা, read আর study - পড়া ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson10 (6)",
                        "text1": "শিক্ষক একটা প্রশ্ন জিগ্যেস করবেন, শিক্ষক আমায় একটা প্রশ্ন জিগ্যেস করবেন",
                        "text2": "The teacher will ask a question, the teacher will ask me a question. <br> <br>\"প্রশ্ন\" লেখা হলেও আসলে তো বোঝাচ্ছে \"প্রশ্নকে\" । তাই ask a question । ভুল হত লিখলে - ask for a question । আবার, দুটো দ্বিতীয়া বিভক্তি আছে যেখানে, সেখানে হল the teacher will ask me a question । ভুল - ask to me (কখনো লিখবে না) । ঠিক - the teacher will ask a question to me । এখানে আবার to me দিতে হবে ।  The teacher will ask to me a question বা The teacher will ask a question me একদম ভুল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson10 (7)",
                        "text1": "আমি তার সঙ্গে দেখা করলাম এবং তার সঙ্গে কথা বললাম",
                        "text2": "I met him and spoke to him. <br> <br>যদিও \"তার সঙ্গে\" আছে, তবু meet-এর সঙ্গে with বসে না । যেন \"তাকে দেখা করলাম\" - met him । এটা ব্যতিক্রম । speak with বা speak to দুটোই লিখতে পারো । এটাও ব্যতিক্রম । meet-met-met আর speak-spoke-spoken । আবার speak-এর জায়গায় যদি talk ব্যবহার কর, তখন talk to বা talk with দুটোই লিখতে পারো ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson10 (8)",
                        "text1": "আমি শিক্ষকতা করতাম",
                        "text2": "I used to teach. <br> <br>এটি একটি বিশেষ ব্যবহার । কোন কাজ অতীতে বারবার (অভ্যাসবশত) করা হলে (যেমন, \"করতাম\", \"খেতাম\", \"যেতাম\" ইত্যাদি) used to ব্যবহার হয় । আরো উদাহরণ - I used to play with him (আমি তার সঙ্গে খেলতাম), He used to dance well (সে ভাল নাচত), Fatema used to walk two kilometers in the morning (ফতেমা সকালে দুই কিলোমিটার হাঁটত) । used to লিখে তারপর verb-টা লিখবে । লক্ষ্য করে দ্যাখো, I taught লিখলে \"আমি শিখিয়েছিলাম\" বোঝায়, \"আমি শেখাতাম\" বোঝায় না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson10 (9)",
                        "text1": "আমি আগে ক্রিকেট খেলতাম, এখন আবার এই খেলতে যাচ্ছি",
                        "text2": "I used to play cricket, now I am about to play again. <br> <br>আগের উদাহরণে বলা হয়েছে, \"খেলতাম\" \"করতাম\" এই রকম অতীতের অভ্যাসমূলক কাজ থাকলে used to ব্যবহার করবে, আর তারপর verb-টা দেবে (play) । দ্বিতীয় বাক্যাংশে আরেকটি বিশেষ ব্যবহার লক্ষ্য কর । কোন কাজ এক্ষুনি করা হচ্ছে বা হবে বোঝাতে about to ব্যবহার করা হয় । I am about to play, He was about to work, They are about to go এরকম হয় । used to-র মতই about to-র পরে পরেই verb বসে, খেয়াল রাখবে । going to play again - এমনও লেখা যায় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson10 (10)",
                        "text1": "আপনি কি একটি পানীয় নেবেন (পছন্দ করবেন) ?",
                        "text2": "Would you like a drink ? <br> <br>এটা ভদ্রতাসূচক বাক্য বা প্রশ্ন - এই would you like-এর ব্যবহার । Would you like a drink, Would you like to take me in your car, Would you like to join us ইত্যাদি । ভদ্রতা বোঝাতে will না ব্যবহার করে would ব্যবহার হয় । Will you want a drink লিখবে না । Will you take a drink ভালো ও ঠিক, কিন্তু ভদ্রতাসূচক নয় । Would you like ভদ্রতাসূচক ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson10 (11)",
                        "text1": "হ্যাঁ, আমি কফি নেব, আমায় দয়া করে এক কাপ কফি দিন",
                        "text2": "Yes, I would like coffee, please give me a cup of coffee. <br> <br>\"কফি নেব\" ভেবে I shall take coffee বলবে বা লিখবে না, ভদ্রতার উত্তর ভদ্রতায় দেবে - I would like coffee । অথবা বলতে বা লিখতে পারো I would like to take coffee । আবার দ্যাখো, পরের বাক্যাংশে \"দয়া করে\" না থাকলেও please লিখবে - এটাও ভদ্রতা । শুধু give me a cup of coffee বললে বা লিখলে আদেশ বা নির্দেশ বোঝাবে । এগুলো সাহেবরা খুব নজর করে, তোমাদেরও খেয়াল রাখতে হবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson10 (12)",
                        "text1": "সবকটা উদাহরণ আবার পড়ো, দয়া করে আমায় ওগুলো বলো",
                        "text2": "Read all examples again, please tell them to me. <br> <br>প্রথম বাক্যাংশে নির্দেশ আছে, তাই শুধু read বসল - please read হল না (You read লেখার দরকার নেই) । দ্বিতীয় বাক্যাংশে \"দয়া করে\" আছে বলে please বসল । উদাহরণ - example । দ্বিতীয় বাক্যাংশে please tell me them-ও লেখা যেত ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson10 (13)",
                        "text1": "তুমি/তোমরা ৫০০ উদাহরণ শেষ করেছো, ধন্যবাদ",
                        "text2": "You have completed 500 examples, thank you. <br> <br>\"করেছো\" আছে বলে have হল । শেষ করা অর্থে complete-কে verb হিসেবে ব্যবহার করা হল । \"উদাহরণকে\" (দ্বিতীয়া বিভক্তি) বোঝাচ্ছে বলে completed আর 500 examples-এর মাঝে কোনো preposition বসল না । (তোমায়) ধন্যবাদ - thank you । I thank you লেখার দরকার হয় না ।"
                      }
]