[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson5 (1)",
                        "text1": "সবচেয়ে নরম মানুষ সবচেয়ে বেশী কষ্ট পায়",
                        "text2": "The softest person gets the most pain. <br> <br>প্রথমে কর্তা ধর - সবচেয়ে নরম মানুষ (the softest person, man লিখো না) । তারপর কাল - বর্তমান কাল, তাই পাওয়া অর্থে gets হল । এবারে কি পায়, না the most pain । তাই হল, The softest person gets the most pain । ভুল - painest,  কারণ pain ছোট শব্দ হলেও সেটা noun, শুধু adjective-এর সঙ্গেই er বা est যোগ হওয়ার প্রশ্ন আসে ।'কষ্টকে' পায়, তাই gets the most pain হল, কোনো preposition বসল না most pain-এর আগে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson5 (2)",
                        "text1": "সবচেয়ে লম্বা আর সবচেয়ে বেঁটে ছেলে দুজনেরই উচ্চতা শিক্ষকটি জানেন",
                        "text2": "The teacher knows the heights of both the tallest and the shortest boys. <br> <br>কর্তা - the teacher । কাল - বর্তমান, তাই knows হল । কি জানেন, না দুজনেরই উচ্চতা (heights of both) । সেই দুজনের উচ্চতা কাদের, না the tallest and the shortest boys-এর । অতএব হল, The teacher knows the heights of both the tallest and the shortest boys । Teacher know ভুল, শুধু height লিখলেও সেটা ভুল হত । শেষে boys হল, কারণ ২ জন আছে । both the tallest and the shortest boys-এর ব্যবহারটা খেয়াল রাখবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson5 (3)",
                        "text1": "আমি আসছি",
                        "text2": "I am coming. <br> <br>যে বর্তমান এখন ঘটছে (যেমন, আসছি), সেটা বোঝাতে am/is/are ব্যবহার হয়ে verb-এর সঙ্গে ing যোগ হয় - I am coming (comeing নয়) । I am, you are, he/she is. they/are, it is, we are ইত্যাদি । We are going, They are playing, It is seeing, He is sleeping - এরকম হয় । I am come - লিখবে না, ওটা ভুল ।" 
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson5 (4)",
                        "text1": "সে এসেছে",
                        "text2": "He/ She has come. <br> <br>এটা বর্তমান কাল, কিন্তু ঘটমান নয় । বরং অতীতে আসতে শুরু করেছিল, এখন এসেছে ও তার রেশ রয়ে গেছে । এই ক্ষেত্রে I have come, You have come, He/she has come, They have come, It has come - এরকম হয় । তবে এই has/have-এর পর verb-এর কি রূপ পরিবর্তন হবে, তা এক এক verb-এর জন্য এক এক রকম । Come - Came - Come ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson5 (5)",
                        "text1": "তারা এসেছিল",
                        "text2": "They came. <br> <br>এটি বিশুদ্ধ অতীতকাল । তারা অতীতে এসেছিল এবং তার কোনো রেশও নেই । এ ক্ষেত্রে I came, you came, he/she came, they came, it came হয় । Noun (বা pronoun) যা-ই থাকুক না কেন (I, you, Sumita, Sumita and Sumit ইত্যাদি), verb-এর অতীতকালের রূপ একই হয়, যেমন came হল । কখনো they were come লিখবে না, ওটা ভুল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson5 (6)",
                        "text1": "তুমি চানের ঘরে গান করছ",
                        "text2": "You are singing in bathroom. <br> <br>ঘটমান বর্তমান । গান কর আর গান করছ - এদুটোর তফাৎ করবে । তুমি গান কর - you sing । তুমি গান করছ - you are singing ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson5 (7)",
                        "text1": "আমরা একটা ভূত দেখেছি",
                        "text2": "We have seen a ghost. <br> <br>দেখা হয়ে গেছে, কিন্তু তার রেশ রয়ে গেছে, তাই have seen হল (we আছে বলে have) । seen to a ghost বা seen at a ghost বা we seen a ghost ভুল । ভূতকে দেখা বলে a ghost-এর আগে preposition বসবে না । have see-ও ভুল । See - Saw - Seen ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson5 (8)",
                        "text1": "সলিলের স্ত্রী আমাদের জন্য ভালো চা তৈরী করেছিলেন",
                        "text2": "Salil's wife made good tea for us. <br> <br>কর্তা - Salil's wife । তারপর কাল আর verb - made (তৈরী করা), কারণ কাল হল বিশুদ্ধ অতীত (কোন রেশ নেই, কাজ শেষ হয়ে গেছে) । কী তৈরী করেছিলেন, না good tea । কাদের জন্য, না for us । the good tea ভুল । Salil's wife for us made good tea-ও ঠিক হবে না । কে-কী-কাদের জন্য এই ক্রমে ইংরিজি বাক্য তৈরী করতে হবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson5 (9)",
                        "text1": "তোমরা কেন হাসছ ?",
                        "text2": "Why are you laughing ? <br> <br>কর্তা -  you । কাল - ঘটমান বর্তমান, তাই are laughing । অতএব উত্তর হল - you are laughing । প্রশ্ন - are you laughing ? এবার why জোড়ো গোড়ায় । why are you laugh কখনো লিখবে না । তোমরা অনেকেই এই ভুলটা কর ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson5 (10)",
                        "text1": "আমার চকোলেটটা খেতে ভালো লেগেছে",
                        "text2": "I have liked to eat the chocolate. <br> <br>\"লেগেছে\" আছে, তাই have liked হল । like to eat, love to learn এরকম ব্যবহার আমরা আগে পেয়েছি খেতে ভাল লাগা, শিখতে ভাল লাগা অর্থে । my have liked বা I have like হবে না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson5 (11)",
                        "text1": "স্বামী-স্ত্রী সুন্দর দৃশ্য দেখার আশা করেছিল",
                        "text2": "The husband and the wife hoped to see nice scenery. <br> <br>কর্তা - The husband and the wife । কাল আর verb - অতীত আর hope to see (দেখার আশা) । তাই হল The husband and the wife hoped to see । সুন্দর দৃশ্য - nice scenery । The husband and the wife না লিখে the couple-ও লেখা যায় । saw to hope নয়, hoped to see, কারণ 'দেখার' বা 'দেখতে'-এর মধ্যে to see লুকিয়ে আছে । nice scenery-র আগে কোনো preposition বসল না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson5 (12)",
                        "text1": "আমরা কি ওখানে খেলতে যাচ্ছি না ?",
                        "text2": "Are we not going there to play ? <br> <br>খেলতে যাচ্ছি না - not going to play । We are হয়, বহুবচন বলে । তাই প্রশ্ন হল, Are we not going there to play ? শেষেও ব্যবহার করা যেত there (their নয়), কারণ খেলা আর যাওয়া একই জায়গায় । to there লিখবে না "
                      }
]