[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson2 (1)",
                        "text1": "The doctor said to the patient, \"You did not take the right medicine\".",
                        "text2": "The doctor said to the patient that the patient had not taken the right medicine. <br> <br>এখানেও direct speech-এ দ্বিতীয় বাক্যে simple past tense আছে (did not) বলে indirect speech-এ had not ব্যবহার হল  (past perfect) । বিভ্রান্তি এড়াতে পরের বাক্যে he না দিয়ে the patient had not taken লেখা হল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson2 (2)",
                        "text1": "Rabi said, \"I shall not start without you\".",
                        "text2": "Rabi said that he would not start without me. <br> <br>Indirect speech-এ I shall হয়ে গেল he would, কারণ আগের বাক্যে past tense আছে (Rabi said) । জানবে, indirect speech-এ past tense করতে গেলে I shall-কে করবে  I should, তেমনি you will হয় you would, আর he/they will হয় he/they would । তবে সেটা বুঝে ব্যবহার করতে হবে, যেমন এখানে I shall আছে বলেই I should হবে তা নয়, he would হল । Indirect speech-এ পরের বাক্যে I should লিখতে গেলে আগের বাক্যেও I থাকতে হবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson2 (3)",
                        "text1": "I told you, \"I shall not start without him\".",
                        "text2": "I told you that I should not start without him. <br> <br>এখানে লক্ষ্য কর, I shall হল I should । এটা 'উচিৎ' অর্থে should-এর ব্যবহার ঠিক নয়, shall-এর past tense হিসেবে should হয়েছে । I would লিখলে অবশ্য খুব ভুল কিছু হয় না । আরো লক্ষ্য কর, you আর him দুজন আলাদা ব্যক্তি, তাই indirect speech-এ তাদের পরিবর্তন করার প্রয়োজন হল না । যদি থাকত, I told him, \"I shall not start without you.\", তবে you আর him একই ব্যক্তি বোঝাত, তাই তখন হত I told him that I should not start without him (দুটোই him) । ভুল - I told you that I should not start without you ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson2 (4)",
                        "text1": "He told me, \"You will not start without me\".",
                        "text2": "He told me that I should not start without him. <br> <br>আগের মতই, শুধু You will হয়ে গেল I should, কারণ সে কাকে বলল, না আমাকে বলল (He told me), তাই indirect speech-এ I বসল । আর past tense বলে I should হল, I shall ভুল হত । আরো লক্ষ্য কর, without me হয়ে গেল without him, কারণ সে আমাকে বলছে তাকে ছাড়া না যেতে । যদি He told me that I should not start without me লেখা হত, তাহলে বোঝাত আমি (মানে যে এই বাক্যের লেখক) আমাকে ছাড়া যাব না, সে তাই চায় । সেটা ভুল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson2 (5)",
                        "text1": "The workers said, \"We will not work today\".",
                        "text2": "The workers said that they would not work that day. <br> <br>We-টা indirect speech-এ they হয়ে গেল, কারণ আগের বাক্যে workers অর্থাৎ বহুবচন ব্যবহার আছে । They would হল, কারণ আগের বাক্যে past tense আছে (said) । today হয়ে গেল that day, তার কারণ আগেই বলা হয়েছে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson2 (6)",
                        "text1": "Jesus said, \"We should love our neighbours\".",
                        "text2": "Jesus said that we should love our neighbours. <br> <br>এখানে উচিৎ অর্থে should ব্যবহার হয়েছে, shall-এর past tense হিসেবে নয় । মনে রাখবে, should-এর past বা future tense দুটোই should । আরো লক্ষ্য কর, we-টা indirect speech-এ we-ই রইল (বা our-টা our), কারণ they বসালে কাকে বোঝানো হবে, সেটা অনির্দিষ্ট । অতএব, পরিবর্তন যখন করবে, একটু বুঝেশুনে করতে হবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson2 (7)",
                        "text1": "Ruchira said, \"You should go to bed early\".",
                        "text2": "Ruchira said that I should go to bed early. <br> <br>আগের মতই should-এর কোন পরিবর্তন হল না past tense থাকলেও । তবে একটা ব্যাপার লক্ষ্য কর, You-এর জায়গায় I হল, যদিও Ruchira said to me নেই । to me না থাকলেও You-এর জায়গায় I হল, কারণ এক্ষেত্রে ধরে নিতে হবে এই বাক্যের লেখককেই Ruchira এই কথা বলছে । এভাবে ধরে নেওয়াটা একটা প্রচলিত প্রথা ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson2 (8)",
                        "text1": "We said, \"We can do it, and we must do it\".",
                        "text2": "We said that we could do that and we must do that. <br> <br>We-টা we-ই রইল (কারণ আগের বাক্যে we আছে), can-টা could হল (কারণ আগের বাক্যে said আছে), it-টা that হল, আর must-টা must-ই রইল (এটা ঠিক should-এর মত, present বা past বা future tense তিনটেতেই must থাকে) ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson2 (9)",
                        "text1": "The teacher taught, \"The earth moves round the sun\".",
                        "text2": "The teacher taught that the earth moves round the sun. <br> <br>মনে রাখবে, যখন direct speech-এ সবসময়ের জন্য কোন সত্য বলা হয়, আগের বাক্যে past tense থাকলেও পরের (বা সত্য) বাক্যে past tense হয় না, বাক্যটি একই থাকে (present tense) । এখানেও একটি ধ্রুবসত্য (the earth moves round the sun) বলা হয়েছে, তাই আগের বাক্যে past tense (taught) থাকলেও সত্য বাক্যটির কোন পরিবর্তন হল না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson2 (10)",
                        "text1": "My father always said, \"All work and no play makes Jack a dull boy\".",
                        "text2": "My father always said that all work and no play makes Jack a dull boy. <br> <br>All work and no play makes Jack a dull boy একটি ধ্রুবসত্য । তাই indirect speech-এ সেটার কোন পরিবর্তন হল না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson2 (11)",
                        "text1": "Pushpita told me, \"English is easy to learn\".",
                        "text2": "Pushpita told me that English was easy to learn. <br> <br>এখানে English is easy to learn কিন্তু ধ্রুবসত্য নয়, যদিও সেরকম মনে হচ্ছে আপাতদৃষ্টিতে । পুষ্পিতার কাছে ওটা হয়ত সহজ, কিন্তু সকলের কাছে সহজ না-ও হতে পারে । তাই এখানে was ব্যবহার হল, যদিও is লিখলেও ভুল কিছু হত না । was দেওয়াই অবশ্য ভাল । "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson2 (12)",
                        "text1": "She told me, \"I was waiting for the bus yesterday\".",
                        "text2": "She told me that she had been waiting for the bus the day before. <br> <br>লক্ষ্য কর, দুটি বাক্যেই past tense আছে । তাই I was waiting হয়ে গেল she had been waiting, কারণ আগেই বলা হয়েছে পরের বাক্যের past tense হয়ে যাবে had-যুক্ত, আর direct speech-এ past continuous আছে বলে (was waiting) তাই had been waiting হল indirect speech-এ । yesterday হল the day before ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson2 (13)",
                        "text1": "The team shouted, \"We were winning the match\".",
                        "text2": "The team shouted saying that they had been winning the match. <br> <br>ঠিক আগের মতই were winning আছে বলে had been winning হল indirect speech-এ (past continuous হল past perfect) । We হল they । শুধু shouted that লিখলে ভাব ঠিক আসত না, তাই shouted saying that লিখতে হল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson2 (14)",
                        "text1": "She said, \"I was sleeping when Jaya called\".",
                        "text2": "She said that she had been sleeping when Jaya had called. <br> <br>লক্ষ্য কর, I was sleeping when Jaya called বাক্যে দুটো past tense আছে, তাই she had been sleeping করা হল প্রথমটি, আর দ্বিতীয়টা করা হল Jaya had called ।"
                      }
]