[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BD21-Lesson2 (1)",
                        "text1": "The student asked, \"Is the sky blue ?\"",
                        "text2": "The student asked if the sky is blue. <br> <br>প্রশ্ন হলে কি হয়, আকাশ যে নীল, এটি ধ্রুবসত্য । তাই বাক্য সরল হল (the sky is blue), কিন্তু past tense হল না, present tense-ই রইল, যদিও past tense দিলেও ভুল কিছু হত না । আরো লক্ষ্য কর, ask-টা ask-ই থাকল, অবশ্য ask-এর জায়গায় enquire (বা inquire) লেখা যায় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BD21-Lesson2 (2)",
                        "text1": "The student said, \"Was Akbar a good emperor ?\"",
                        "text2": "The student enquired if Akbar had been a good emperor. <br> <br>আগেও এই নিয়ম বলা হয়েছে যে direct speech-এর প্রশ্নে শুধু was (was going বা was playing এরকম নয়) থাকলে সেটা indirect speech-এ had been হয়ে যায় । was going, was playing ইত্যাদি থাকলে had been going, had been playing হয়ে যায় । লক্ষ্য কর, এখানে ask না লিখে enquire লেখা হয়েছে । "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BD21-Lesson2 (3)",
                        "text1": "He says, \"Were you going to school that day ?\"",
                        "text2": "He asks whether I had been going to school that day. <br> <br>লক্ষ্য কর, He says আছে (present tense), কিন্তু প্রশ্নের মধ্যে past tense (were you going) আছে । সে কারণে were going হয়ে গেল had been going - আগের মত । এখানে you বলতে অনির্দিষ্ট ব্যক্তি বোঝাচ্ছে, বাক্যের লেখক হিসেবে 'আমাকে'ই দায়িত্ব নিতে হবে, সে কারণে I বসল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BD21-Lesson2 (4)",
                        "text1": "His angry mother shouted, \"Do you think that you know better than your father ?\"",
                        "text2": "His angry mother shouted and asked if he thought that he knew better than his father. <br> <br>Direct speech-এ প্রশ্নের মধ্যে that দিয়ে দুটো বাক্যাংশকে জোড়া আছে এবং দুটো বাক্যাংশই simple present tense । তাই indirect speech-এ দুটোই simple past tense হয়ে গেল - thought আর knew । আগের মতই, shouted if লিখলে কোন অর্থ দাঁড়াচ্ছে না, অতএব shouted and asked লিখতে হবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BD21-Lesson2 (5)",
                        "text1": "The policeman said to us, \"Go away.\"",
                        "text2": "The policeman ordered us to go away. <br> <br>Direct speech-এ Go away আছে, যেটা একটা আদেশ । আদেশ, নির্দেশ বা অনুরোধ থাকলে indirect speech-এ said to বা told এ verb-দুটির পরিবর্তন করে নিতে হয় । আদেশ থাকলে order, নির্দেশ থাকলে tell বা say (একই থাকে) আর অনুরোধ থাকলে request ব্যবহার করবে । যেহেতু এই ধরণের বাক্যে প্রায় সবসময়ই verb  দিয়েই পরের বাক্যাংশ শুরু হয় (এক্ষেত্রে go), তার আগে to বসিয়ে দুটো বাক্যাংশকে জুড়ে নেবে - ordered us to go away ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BD21-Lesson2 (6)",
                        "text1": "I told him, \"Please wait here till I return.\"",
                        "text2": "I requested him to wait there till I returned. <br> <br>খানে অনুরোধ আছে, তাই requested ব্যবহার হল told-এর বদলে । wait-এর আগে to লাগিয়ে বাক্যাংশদুটিকে জোড়া হল - requested him to wait । লক্ষ্য কর, here হল there, আর return হল returned (আগের told আছে বলে) । please শব্দ indirect speech-এ আর লাগানোর প্রয়োজন নেই, কারণ request শব্দের মধ্যেই please-এর ভাব আছে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BD21-Lesson2 (7)",
                        "text1": "The mother said to her son, \"Eat your food now.\"",
                        "text2": "The mother told her son to eat his food right then. <br> <br>এটি নির্দেশ (ঠিক আদেশ, তা নয়) । তাই ordered না লিখে told লেখা হল । ২টো বাক্যাংশ জোড়া হল to eat কাজে লাগিয়ে । now হল right then ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BD21-Lesson2 (8)",
                        "text1": "The teacher said, \"Sit down, boys.\"",
                        "text2": "The teacher asked the boys to sit down. <br> <br>লক্ষ্য কর, এটা আদেশের মতই, কিন্তু policeman-এর go away-এর মত অত কঠিন নয় । অতএব said-কে ordered লিখলে খুব ভুল হত না, আবার told বা asked-ও লেখা যায় । এই ask কিন্তু প্রশ্ন করা নয়, নির্দেশ দেওয়া । এটা খেয়াল রাখবে যে, ask নির্দেশ দেওয়া অর্থেও ব্যবহার হয়, কিন্তু আদেশ অর্থে কখনোই নয় । "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BD21-Lesson2 (9)",
                        "text1": "The leader said, \"Be quiet and listen to my words.\"",
                        "text2": "The leader asked them to be quiet and listen to his words. <br> <br>এটাও আদেশ আর নির্দেশের মাঝামাঝি । তাই ordered, told বা asked - তিনটেই লেখা যায় । to be quiet-ব্যবহার লক্ষ্য কর, যদিও শুধুমাত্র to দিয়েই এখানেও জোড়া হয়েছে বাক্যাংশ দুটো । পরের বাক্যাংশে কিন্তু listened to his words হবে না, কারণ আসল ব্যবহারটা হল asked them to be quiet and to listen to his words । যদি listened to লেখা হত, তবে মানে হত leader সবাইকে চুপ করতে বলল ও সে তার নিজের কথা শুনছিল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BD21-Lesson2 (10)",
                        "text1": "She told me, \"Please help me.\"",
                        "text2": "She requested me to help her. <br> <br>এটা পরিষ্কার অনুরোধ, তাই requested ব্যবহার হল । me হল her (ভুল - his), কারণ আগে she আছে । To দিয়েই জোড়া হয়েছে এখানেও ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BD21-Lesson2 (11)",
                        "text1": "My friend said, \"Can you close the window please ?\"",
                        "text2": "My friend requested me to close the window. <br> <br>লক্ষ্য কর, প্রশ্ন থাকলেও ভাবটা কিন্তু অনুরোধের । তাই requested me to close the window লেখা হল, যদিও My friend asked me if I could kindly close the window লিখলেও ভুল কিছু হত না  (যেমন প্রশ্নের ক্ষেত্রে লেখা হয়) । অনুরোধের ক্ষেত্রে লক্ষ্য করে দেখ, can you-টা একদম ব্যবহারই হল না indirect speech-এ । please তো রইলই না, কারণ আগেই বলা হয়েছে । "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BD21-Lesson2 (12)",
                        "text1": "The doctor said, \"Don't smoke.\"",
                        "text2": "The doctor asked not to smoke. <br> <br>প্রথমে সিদ্ধান্ত নেবে, এটা আদেশ, নির্দেশ না অনুরোধ । ডাক্তার আদেশ করতে পারেন না তা নয়, তবে এটা নির্দেশই ধরতে হবে । অতএব asked বা told ব্যবহার হবে (advised me-ও লেখা যায়) । এবার দেখ, don't smoke আছে তাই asked not to smoke এমন লেখা হল । ঠিক এমনই ব্যবহার হয় I asked you not to play বা The policeman ordered us not to break rules, যখন I tell you, \"Don't play.\" বা The policeman said to us, \"Don't break rules.\" থাকে direct speech-এ ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BD21-Lesson2 (13)",
                        "text1": "The judge said to all, \"Be on time.\"",
                        "text2": "The judge ordered all to be on time. <br> <br>জজের ক্ষেত্রে বলে এটাকে আদেশ ধরা হল, যদিও আদেশ (order) বা নির্দেশ (ask বা tell) সবসময় খুব স্পষ্ট হয় না । এখানেও লক্ষ্য কর, পরের বাক্যাংশে verb হল be, এবং তাই to দিয়ে দুটো বাক্যাংশকে জোড়া হল । That দিয়ে কিন্তু এরকম বাক্যকে কখনো জুড়বে না । আর ordered to all হয় না, ordered all  হবে, যখন order verb হিসেবে ব্যবহার হয় । আবার noun হিসেবে ব্যবহার হলে হয়, It is my order to you । তখন to হয় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BD21-Lesson2 (14)",
                        "text1": "The prisoner shouted, \"Let me go.\"",
                        "text2": "The prisoner shouted and begged to let him go. <br> <br>এখানে এটা অনুরোধ নয়, ভাব দেখে বোঝা গেল এটা প্রায় ভিক্ষা করা । তাই begged (beg - ভিক্ষা করা) বা pleaded (plead - মিনতি করা) ব্যবহার হল, যদিও requested লিখলে খুব ভুল কিছু হত না । shouted and begged-এর ব্যবহার কেন হল, তা আগেই জানানো হয়েছে । prisoner - বন্দী, আর let me go - আমায় যেতে দাও ।"
                      }
]