[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson1 (1)",
                        "text1": "Lata said to me, \"Where do you live ?\"",
                        "text2": "Lata asked me where I lived. <br> <br>Direct speech-এ প্রশ্ন থাকলে indirect speech যে খুব পরিবর্তন হয়, তা নয় । tense-এর পরিবর্তন একই রকম হয়, এখানে যেমন আগের বাক্যে said আছে বলে indirect speech-এ lived বসল । আর প্রশ্নবোধক যে শব্দ (এখানে where), তারও কোন পরিবর্তন হয় না । শুধু direct speech-এর প্রশ্ন আর প্রশ্ন থাকে না indirect speech-এ, প্রশ্নটাকে ঘুরিয়ে সাধারণ একটা বাক্যে পরিণত করতে হয়, যেমন Where do I live হল where I lived । ভুল - where did I live । আর মনে রাখতে হবে, say বা tell-এর ব্যবহার রাখলে চলবে না indirect speech-এ, সেটাকে ask (প্রশ্ন করা) করে নিতে হবে । ask to me হয় না, ask me ঠিক ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson1 (2)",
                        "text1": "She said, \"What are you doing ?\"",
                        "text2": "She asked me what I was doing. <br> <br>আগের মতই । প্রশ্ন আছে বলে said হল asked, প্রশ্নবোধক বাক্যটি ঘুরে গিয়ে সরল বাক্য হয়ে গেল (what I was doing) । মনে রাখবে, said আছে বলে I was ব্যবহার হল, I am হল না । ask me হয়, ask to me ভুল । that দিয়ে কিন্তু প্রশ্নবোধক বাক্যকে জোড়া হয় না, প্রশ্নবোধক শব্দ (যেমন, what, when, where, how ইত্যাদি) দিয়েই তা জোড়া হ্য় । আরেকটা ব্যাপার লক্ষ্য কর, to me নেই she said-এর সঙ্গে, কিন্তু তা-ও asked me হল, এবং I was doing হল, কারণ আগেই বলা হয়েছে যে কাকে উদ্দেশ্য করে বলা হচ্ছে লেখা না থাকলে যেন লেখককে বলা হচ্ছে, এমন ধরে নিতে হবে । "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson1 (3)",
                        "text1": "The thief says to me, \"How have I come here ?\"",
                        "text2": "The thief asks me how he has come here. <br> <br>লক্ষ্য কর, এখানে says to me আছে, past tense নেই - present tense । তাই he had come হল না, has come-ই হল । বাক্য সরল করাতে how has he come না হয়ে how he has come হল (প্রশ্ন বা প্রশ্নের ভাবও থাকবে না indirect speech-এ) । here-ও কিন্তু there হল না, কারণ past tense তো এখানে নেই, present perfect আছে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson1 (4)",
                        "text1": "The thief said to me, \"How have I come here ?\"",
                        "text2": "The thief asked me how he had come there. <br> <br>এখানে কিন্তু past tense আছে আগের বাক্যে (said), তাই পরের বাক্যে he had come হল indirect speech-এ । here হল there । মনে রাখবে, direct speech-এ প্রশ্ন থাকলে indirect speech-এ ask ব্যবহার করতেই হবে (বদলে enquire-ও লেখা যায়) ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson1 (5)",
                        "text1": "The student told the teacher, \"When can I come to you ?\"",
                        "text2": "The student asked the teacher when the student could come to him. <br> <br>বাক্য সরল হল (the student could come) আর can হল could, কারণ told আছে আগের বাক্যে (past tense) । you হল him, কিন্তু বিভ্রান্তি এড়াতে I-কে he না করে the student লেখা হল । যদি he could come to him লেখা হত, কে কার কাছে আসছে, সেটা বোঝা যেত না । "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson1 (6)",
                        "text1": "The teacher said, \"Who was this great man ?\"",
                        "text2": "The teacher asked who that great man had been. <br> <br>Tense-এর পরিবর্তন সেই আগের মত, আগের ও পরের বাক্যে দুটোতেই simple past tense (said আর was) আছে বলে indirect speech-এ had been হয়ে গেল (শুধু had দিলে ভুল হবে, had been দিতে হবে) । প্রশ্ন আগের মতই ঘুরে গিয়ে সরল হয়ে গেল  (that great man had been) । লক্ষ্য কর, this হল that (এই that কিন্তু বাক্য জোড়ার কাজে ব্যবহার হচ্ছে না) ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson1 (7)",
                        "text1": "The judge told the killer, \"Why did you kill your wife ?\"",
                        "text2": "The judge asked the killer why he had killed his wife. <br> <br>You হল he, আর your হল his । বাক্য সরল হল, why had he killed his wife লিখলে ভুল হত । আগের ও পরের বাক্য দুটোতেই simple past tense আছে, তাই indirect speech-এ he had killed হল (had been নয়) । had আর had been-এর ব্যবহারের তফাৎ বুঝতে হবে । He had killed হয় (সে মেরেছিল), He had been killed-ও হয় (তবে তার অর্থ, তাকে মারা হয়েছিল - passive voice), আর He had been a killer-এর অর্থ, সে একটা ঘাতক হল (he has been-এর past tense) । আগের উদাহরণে who the great man was না হয়ে who the great man had been হয়েছিল, কারণ was-এর past perfect হল had been । এখানে কিন্ত verb হল kill, তাই had killed হল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson1 (8)",
                        "text1": "The judge said to the killer, \"How was your wife killed ?\"",
                        "text2": "The judge asked the killer how his wife had been killed. <br> <br>এটি আগের উদাহরণের মতই, তফাৎ শুধু active আর passive voice-এ । এখানে passive voice আছে direct speech-এ(was killed), তাই indirect speech-এও সেটা ব্যবহার করতে হবে । আর যেহেতু simple past হয়ে যায় past perfect (কি সরল বাক্যে, কি প্রশ্নে), was killed হয়ে গেল had been killed । মনে রাখবে, The judge asked the killer how had his wife been killed লিখলে ভুল হবে, কারণ indirect speech-এ প্রশ্নের ভাব কিছুতেই থাকবে না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson1 (9)",
                        "text1": "Sangeeta cried, \"How shall I pass the examination then ?\"",
                        "text2": "Sangeeta cried and asked how she would pass the examination in that case. <br> <br>I হল she, কারণ Sangeeta মেয়ে । I shall হল she would, কারণ cried আছে । then-কে করে দেওয়া হল in that case । আরেকটা ব্যাপার লক্ষ্য কর, direct speech-এ said উহ্য আছে (শুধু cried দিয়েই বোঝানো হচ্ছে যে সে বলেছে), কিন্তু indirect speech-এ উহ্য রাখা যায় না, she cried how she would pass লিখলে কোন অর্থই আসছে না । অতএব cried and asked লিখতেই হবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson1 (10)",
                        "text1": "Alok told Nomita, \"Do you love me ?\"",
                        "text2": "Alok asked Nomita if she loved him. <br> <br>এই প্রথম একটি উদাহরণ এল, যেখানে how, what, where, when ইত্যাদি দিয়ে প্রশ্ন করা নেই, Do you love me আছে । এইসব ক্ষেত্রে indirect speech-এ if বা whether দিয়ে দুটো বাক্যকে জুড়তে হয় । বাকি সব নিয়ম একই থাকে, বাক্য সরল করা বা tense-এর যা নিয়ম  বা ask বসানো । তাই হল, if she loved him । ভুল - if he loved her । আরো ভুল - Alok asked Nomita that if she loved him । মনে রাখবে, direct speech-এ প্রশ্ন থাকলে indirect speech-এ কোন অবস্থাতেই that ব্যবহার হয় না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson1 (11)",
                        "text1": "Nabin said, \"Are you living here ?\"",
                        "text2": "Nabin asked me whether I was living there. <br> <br>আগের মতই । লক্ষ্য কর, এখানেও how, what, when ইত্যাদি দিয়ে প্রশ্ন শুরু হচ্ছে না, তাই whether দিয়ে বাক্যদুটোকে জোড়া হল (if দিয়েও জোড়া যেত) । here হল there । যদিও said to me পরিষ্কার লেখা নেই, I was living হল তবুও ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson1 (12)",
                        "text1": "She asked me, \"Have you ever been to England ?\"",
                        "text2": "She asked me if I had ever been to England. <br> <br>I have been to England বাক্যাংশটির অর্থ আমি ইংলন্ডে গেছি । Direct speech-এ প্রশ্ন করা হচ্ছে, আমি কখনো ইংলন্ডে গেছি কিনা । তাই indirect speech-এ সেটা হল - সে আমায় প্রশ্ন করল যদি আমি ইংলন্ডে গিয়ে থাকি । অর্থাৎ, She asked me if I had ever been to England । "
                      }
]