[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP1-Lesson3 (1)",
                        "text1": "গোলকিপারই ম্যাচটা হারের কারণ",
                        "text2": "The goalkeeper is the reason for losing the match. <br> <br>ম্যাচটা হারা (noun) - losing the match । কেন হারল, না 'গোলকিপারই সেই কারণ' - the goalkeeper is the reason । তাই হল, the goalkeeper is the reason for losing the match । the match was lost because of the goalkeeper only - ঠিক ইংরিজি হত, কিন্তু gerund-এর ব্যবহার হত না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP1-Lesson3 (2)",
                        "text1": "সত্যি কথা বলতে আমার অসুবিধে নেই",
                        "text2": "I have no problem in telling the truth. <br> <br>আমার অসুবিধে নেই - I have no problem । কিসে অসুবিধে নেই, না 'সত্যি কথা'-এটা বলতে (noun) - telling the truth । এখানে 'problem in' ব্যবহার হল, problem at ভুল ইংরিজি । problem of-ও  ব্যবহার করা যায় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP1-Lesson3 (3)",
                        "text1": "ভদ্রমহিলা চোর হওয়াতে আমি খুব আশ্চর্য হয়েছিলাম",
                        "text2": "I was surprised at the lady being a thief. <br> <br>আমি খুব আশ্চর্য হয়ে গেছিলাম - I was surprised (passive voice, কারণ নিজে নিজে আশ্চর্য হওয়া যায় না) । কিসে surprised হয়েছিলাম, না 'ভদ্রমহিলা চোর হওয়া'-এই ঘটনায় (noun) - the lady being a thief (হওয়া - being) । surprised at হয়, surprised in বা surprised of হয় না । surprised at the thief being a lady - ভুল ইংরিজি ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP1-Lesson3 (4)",
                        "text1": "নয়ন অনুপস্থিত হওয়াতে আমরা রেগে গেলাম",
                        "text2": "We got angry at Nayan being absent. <br> <br>আমরা রেগে গেলাম - we got angry (we were angry লিখলে, রেগে যাওয়া বোঝাতো না) । কিসে রেগে গেলাম, না 'নয়ন অনুপস্থিত হওয়া' এই ঘটনাতে - Nayan being absent । মনে রাখবে angry at হয়, angry in বা angry of হয় না । We got angry at Nayan's absence-এটাও লেখা যেত ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP1-Lesson3 (5)",
                        "text1": "হারিয়ে যাওয়া মেয়েটি কোথায় ?",
                        "text2": "Where is the missing girl ? <br> <br>এটি হল participle-এর ব্যবহার । যেখানে participle, adjective হিসেবে ব্যবহার হয় (যেমন missing girl, losing game, learned man ইত্যাদি) । এখানে missing কিন্তু gerund-এর ব্যবহার নয় । যদি missing the girl লেখার সুযোগ থাকত, তাহলে সেটা gerund হত । এখানে আছে 'হারিয়ে যাওয়া মেয়েটি' তাই missing girl হল । "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP1-Lesson3 (6)",
                        "text1": "আমরা একটা নষ্ট হওয়া সুযোগের জন্য হারছিলাম",
                        "text2": "We were losing because of a missed chance. <br> <br>এখানে 'missed chance' আর একটি participle adjective-এর ব্যবহার । এখানে কিন্তু missing chance হবে না, কারণ সুযোগটা নষ্ট হয়ে গেছে (past tense) তাই missed chance হল । আগের বাক্যে missing girl হল, কারণ সেখানে present tense (where is) ছিল, মেয়েটি এখনও হারিয়ে যাওয়া (missing) । "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP1-Lesson3 (7)",
                        "text1": "কিন্তু শেষপর্যন্ত আমরা হারতে থাকা ম্যাচ অমীমাংসিত রাখলাম",
                        "text2": "But finally we drew the losing match. <br> <br>এখানে অতীতকাল হলেও যেহেতু আমরা ম্যাচটা হারতে থাকছিলাম, তাই losing হল, lost হল না । ম্যাচটা যদি হেরে যেতাম, তবে the lost match হত । draw-এর past tense - drew । শেষ পর্যন্ত -  finally ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP1-Lesson3 (8)",
                        "text1": "প্রায়-হারা ম্যাচটা অমীমাংসিত হয়ে শেষ হল",
                        "text2": "The almost-lost match ended in a draw. <br> <br>এখানে 'প্রায় হারা' (হারার খুব কাছাকাছি) অর্থে almost lost হল । almost losing ঠিক ইংরিজি নয় । ended - শেষ হল । in a draw হবে, at a draw বা with a draw হবে না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP1-Lesson3 (9)",
                        "text1": "তোমার বাবার খারাপ হতে থাকা স্বাস্থ্য এখন কেমন ?",
                        "text2": "How is your father's failing health now ? <br> <br>লক্ষ্য কর, খারাপ হয়ে যাওয়া স্বাস্থ্য নয়, খারাপ হতে থাকা স্বাস্থ্য, তাই failing health হল failed health হল না । failing এখানে adjective, verb-ও নয় আবার noun বা gerund-ও নয় । health - বানানটা লক্ষ্য কর । "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP1-Lesson3 (10)",
                        "text1": "আমার স্বাস্থ্য নষ্ট হওয়া",
                        "text2": "I have a failed health. <br> <br>যেহেতু এখানে 'স্বাস্থ্য নষ্ট' হয়ে গেছে, তাই failed health হল, failing health হল না । My health is failed health-এরকম লিখবে না । ঘুরিয়ে লেখ I have a failed health । 'আমার স্বাস্থ্য নষ্ট হয়ে গেছে' যদি থাকত, তবে My health has failed হত, কিন্তু এখানে তা নেই । এখানে আছে 'আমার স্বাস্থ্য নষ্ট হওয়া' অর্থাৎ স্বাস্থ্যটাই নষ্ট হওয়া - failed health ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP1-Lesson3 (11)",
                        "text1": "পিটারের ভালবাসার পাত্রী কন্যাটির কী খবর ?",
                        "text2": "How is Peter's much loved daughter doing ? <br> <br>এখানেও loving daughter হবে না, loved daughter হবে । loving daughter-এর অর্থ হল কন্যাটি ভালোবাসে । loved daughter-এর অর্থ হল, কন্যাটিকে ভালোবাসা হয় (এখানে তাই আছে) । লক্ষ্য কর, কথোপকথনে 'তার কি খবর' বোঝাতে how is he doing-এরকম বলা হয় । Daughter - বানানটি লক্ষ্য কর ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP1-Lesson3 (12)",
                        "text1": "একটা না-বলা গল্প আমায় বল",
                        "text2": "Tell me an untold story. <br> <br>না বলা গল্প - untold story । এখানে say to me হবে না tell me লিখতে হবে, কারণ story telling হয়, story saying হয় না । আগের বাক্যের loved daughter-এর মতই এখানে untold story হল, কারণ এখানেও গল্পটিকে বলা হয়নি, যেমন আগের বাক্যে কন্যাটিকে ভালোবাসা হয়েছিল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP1-Lesson3 (13)",
                        "text1": "আসাদুল আমায় অপেক্ষা করিয়ে রেখেছিল",
                        "text2": "Asadul kept me waiting. <br> <br>আগেই বলা হয়েছে, খানিকটা সময় ধরে কিছু ঘটলে 'keep' verb ব্যবহার করা হয় । এখানে 'অপেক্ষা করিয়ে রাখা' আছে বলে keep ব্যবহার হল । যদিও অতীতকাল আছে তবুও kept me waited হবে না, কারণ 'অপেক্ষা করিয়ে রাখা' কিছুটা সময় ধরে ঘটেছিল, তাই waiting হল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP1-Lesson3 (14)",
                        "text1": "শ্যামল টিভি দেখতেই থাকল",
                        "text2": "Shyamal kept on watching TV. <br> <br>এখানেও TV দেখা খানিকটা সময় ধরে ঘটেছে বলে keep ব্যবহার হল । kept watching TV ও লেখা যায়, kept on watching TV-এর জায়গায় । কিন্তু watch TV লিখতেই হবে, see TV হবে না । Shyamal was keeping on watch TV - ঠিক নয়, কারণ keep-এর ভেতরে past continuous tense-এর ভাবটা আছে ।"
                      }
]