[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson2 (1)",
                        "text1": "রেগে গিয়ে চোরটা কুকুরটাকে লাথি মারল",
                        "text2": "The thief, being angry, kicked the dog. <br> <br>being angry একটি passive voice-এর ব্যবহার । অর্থ - রাগিত হয়ে । এখানে having been angry-ও লেখা যেত । আবার এমনও লেখা যেত, The thief, become angry and kick the dog বা The thief, becoming angry, kicked the dog । কিন্তু Angry thief, kick the dog লিখলে ভাবার্থ ঠিক আসত না, কারণ 'রেগে যাওয়া' এতে বোঝাচ্ছে না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson2 (2)",
                        "text1": "লাথি খেয়ে কুকুরটা চোরটাকে কামড়ে দিল",
                        "text2": "Having been kicked, the dog bit the thief. <br> <br>এখানে participle-এ passive voice ব্যবহার হবে, কারণ পরের বাক্যাংশটি the dog দিয়ে শুরু হয়েছে, তাই having been kicked হল । এখানে লাথি খাওয়ার রেশটাও আছে, আবার সেটা অন্য লোকেও মারছে, তাই passive voice হল । Bite - Bit - Bit ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson2 (3)",
                        "text1": "গ্রামবাসীরা তখন চোরটাকে হাতেনাতে ধরে ফেলল",
                        "text2": "The villagers then caught the thief red-handed. <br> <br>হাতেনাতে ধরে ফেলা - catch red-handed । এটি একটি participle, কিন্তু একটি বিশেষ phrase ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson2 (4)",
                        "text1": "আমি তাকে রাস্তায় হাঁটতে দেখেছিলাম",
                        "text2": "I saw him walking on the road. <br> <br>তাকে হাঁটতে দেখা - see him walking, কারণ হাঁটাটা একটা সময় ধরে ঘটছিল, সেই জন্য walking হল । I saw that he was walking on the road এমনটাও লেখা যেত । রাস্তার ওপর দিয়ে হাঁটা হয় বলে on the road হল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson2 (5)",
                        "text1": "স্বামীর তার (অর্পিতার) চিঠি খোলা অর্পিতা ধরে ফেলেছে",
                        "text2": "Orpita has caught her husband opening her letter. <br> <br>দিও এখানে চিঠি খোলাটা আগে ঘটেছে, সেই বাক্যাংশটি (opening her letter) পরে লেখা হল, কারণ যদি Opening her letter Orpita has caught her husband লেখা হত, তাহলে তার অর্থ দাঁড়াত অর্পিতাই চিঠিটা খুলছে । Orpita has caught that her husband is opening her letter বা Orpita has caught her husband while opening her letter - দুটোতেই ভাবার্থ হয় আসছে না, নয় কম আসছে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson2 (6)",
                        "text1": "ঈশ্বরের ওপর প্রশ্নের কোন উত্তর তখনও পাওয়া যায় নি",
                        "text2": "The question on God was still found unanswered. <br> <br>এটি passive voice হবে বোঝাই যাচ্ছে, কারণ কে উত্তর পায়নি, সেটা বাক্যে বলা নেই । 'ঈশ্বরের ওপর প্রশ্ন' এখানে subject হিসেবে ব্যবহার করা হল । যদিও answer-কেও subject ধরা যেত, যেমন The answer to the question on God was still not found । এমনও লেখা যেত The question on God was still unanswered ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson2 (7)",
                        "text1": "তাই শ্রীরামকৃষ্ণের নির্দেশে স্বামিজী যোগ করেছিলেন",
                        "text2": "So guided by ShriRamkrishna, Swamiji did his yoga. <br> <br>এখানে দুটি বাক্যাংশ আছে, 'শ্রীরামকৃষ্ণের নির্দেশ' এবং 'স্বামিজীর যোগ' করা, তাই এরকম ইংরিজি হল, guided by ShriRamkrishna-একটি passive voice-এর ব্যবহার । guiding by ShriRamkrishna হলে ভুল হত । Under ShriRamkrishna's guidence, Swamiji did his yoga বা ShriRamkrishna guided to Swamiji to do his yoga - এ দুটোই ঠিক ।"
                      },
                       {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson2 (8)",
                        "text1": "কিছুকাল তাঁর পকেটে কোন অর্থ সঞ্চিত ছিল না",
                        "text2": "For some time he had no money saved in his pocket. <br> <br>সাজিয়ে নাও , কোন অর্থ ছিল না সঞ্চিত তার পকেটে, তাই হল had no money saved in his pocket । এখানে saved হল past participle-এর ব্যবহার । For some time no money was saved in his pocket - ভাল ইংরিজি নয় । his pocket had no money saved - এটাও ভাল ইংরিজি নয় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson2 (9)",
                        "text1": "তাও স্বামিজী সারা ভারত অক্লান্ত ঘুরে ছিলেন",
                        "text2": "Still Swamiji moved around India untired. <br> <br>এটি আর একটি past participle-এর ব্যবহার । 'অক্লান্ত ঘোরা' - move around untired । লক্ষ করে দেখ, verb-এর সঙ্গে ing জুড়ে present participle তখনই হয়, যখনই কোন কাজ ঘটছে (বা ঘটছিল) অথবা অসমাপ্ত আছে, তা সেটা অতীতে হোক বা বর্তমানেই হোক । past participle তখন হয়, যখন কাজটা শেষ হয়ে গেছে । 'অক্লান্ত ঘোরা' এখানে শেষ হয়ে গেছে, তাই untired হল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson2 (10)",
                        "text1": "তারপর ভারতবর্ষ ছেড়ে তিনি ১৮৯৩ সালে আমেরিকা যান",
                        "text2": "Then having left India, he went to America in 1893. <br> <br>এখানে লক্ষ্য কর, অতীতে ঘটলেও ভারতবর্ষ ছাড়ার রেশ নিয়ে তিনি আমেরিকা যান, তাই having left হল । present participle, past participle এবং perfect participle-এর ব্যবহারের তফাৎ করা শক্ত কাজ । Leave - Left - Left ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson2 (11)",
                        "text1": "তাঁর কাছে ভগবৎ গীতা হিন্দুদের লেখা একটি মহৎ বই",
                        "text2": "To him Bhagwat Geeta was a great book written by the Hindus. <br> <br>এটিও একটি past participle-এর ব্যবহার - written by the Hindus । এখানে book-এর পরেই written বসল । To him written by the Hindus Bhagwat Geeta was a great book লিখলে ঠিক হবে না । writing by the Hindus অথবা having written by the Hindus দুটোই ভুল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson2 (12)",
                        "text1": "সকলের ভালবাসা আর শ্রদ্ধা পেয়ে স্বামিজী ১৯০২ সালে গত হন",
                        "text2": "Loved and respected by all, Swamiji died in 1902. <br> <br>লক্ষ্য কর, এখানে being loved হল না, কারণ সেক্ষেত্রে ভালবাসা ও শ্রদ্ধা পাওয়ার কাজটা (অতীতে) ঘটছে বা অসমাপ্ত, এরকম বোঝাতো । তাই past participle হল । Swamiji died in 1902 after being loved and respected by all - ভাল ইংরিজি নয় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson2 (13)",
                        "text1": "তাঁর প্রতিষ্ঠা করা রামকৃষ্ণ মিশন তাঁর অসমাপ্ত কাজই করে",
                        "text2": "Founded by him, Ramkrishna Mission does his unfinished work only. <br> <br>এখানে 'রামকৃষ্ণ মিশন' - subject, অতএব  'তাঁর দ্বারা প্রতিষ্ঠা করা' অর্থাৎ founded by him 'রামকৃষ্ণ মিশন'-এর আগে বসবে । having founded বা being founded দুটোই এখানে প্রযোজ্য নয়, কারণ প্রতিষ্ঠা করার কাজটি সমাপ্ত এবং তার রেশও নেই । লক্ষ্য কর, অসমাপ্ত - unfinished, একটি participle adjective-এর ব্যবহার । আরও লক্ষ্য কর, প্রতিষ্ঠা করা(verb) - found (verb টাই found, এটি find-এর past tense নয়) ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson2 (14)",
                        "text1": "তাঁর মহত্ত্বে অনুপ্রাণিত হয়ে আমরা তাঁর অনুগমন করি",
                        "text2": "Having been inspired by his greatness, we follow him. <br> <br>এখানে having been হল দুটো কারণে এক, অনুপ্রাণিত হওয়ার রেশ নিয়ে আমরা অনুগমন করছি, তাই having-এর ব্যবহার হল, যদিও being লিখলেও খুব ভুল হত না, আর দুই, এখানে passive voice আছে তাই having been হল । Having inspired by his greatness, we follow him লিখলে ভুল হত ।"
                      }
]