[
                      {
                        "description": "",
                        "image1": "baby",
                        "name": "BPP1-Lesson3 (1)",
                        "text1": "শিশুটি বাগানে খেলছে <br> <br>The baby is playing ___ the garden.",
                        "text2": "The baby is playing <u>in</u> the garden. <br> <br>Garden হল একটা বদ্ধ জায়গা, তার ভেতরে খেলা হচ্ছে বলে in the garden হল - ঠিক যে কারণে আগের এক উদাহরণে in the car হয়েছিল । মজা হল এই যে, playing on the playground হয় আবার, in the playground হয় না । "
                      },
                      {
                        "description": "",
                        "image1": "deepak",
                        "name": "BPP1-Lesson3 (2)",
                        "text1": "দীপকের বন্ধুরা খেলার মাঠে ফুটবল খেলে <br> <br>Deepak's friends play football ____ the playground.",
                        "text2": "Deepak's friends play football <u>on</u> the playground. <br> <br>আগের উদাহরণেই বলা হয়েছে, in the garden হয়, কিন্তু on the playground হয় । আবার দেখ, there are many spectators in the stadium (অনেক দর্শক স্টেডিয়ামে আছে) হয় । মোট কথা, বদ্ধ জায়গা বুঝতে পারা গেলে (যেমন, garden বা stadium) সেক্ষেত্রে in বসবে, আর খুব পরিষ্কারভাবে বদ্ধ জায়গা বুঝতে পারা না গেলে on হবে । playground বদ্ধ জায়গা না-ও হতে পারে, তাই তার আগে on এল ।"
                      },
                      {
                        "description": "",
                        "image1": "thief",
                        "name": "BPP1-Lesson3 (3)",
                        "text1": "আজকের খবরের কাগজে সেই চোরের খবর রয়েছে <br> <br>News of that thief is ___ today’s newspapers.",
                        "text2": "News of that thief is <u>in</u> today’s newspapers. <br> <br>খবর খবরের কাগজের ওপর ছাপা হয়, তাই on হতেই পারত । কিন্তু a point in a large area - অর্থাৎ বড় কোন স্থান বা অঞ্চলের মধ্যে একটা ছোট স্থান বোঝালে (যেমন, newspaper-এর ভেতর একটা news) in ব্যবহার হবে । আবার put your hands on the newspaper - কারণটা বল দেখি ?"
                      },
                      {
                        "description": "",
                        "image1": "onpaper",
                        "name": "BPP1-Lesson3 (4)",
                        "text1": "তোমার হাত খবরের কাগজের ওপর রাখো <br> <br>Put your hand ___ the newspaper.",
                        "text2": "Put your hand <u>on</u> the newspaper. <br> <br>এখানে on হল, কারণ hand-কে পরিষ্কারভাবেই newspaper-এর ওপর রাখতে বলা হচ্ছে এক্ষেত্রে । এই উদাহরণ থেকে শিক্ষা পেলে এই যে, newspaper থাকলেই তার আগে অন্ধের মত in, on বা অন্য preposition বসাবে না । অবস্থা বুঝে ব্যবস্থা ।"
                      },
                      {
                        "description": "",
                        "image1": "race",
                        "name": "BPP1-Lesson3 (5)",
                        "text1": "দৌড়ের শুরুর লাইনে সব দৌড়বাজই সমান <br> <br>All runners are same ___ the start line of a race.",
                        "text2": "All runners are same <u>on</u> the start line of a race. <br> <br>জেনে রাখবে, স্থানের (বা সময়ের) পরিপ্রেক্ষিতে যত নির্দিষ্ট করে কোন বিষয়কে উল্লেখ করা যাবে, তত on বা at বসবে আর a point in a large area - অর্থাৎ যদি বড় কোন স্থান বা অঞ্চলের মধ্যে একটা ছোট স্থান বোঝালে (যেমন, newspaper-এর ভেতর একটা news), তখন in ব্যবহার হবে । start line খুবই নির্দিষ্ট, তাই on বসল - at লিখলেও ভুল হত না । এমনিতে সময়ের পরিপ্রেক্ষিতে at the start হয়, তবে সেটা preposition of time ।"
                      },
                      {
                        "description": "",
                        "image1": "drama",
                        "name": "BPP1-Lesson3 (6)",
                        "text1": "গল্পের শুরুতে কোন নাটকীয়তা নেই <br> <br>The story has no drama ___ the beginning.",
                        "text2": "The story has no drama <u>in</u> the beginning. <br> <br>এক্ষেত্রে start আর beginning-এর একটু তফাৎ আছে । start বেশ নির্দিষ্ট এক স্থান, কিন্তু beginning অত নির্দিষ্ট না-ও হতে পারে (ছবি দেখ) - এক্ষেত্রে নয় । এখানে beginning হল পুরো গল্পের ভেতর খানিকটা জায়গা জুড়ে স্থান - এক লাইনে drama তৈরী করার প্রশ্নই ওঠে না । তাই at the start of the story হয়, কিন্তু in the beginning the story has এরকম হবে । ঠিক এরকমভাবেই in the middle বা in the end-ও হবে । খুব নির্দিষ্ট করে বলা গেলে অবশ্য at the beginning-ও লেখা যায়, তবে সেটা এই উদাহরণে নয় ।"
                      },
                      {
                        "description": "",
                        "image1": "inmiddle",
                        "name": "BPP1-Lesson3 (7)",
                        "text1": "যে জন আছে মাঝখানে, তারই বিপদ <br> <br>He who is ___ the middle only is in danger.",
                        "text2": "He who is <u>in</u> the middle only is in danger. <br> <br>Middle বেশ খানিকটা স্থান, নির্দিষ্ট কিছু নয় । তাই in বসল তার আগে (আগের উদাহরণের ছবি খেয়াল কর) । complex sentence-টা ভালো করে খেয়াল কর - বিশেষত He who দিয়ে শুরু করাটা । আর 'বিপদের মধ্যে' এই অর্থে in danger হল ।"
                      },
                      {
                        "description": "",
                        "image1": "intheend",
                        "name": "BPP1-Lesson3 (8)",
                        "text1": "কেউ কেউ বলে, শেষে সব ঠিক হয়ে যায় <br> <br>Some say, everything is alright _____ the end.",
                        "text2": "Some say, everything is alright <u>in</u> the end. <br> <br>In the end হল পরিণতি । পরিণতি বোঝাতে in the end হয়, আর 'কোন কিছুর শেষে' বোঝাতে at the end হয়, যেমন at the end of the road, at the end of the story (এখানে in হবে না) । in the end হল, ঠিক যেমন in the beginning আর in the middle হয় । in the end of story কখনো হবে না, কারণ in the end-এর পর আর কিছু জুড়বে না । জুড়তে হলেই at the end (of the story বা road) লিখতে হবে । কেউ কেউ - some (ভুল - some some) ।"
                      },
                      {
                        "description": "",
                        "image1": "path",
                        "name": "BPP1-Lesson3 (9)",
                        "text1": "আমাদের পথের শেষে কি আছে ? <br> <br>What is there ___ the end of our path ?",
                        "text2": "What is there <u>at</u> the end of our path ? <br> <br>আগের উদাহরণের ব্যাখ্যায় বলা হয়েছে, end-এর সঙ্গে কিছু জুড়লেই end-এর আগে at বসবে আর in the end যদি শুধু (লেজুড় ছাড়া) বসে, তো বসবে । এখানে end of our path আছে - লেজুড় - তাই তার আগে at বসল । in the end শুধু পরিণতি বোঝাতেই ব্যবহার হয় । তাই শুধু at the end লিখবে না, লেজুড় থাকলে তবেই লিখবে । "
                      },
                      {
                        "description": "",
                        "image1": "ongrass",
                        "name": "BPP1-Lesson3 (10)",
                        "text1": "শিশুটি ঘাসের উপর হাঁটছে <br> <br>The baby is walking ___ the grass.",
                        "text2": "The baby is walking <u>on</u> the grass. <br> <br>ওপর দিয়ে হাঁটছে, অতএব on হবে, এটা তো বোঝাই যাচ্ছে ।"
                      },
                      {
                        "description": "",
                        "image1": "shop",
                        "name": "BPP1-Lesson3 (11)",
                        "text1": "বাঁদিকে একটা দোকান আছে <br> <br>There is a shop ___ the left side.",
                        "text2": "There is a shop <u>on</u> the left side. <br> <br>সত্যি কথা বলতে কি, খুব কোন নির্দিষ্ট কারণ নেই, কেন on হবে । Preposition-এর ক্ষেত্রে সব যে খুব নির্দিষ্ট নিয়ম মেনে চলে, তা নয় । on the left হয়, আবার To the left of the shop there is a playground - এখানে to হয়, যখন এক জায়গার left-এ আরেক জায়গা বোঝানোর প্রয়োজন পড়ে ।"
                      }
]