[
                      {
                        "description": "",
                        "image1": "underyear",
                        "name": "BPT2-Lesson3 (1)",
                        "text1": "এই লোকটি এক বছরের কম সময়ে পঁচিশ কেজি ওজন কমিয়েছে <br> <br>This man has lost 25 kilograms in ______ a year.",
                        "text2": "This man has lost 25 kilograms in <u>under</u> a year. <br> <br>over - বেশী, under - কম । preposition of place-এ over আর under যা অর্থে ব্যবহার হয় (ওপরে আর নীচে), preposition of time-এ সেই অর্থে ব্যবহার হয় না (বেশী আর কম), তবে অর্থ কাছাকাছি । এক বছরের কম - under a year, এক বছরের কম সময়ের মধ্যে - in under a year । ঠিক - less than ।"
                      },
                      {
                        "description": "",
                        "image1": "bolt",
                        "name": "BPT2-Lesson3 (2)",
                        "text1": "উসেইন বোল্ট একশো মিটার দৌড় শেষ করে দশ সেকেন্ডের কম সময়ে <br> <br>Usain Bolt completes 100 metre sprint in ______ ten seconds.",
                        "text2": "Usain Bolt completes 100 metre sprint in <u>under</u> ten seconds. <br> <br>আগের মতই । in under ten minutes ব্যবহারটা খেয়াল রাখবে । আরো লক্ষ্য কর - 100 metre sprint হয়, 100 metres sprint হয় না । "
                      },
                      {
                        "description": "",
                        "image1": "withinhour",
                        "name": "BPT2-Lesson3 (3)",
                        "text1": "এক ঘন্টার মধ্যে গোরা চাবিগুলি নিয়ে ফেরৎ আসবে <br> <br>Gora will return with the keys _______ an hour.",
                        "text2": "Gora will return with the keys <u>within</u> an hour. <br> <br>within ব্যবহার হয় একটা সময়কালের মধ্যে কোন কাজ করা বোঝাতে । within আর in-এর তাই খুব তফাৎ নেই । অতএব এখানে in an hour লিখলেও 'এক ঘন্টার মধ্যে'-ই বোঝাত । by 6 PM - এরকম লিখবে, by an hour এই উদাহরণে লিখলে তা ঠিক হবে না । "
                      },
                      {
                        "description": "",
                        "image1": "withinmonth",
                        "name": "BPT2-Lesson3 (4)",
                        "text1": "দু’মাসের মধ্যে বাড়ীটি রঙ করার আমাদের ইচ্ছে আছে <br> <br>We wish to paint the house _______ two months.",
                        "text2": "We wish to paint the house <u>within</u> two months. <br> <br>Within two months বা in two months - যে কোন একটাই লিখতে পারো । তবে এক্ষেত্রে by two months লিখো না (ছবি দেখ) । within একটা সময়কালের সঙ্গে ব্যবহার হয় (সময়কালের মধ্যে), আর by একটা সময়ের সঙ্গে (by June) ।"
                      },
                      {
                        "description": "",
                        "image1": "till",
                        "name": "BPT2-Lesson3 (5)",
                        "text1": "যতক্ষণ না আমার মা আসে, আমি এই জায়গা ছেড়ে যেতে পারি না <br> <br>I can not leave this place _____ my mother arrives.",
                        "text2": "I can not leave this place <u>till</u> my mother arrives. <br> <br>'যতক্ষণ না' - এই অর্থে till বা until ব্যবহার হয় । till আর until - দুটো একই অর্থে ব্যবহার করতে পারো বদলাবদলি করে - preposition of place-এর সময় বলা হয়েছে । till (বা until) যে ঘটনা আগে ঘটবে, তার আগে বসাবে । till/until-এর জায়গায় এখানে before দিলে ঠিক হবে না, কারণ 'যতক্ষণ না' এই বোধ before দিলে আসে না । to ব্যবহার তো আরোই ভুল । "
                      },
                      {
                        "description": "",
                        "image1": "till",
                        "name": "BPT2-Lesson3 (6)",
                        "text1": "ছেলেরা অন্ধকার হওয়া অবধি মাঠে খেলছিল <br> <br>The boys were playing in the field ______ dark.",
                        "text2": "The boys were playing in the field <u>until</u> dark. <br> <br>লেখা আছে 'অন্ধকার হওয়া অবধি', কিন্তু অর্থ করা যায় 'যতক্ষণ না অন্ধকার হয়' । তাই until dark হল । "
                      },
                      {
                        "description": "",
                        "image1": "behind",
                        "name": "BPT2-Lesson3 (7)",
                        "text1": "তাড়াতাড়ি কর, তুমি নির্ধারিত সময়ের পেছনে আছ <br> <br>Hurry up – you are _______ the schedule.",
                        "text2": "Hurry up – you are <u>behind</u> the schedule. <br> <br>যে পরিমাণ কাজ আজ পর্যন্ত করার কথা (schedule), তুমি সে পরিমাণ কাজ করনি (কম করেছ) । তাই তুমি behind schedule - নির্ধারিত সময়ের পেছনে ।"
                      },
                      {
                        "description": "",
                        "image1": "prabhat",
                        "name": "BPT2-Lesson3 (8)",
                        "text1": "প্রভাত অসুস্থ হয়ে পড়ে ক্লাসে পিছিয়ে পড়ল <br> <br>Prabhat became sick and fell _______ in his class.",
                        "text2": "Prabhat became sick and fell <u>behind</u> in his class. <br> <br>fall behind অবশ্য একটা group verb, যার অর্থ পিছিয়ে পড়া । ক্লাসে মধ্যে পিছিয়ে পড়া - fall behind in the class । তোমরা compound sentence পড়ার সময় এভাবে দুটো বাক্যকে জুড়তে দেখেছ । তাই তো ?"
                      },
                      {
                        "description": "",
                        "image1": "sabir",
                        "name": "BPT2-Lesson3 (9)",
                        "text1": "সাবির নির্ধারিত সময়ের বেশ কিছুদিন আগে কাজ শেষ করেছিল <br> <br>Sabir completed the work several days ________ the schedule.",
                        "text2": "Sabir completed the work several days <u>ahead of</u> the schedule. <br> <br>behind schedule - নির্ধারিত সময়ের পিছনে, আর ahead of schedule - নির্ধারিত সময়ের আগে । before-ও লেখা যায় ahead of-এর জায়গায় ।"
                      },
                      {
                        "description": "",
                        "image1": "swamiji",
                        "name": "BPT2-Lesson3 (10)",
                        "text1": "স্বামীজির ধ্যানধারণা ছিল তাঁর সময়ের চেয়ে অনেক এগিয়ে <br> <br>Swamiji's ideas were way ________ his time.",
                        "text2": "Swamiji's ideas were way <u>ahead of</u> his time. <br> <br>স্বামীজি যে সময় তাঁর যুগান্তকারী বাণীগুলি বলে গিয়েছিলেন, তা বেশী লোকে অনুধাবন করতে পারেন নি তাঁর জীবনকালে । তাই এরকম ধ্যানধারণার জন্ম যাঁরা দেন, তাঁদের নিজেদের জীবনকালের সময়ের চেয়ে অগ্রবর্তী বলা  হয় । তার ইংরিজি ahead of his time অর্থাৎ সময়ের চেয়ে এগিয়ে । ছবিতে যা লেখা আছে, অভেদ ফাউন্ডেশন কি তা-ই করছে না ?"
                      }
]