[
                      {
                        "description": "",
                        "image1": "till",
                        "name": "BPT2-Lesson2 (1)",
                        "text1": "সুহেল সকাল থেকে মায়ের অপেক্ষায় আছে <br> <br>Suhail has been waiting for her mother _______ morning.",
                        "text2": "Suhail has been waiting for her mother <u>since</u> morning. <br> <br>since ব্যবহার হয় 'একটা সময় থেকে' এটা বোঝাতে (since morning বা since birth) । for আর since-এর তফাতটা বোঝো ছবি দেখে । for একটা সময়কালকে বোঝায় (for a year, for a month, for a week) আর since ব্যবহার হয় 'একটা সময় থেকে' এটা বোঝাতে  (since evening, since marriage) ।"
                      },
                      {
                        "description": "",
                        "image1": "till",
                        "name": "BPT2-Lesson2 (2)",
                        "text1": "গতকাল দুপুর থেকে অবিরত বৃষ্টি হয়ে চলেছে <br> <br>It has been raining non-stop ______ yesterday afternoon.",
                        "text2": "It has been raining non-stop <u>since</u> yesterday afternoon. <br> <br>যেহেতু yesterday afternoon থেকে ঘটনা ঘটছে, তাই since হল (for দিলে ভুল হবে) । বলতে পারো, from হবে না কেন since-এর জায়গায় । কোন ঘটনার রেশ এখনো থাকলে (present perfect বা present perfect continuous tense) তখন since ব্যবহার করবে, নইলে from (past tense-এ) । My computer did not work yesterday from the morning - এটা ঠিক । এখানে since ব্যবহার কোরো না । I have not visited my aunt since last year - এটা ঠিক । এখানে আবার from ব্যবহার কোরো না ।"
                      },
                      {
                        "description": "",
                        "image1": "duringnight",
                        "name": "BPT2-Lesson2 (3)",
                        "text1": "রাত ধরে চাঁদ ঝলমল করছিল <br> <br>The moon shone brightly _______ the night.",
                        "text2": "The moon shone brightly <u>during</u> the night. <br> <br>একটা সময়কাল ধরে কোন ঘটনা ঘটলে during আর for দুটোই হয়, কিন্তু যখন নির্দিষ্ট সময়কাল হয়, (যেমন 4 hours বা two years বা three centuries) তখন for ব্যবহার করবে, আর অনির্দিষ্ট সময়কাল হলে (যেমন night, winter, life) তখনই during ব্যবহার হবে । ছবিতে এই তফাৎটা পরিষ্কার হবে । shine - ঝলমল করা । shine-shone-shone ।"
                      },
                      {
                        "description": "",
                        "image1": "duringnight",
                        "name": "BPT2-Lesson2 (4)",
                        "text1": "বিদেশভ্রমণের সময়ে আমি আমার পরিবারকে ঘন ঘন ফোন করতাম <br> <br>I called my family frequently _______ my foreign tour.",
                        "text2": "I called my family frequently <u>during</u> my foreign tour. <br> <br>আগের উদাহরণের নিয়মে foreign tour যেহেতু একটা অনির্দিষ্ট সময়কাল, তাই during বসল । frequently - বারবার বা ঘনঘন (often-ও লেখা যায়) । ফোন করা এই verb-কে ভাবপ্রদান করছে frequently এই adverb । "
                      },
                      {
                        "description": "",
                        "image1": "fromto",
                        "name": "BPT2-Lesson2 (5)",
                        "text1": "১৯৯৯ থেকে ২০১১ অবধি অস্ট্রেলীয়রা এক দিনের ক্রিকেটে বিশ্ব চ্যাম্পিয়ন ছিল <br> <br>Australians were the world champions of One Day cricket _____ 1999 ___ 2011.",
                        "text2": "Australians were the world champions of One Day cricket <u>from</u> 1999 <u>to</u> 2011. <br> <br>একটা সময় থেকে আরেকটা সময় বোঝাতে from-to ব্যবহার হয় । এটা সময়কালই বোঝাচ্ছে, কিন্তু শুরুর সময় আর শেষের সময়টা পরিষ্কার করে বলে তবেই সময়কালটা বোঝানো হচ্ছে । অতএব এই ক্ষেত্রে for, during ব্যবহার হবে না । in 1999 and 2011 - আরো ভুল । আর শুধুমাত্র শুরুর সময়টা বলা থাকলে from বা since বসে ।"
                      },
                      {
                        "description": "",
                        "image1": "from7to10",
                        "name": "BPT2-Lesson2 (6)",
                        "text1": "ছায়াছবিটি সন্ধ্যে সাতটা থেকে রাত দশটা অবধি টেলিভিশনে দেখানো হবে <br> <br>The movie will be shown on television _____ 7 PM ___ 10 PM.",
                        "text2": "The movie will be shown on television <u>from</u> 7 PM <u>to</u> 10 PM. <br> <br>৭টা আর ১০টা খুব নির্দিষ্ট সময়, তাই 7 PM-এর আগে from আর 10 PM-এর আগে to বসল । passive voice-টা খেয়াল কর । আর on television হয়, in television হয় না, কারণ দেখানোটা TV-র ওপরেই হয় ।"
                      },
                      {
                        "description": "",
                        "image1": "from7",
                        "name": "BPT2-Lesson2 (7)",
                        "text1": "রেস্টুরেন্টটি সকাল ৭টা থেকে ৮টার মধ্যে কম দামে খাবার দেয় <br> <br>The restaurant serves food at a lower price ________ 7 and 8 AM.",
                        "text2": "The restaurant serves food at a lower price <u>between</u> 7 and 8 AM. <br> <br>From-to আর between-and-এর কোন তফাৎ নেই, দুটোই খুব ব্যবহার হয় । শুধু প্রয়োগের তফাৎ । between 7 and 8 AM লেখা হয়, কখনো between 7 to 8 AM লিখবে না, ওটা ভুল । আরও লক্ষ্য কর, at a price হয় । in a price ভুল । gives food-এর চেয়ে serves food ভাল ইংরিজি ।"
                      },
                      {
                        "description": "",
                        "image1": "between",
                        "name": "BPT2-Lesson2 (8)",
                        "text1": "জন্ম-মৃত্যুর মাঝে ভীরুরা বহুবার মরে <br> <br>Cowards die many times ________ birth and death.",
                        "text2": "Cowards die many times <u>between</u> birth and death. <br> <br>লক্ষ্য কর, অনির্দিষ্ট শুরুর সময় আর শেষের সময় (যেমন - life বা death) থাকলেও from-to বা between-and ব্যবহার হয় । আবার মনে করিয়ে দেওয়া যাক, between birth to death ভুল । Coward - ভীরু । many times হল adverb, অতএব for many times লিখবে না । ওই coward lion-টা না হয়েও মাঝেমাঝে কিছুদিনের জন্য মরতে পারলে মন্দ হয় না, কি বল ? বিশেষত যখন মা বকুনি দিচ্ছে ।"
                      },
                      {
                        "description": "",
                        "image1": "over",
                        "name": "BPT2-Lesson2 (9)",
                        "text1": "আমরা দু ঘন্টার বেশী সময় ধরে অপেক্ষা করেছি <br> <br>We have waited for _____ two hours.",
                        "text2": "We have waited for <u>over</u> two hours. <br> <br>over two hours - দু'ঘন্টার বেশী সময় । লক্ষ্য কর, waited for a period of time এমনটা হয় - একটা সময়কাল ধরে অপেক্ষা করা বোঝাতে । এইবার ঐ period of time-এর জায়গায় over two hours বসাও । তাই for আর over পরপর বসল । over-এর জায়গায় more than-ও ব্যবহার করতে পারো - for more than two hours ।"
                      },
                      {
                        "description": "",
                        "image1": "overyear",
                        "name": "BPT2-Lesson2 (10)",
                        "text1": "তারা এক বছরের বেশী সময় ধরে  পরিকল্পনা করছে <br> <br>They have been developing the plan for ____ a year.",
                        "text2": "They have been developing the plan for <u>over</u> a year. <br> <br>একই উদাহরণ । over a year - এক বছরের বেশী সময় । for over a year - এক বছরের বেশী সময় ধরে । developing the plan লিখতে পারো, আবার শুধু planning-ও লিখতে পারো ।"
                      }
]