[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson1 (1)",
                        "text1": "Simple (সরল বাক্য) to Compound (যৌগিক বাক্য): <br> <br>He speaks like a leader.",
                        "text2": "He speaks as a leader does. <br> <br>Compound sentence বা যৌগিক বাক্যে দুটো বা তার বেশি সরল বাক্যকে conjunction বা coma দিয়ে যোগ করা হয় ।  যে conjunction-গুলো সাধারণত compound sentence-এ ব্যবহার হয় সেগুলো হল - and, but, or, for, nor, also, as, however, moreover, thus, so, therefore, else, still, as well as, accordingly, otherwise, yet, not yet, but also, either or, neither nor, on the contrary ইত্যাদি । এখন সরল বাক্য থেকে যৌগিক বাক্যে রূপান্তর করতে গেলে মূল বক্তব্যকে দুই বা তার বেশি সরল বাক্যে সম্প্রসারণ করে প্রয়োজনমত conjunction দিয়ে যোগ করে যৌগিক বাক্যটি গঠন করতে হবে । ওপরের সরল বাক্যটি আছে 'He speaks like a leader' মানে 'সে নেতার মতো কথা বলে'।  এই বাক্যটিকে যৌগিক (compound) বাক্যে রূপান্তর করতে গেলে এইভাবে ভাবতে হবে -  'সে কথা বলে যেমন একজন নেতা বলে' । দুটো সরল বাক্য যোগ করা হয়েছে -  যেমন ' সে কথা বলে'  আর 'একজন নেতা বলে' । এটাকে ইংরিজিতে লিখলে হবে 'He speaks as a leader does' । এখানে as হল conjunction ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson1 (2)",
                        "text1": "Simple (সরল বাক্য) to Compound (যৌগিক বাক্য): <br> <br>He is too weak to walk.",
                        "text2": "He is so weak that he can not walk. <br> <br>'He is too weak to walk' - অর্থ  'সে হাঁটার পক্ষে দুর্বল'। এই সরল বাক্যটিকে যৌগিক বাক্যে রূপান্তর করতে গেলে এইভাবে ভাবতে হবে : 'সে এতই দুর্বল যে হাঁটতে পারে না' । এখানে ' সে এতই দুর্বল' (he is so weak) আর 'সে হাঁটতে পারে না' (he can not walk)  - এই দুটো সরল বাক্যকে যোগ করা হয়েছে 'that' এই conjunction দিয়ে । এরকম বাক্য আরো হয় - Robin is too good a boy to do this sin (রবীন এতটাই ভাল ছেলে যে সে এই পাপ করতে পারে না), The match was too boring to watch (খেলা্টা এতটাই বিরক্তিকর যে দেখা যায় না) । এই ব্যবহারটা লক্ষ্য রাখো, অন্য জায়গায় প্রয়োজনমত ব্যবহার কোরো ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson1 (3)",
                        "text1": "Simple (সরল বাক্য) to Compound (যৌগিক বাক্য): <br> <br>He is too poor to buy a car.",
                        "text2": "He can not buy a car as he is very poor. <br> <br>'too poor to buy a car' অথবা 'too weak to walk'-এ 'too' বলতে বোঝানো হয় 'অত্যধিক' । 'Too weak to walk' - এত অত্যধিক অসুস্থ যে হাঁটতে পারছে না । 'Too poor to buy a car' - এত অত্যধিক গরীব যে গাড়ি কিনতে পারছে না । তাই কোন সরল বাক্যে (simple sentence) যখন  'too ... to....'  এই ধরনের phrase থাকবে, তখন আমাদের বুঝে নিতে হবে কোন একটা ঘটনা বেশি হওয়াতে অন্য ঘটনা্টা তার ফল । 'He is too poor to buy a car'-কে দুটো সরল বাক্যে দুভাবে ভাঙতে পারা যায় - 'সে গাড়ি কিনতে পারবে না কারণ সে খুব গরীব' বা আগের উদাহরণের মত ' সে এত অত্যধিক গরীব যে গাড়ি কিনতে পারছে না' । তাই compound sentence-টা এভাবে লেখা হয় - He can not buy a car as he is very poor বা He is so poor that he can not buy a car । দুটোই ঠিক ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson1 (4)",
                        "text1": "Simple (সরল বাক্য) to Compound (যৌগিক বাক্য): <br> <br>In spite of being poor he is happy.",
                        "text2": "He is poor, but he is happy. <br> <br>in spite of being poor - গরীব হওয়া সত্ত্বেও (in spite of poor ভুল) । in spite of being poor he is happy - গরীব হওয়া সত্ত্বেও সে সুখী । এই বাক্যটকে যৌগিক বাক্য হিসাবে লিখতে গেলে লেখা যায় 'সে গরীব, কিন্তু সে সুখী', যার ইংরিজি He is poor but/still he is happy ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson1 (5)",
                        "text1": "Simple (সরল বাক্য) to Compound (যৌগিক বাক্য): <br> <br>In spite of being my friend he did not help me.",
                        "text2": "He is my friend, still he did not help me. <br> <br>সরল বাক্যটির অর্থ - বন্ধু হওয়া সত্ত্বেও সে আমায় সাহায্য করে নি (তোমরা আবার এরকম কোরো না যেন !) । দুটো সরল বাক্যে এই বাক্যকে কিভাবে ভাঙা যায় ? এক, 'যদিও সে আমার বন্ধু, তবুও সে আমায় সাহায্য করে নি' (Although he is my friend, he did not help me) বা 'সে আমার বন্ধু, তবুও সে আমায় সাহায্য করে নি (He is my friend, still he did not help me) । দুটোই লিখতে পারো । সরল-যৌগিক বাক্যের রূপান্তর কিভাবে করবে, সেটাই শুধু ভেবো না, বিভিন্ন ব্যবহারগুলো ভালো করে খেয়াল কর আর পরে সুযোগমত ব্যবহার কোরো ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson1 (6)",
                        "text1": "Simple (সরল বাক্য) to Compound (যৌগিক বাক্য): <br> <br>In spite of being your friend I can not help you.",
                        "text2": "I am your friend, still I can not help you. <br> <br>এই রে, এবার তো আমিই বন্ধুকে সাহায্য করতে পারছি না । যাক, এই উদাহরণটা একদম আগের উদাহরণের মত । আমি তোমার বন্ধু, তবুও তোমায় সাহায্য করতে পারছি না - I am your friend, still I can not help you । প্রশ্ন করতে পারো, দুটো বাক্যের তো একই অর্থ তাহলে কখন সরল আর কখন যৌগিকটা ব্যবহার করব ? একটু খেয়াল করলেই বুঝতে পারবে, অর্থ এক হলেও বাক্যদুটির মধ্যে ব্যঞ্জনার সামান্য তফাৎ আছে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson1 (7)",
                        "text1": "Simple (সরল বাক্য) to Compound (যৌগিক বাক্য): <br> <br>Beside being intelligent he is also diligent.",
                        "text2": "He is not only intelligent but also he is diligent. <br> <br>সরল বাক্যটি এইরকম 'beside being intelligent he is also diligent', যার অর্থ হল 'বুদ্ধিমান হওয়া ছাড়াও সে পরিশ্রমী' । এখানে 'Intelligent' মানে হল 'বুদ্ধিমান' আর 'diligent' মানে হল 'পরিশ্রমী' । যদি সরল বাক্যে কোন ব্যাক্তির সম্পর্কে তার দুরকম গুণ বা দুরকম দোষের কথা প্রকাশ করা হয় (এটা ছাড়াও ওটা), তবে যৌগিক বাক্য করতে গেলে বাক্যের গঠন এরকম হয় -. 'He is not only intelligent but also he is diligent' । এখানে লোকটিকে সরল বাক্যে 'বুদ্ধিমান' আর পরিশ্রমী' দু্টোই বলা হয়েছে । তাই compound sentence-এ তার গুণদুটো  'not only......but also.....' এইভাবে প্রকাশ করা হয়েছে - সে শুধুমাত্র এটা নয়, ওটাও বটে । He is not only intelligent but also diligent লিখলে ঠিক হত, কিন্তু সেটা compound sentence হত না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson1 (8)",
                        "text1": "Simple (সরল বাক্য) to Compound (যৌগিক বাক্য): <br> <br>The man being very hungry ate too much.",
                        "text2": "The man was very hungry, so he ate too much. <br> <br>সরল বাক্যটি হল 'The man being very hungry ate too much' । এখানে 'being very hungry' মানে হল 'খুব ক্ষুধার্ত হয়ে' । আর 'ate too much' মানে 'খুব খেয়েছিল' । তাই পুরো বাক্যটির মানে হল 'লোকটি ক্ষুধার্ত হয়ে অনেক খেয়েছিল' । এখানে দুটি সরল বাক্য হল 'লোকটি খুব ক্ষুধার্ত ছিল' (The man was very hungry) আর 'সে খুব খেয়ে নিয়েছিল' (He ate too much) এই দুটি সরল বাক্য কে তাই so দিয়ে যোগ করে যে যৌগিক বাক্যটি গঠন হল সেটা হল The man was very hungry, so he ate too much । আগের উদাহরণের নিয়ম মেনে The man was so hungry that he ate too much বা The man ate too much as he was very hungry-ও মোটামুটি ঠিক ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson1 (9)",
                        "text1": "Simple (সরল বাক্য) to Compound (যৌগিক বাক্য): <br> <br>Being dissatisfied he resigned from his position.",
                        "text2": "He was dissatisfied, so he resigned from his position. <br> <br>বাক্যে 'being' থাকা মানে বুঝতে হবে কোন একটা অবস্থায় subject আছে। তাই ওপরের বাক্যে 'Being dissatisfied he resigned from his position'-এর অর্থ বুঝতে হবে যে 'সে অসন্তুষ্ট (অবস্থায়) ছিল তাই তার পদ থেকে ইস্তফা দিয়েছিল'। সরল বাক্যে যদি 'being' থাকে তবে তাকে যৌগিক বাক্যে রূপান্তর করতে গেলে দুটো বাক্যকে যোগ করতে অনেকসময়ই so ব্যবহার করতে হয় । ওপরের বাক্যটিকে যৌগিক বাক্যে রূপান্তর করতে গেলে এই ভাবে ভাবতে হবে যে 'লোকটি অসন্তুষ্ট ছিল' (The man was dissatisfied) 'তাই সে তার পদ থেকে ইস্তফা দিয়েছিল' (so he resigned from his position) । "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson1 (10)",
                        "text1": "Simple (সরল বাক্য) to Compound (যৌগিক বাক্য): <br> <br>Having finished his exercise he put away his books.",
                        "text2": "He finished his exercise and put away his books. <br> <br>'Put away' মানে কোন জিনিসকে সরিয়ে রাখা বা ত্যাগ করা । মূল বাক্যে আছে যে 'Having finished his exercise he put away his books' । এর মানে হল 'অনুশীলনী শেষ করে সে তার বইগুলো সরিয়ে রাখল' । এখানে কিন্তু so দিয়ে অনুশীলনী শেষ করা আর বইগুলো সরিয়ে রাখার বাক্যদুটো জোড়া হবে না, কারণ এটা খুব পরিষ্কার নয় যে অনুশীলনী শেষ করার জন্যই বইগুলো সরিয়ে রাখা হল । বরং অনুশীলনী শেষ করল and বইগুলো সরিয়ে রাখল - এটাই যুক্তিযুক্ত । তাই হল, he finished his exercise and put away his books ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson1 (11)",
                        "text1": "Simple (সরল বাক্য) to Compound (যৌগিক বাক্য): <br> <br>Owing to bad luck he met with a bad accident on his birthday.",
                        "text2": "He was unlucky and therefore he met with a bad accident on his birthday. <br> <br>বড় বা বোঝবার-অসুবিধে-হচ্ছে এমন simple sentence থাকলে পড়বার সুবিধের জন্য দুটো সরল বাক্য লিখে and দিয়ে জুড়ে দেওয়া হয়, যা আসলে একটি compound sentence । 'Owing to bad luck'-এর অর্থ 'ভাগ্য খারাপ হবার কারণে' (owing - কারণে) । 'Owing to bad luck he met with a bad accident on his birthday' এই পুরো বাক্যটির মানে হল 'খারাপ ভাগ্যের কারণে সে তার জন্মদিনে দুর্ঘটনার সম্মুখীন হয়েছিল' (met with - সম্মুখীন হওয়া) । ওপরের সরল বাক্যটি থেকে বোঝা যায় যে 'তার ভাগ্য খারাপ ছিল আর সেইজন্যই সে তার জন্মদিনে দুর্ঘটনার সম্মুখীন হয়েছে' । তাই লেখা যায়,  'He was unlucky' (তার ভাগ্য খারাপ ছিল)  এবং 'He met with a bad accident on his birthday' (সে তার জন্মদিনে দুর্ঘটনার সম্মুখীন হয়েছিল) । এই দুটি সরল বাক্যকে  'and therefore' (আর সেইজন্যই) এই conjunction দিয়ে যোগ করা যায় । কোথায় কোন conjunction ব্যবহার হবে সেটা বাক্যটিকে একটু সাজিয়ে নিয়ে ভাবতে হবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson1 (12)",
                        "text1": "Compound (যৌগিক বাক্য) to Simple (সরল বাক্য): <br> <br>He is rich but he is unhappy.",
                        "text2": "In spite of being rich he is unhappy. <br> <br>Compound Sentence থেকে Simple sentence করতে গেলে সুপ্রযুক্ত শব্দগুছ বা appropriate Phrase ব্যবহার করে যৌগিক বাক্যটিকে ছোট করে সরল বাক্য করতে হবে । He is rich but he is unhappy - সে ধনী কিন্তু সে অসুখী ।  'সে ধনী' আর 'সে অসুখী' এই দুটি সরল বাক্যকে একটা সরল বাক্যে রূপান্তরিত করতে হলে এইভাবে ভাবতে হবে যে 'ধনী হওয়া সত্ত্বেও সে অসুখী'। সত্ত্বেও - in spite of । তাই পুরোটা হল, In spite of being rich he is unhappy । এরকমও লেখা যেত, He is rich but unhappy । সেটাও সরল বাক্য ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson1 (13)",
                        "text1": "Compound (যৌগিক বাক্য) to Simple (সরল বাক্য): <br> <br>He is not only weak but also he is ill.",
                        "text2": "Besides being weak he is also ill. <br> <br>যদি কোন compound sentence-এ 'not only......but also....'  এই রকম থাকে সেক্ষেত্রে সেই বাক্যটিকে simple sentence করতে গেলে বেশীর ভাগ ক্ষেত্রে 'being' ব্যবহার হয় ।  এখানে 'He is not only weak but also he is ill'-এর অর্থ 'সে শুধুমাত্র দুর্বলই নয়  সে অসুস্থও বটে' । সরল বাক্যটি এইভাবে ভাবতে হবে যে 'দুর্বল হওয়ার সাথে সাথে সে অসুস্থও '। তাই simple sentence হল 'Besides being weak he is also ill' (besides being ill - অসুস্থ হওয়া ছাড়াও) । besides weak লিখলে ভুল হবে, লিখতে হবে besides being weak । He is weak and ill লিখলে বাক্যের প্রয়োজনীয় ভাব কিন্তু আসবে না । বরং লিখতে পারো, he is not only weak but also ill । এই besides, in spite of ইত্যাদি phrase-গুলো শিখে রাখো ।  "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson1 (14)",
                        "text1": "Compound (যৌগিক বাক্য) to Simple (সরল বাক্য): <br> <br>He went to a doctor and told of his illness.",
                        "text2": "Going to a doctor he told of his illness. <br> <br>Compound sentence-এ দুটো কাজ থাকলে simple sentence করতে গেলে কাজদুটোর মধ্যে যেটা আগে হয়েছে সেই কাজের verb-এর সঙ্গে ing যোগ করা হয় - একে participle বলে - আর তারপর বাক্যদুটোকে যুক্ত করা হয় । যেমন এখানে আছে 'He went to a doctor and told of his illness'  - 'সে ডাক্তারের কাছে গিয়েছিল এবং তার অসুস্থতার কথা  বলেছিল' । এখানে ডাক্তারের কাছে যাবার কাজটা আগে হয়েছিল । তাই লিখতে হবে 'going to a doctor he told of his illness' । এরকম আরো হয় - Feeling pain in mind Suresh came to me (সুরেশ মনে ব্যথা পেয়ে আমার কাছে এসেছিল) । "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson1 (15)",
                        "text1": "Compound (যৌগিক বাক্য) to Simple (সরল বাক্য): <br> <br>The children saw the giant and ran away.",
                        "text2": "Seeing the giant the children ran away. <br> <br>আগের উদাহরণের মতই । এখানেও 'দেখা' আগে হয়েছে বলে see-এর সঙ্গে ing যোগ করে হল Seeing the giant the children ran away - অর্থ, দৈত্যকে দেখে বাচ্চারা দৌড়ে পালাল । "
                      }
]