[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson1 (1)",
                        "text1": "I love you.",
                        "text2": "You are loved by me. <br> <br>I love you বাক্যটি আছে active voice-এ । subject (এখানে I) যখন সরাসরি কোন কাজ করে (বা act করে), তখন যে ভাবে বাক্যটি ও বিশেষত verb-টাকে লেখা হয়, তাকে বলে active voice - যেমন I do it  বা He cleans dresses বা We loved football ইত্যাদি । এই উদাহরণগুলিতে I, He আর We ইত্যাদি subject সরাসরি কাজ (বা act) করছে (do, cleans আর loved) object-এর ওপর, যা হল it, dresses আর football । এর উল্টো হল passive voice, যাতে active voice-র subject নিষ্ক্রিয় বা গ্রহণকারীর ভূমিকা নেয় - তাই passive (নিষ্ক্রিয়) - আর তাই হয়ে যায় object । তখন active voice-র object নিয়ে নেয় passive voice-এ মূল ভুমিকা - সেটাই subject হয়ে যায় passive voice-এ । তাই active voice-এর subject I-এর জায়গায় passive voice-এ এল you । অতএব ঘুরিয়ে লিখতে হল, are loved by me ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson1 (2)",
                        "text1": "I take the pen.",
                        "text2": "The pen is taken by me. <br> <br>'আমি পেনটি নিই'-কে ঘুরিয়ে সাজিয়ে নাও 'আমার দ্বারা পেনটি নেওয়া হয়' । Active voice-এ the pen ছিল object, তাই passive voice-এ হয়ে গেল subject । আমি (I) passive voice-এ গুরুত্ব হারালাম, নিষ্ক্রিয় বা গ্রহণকারী হয়ে গেলাম, the pen হয়ে গেল subject । লক্ষ্য কর, passive voice-এ সবসময় past participle form-টা ব্যবহার হয় verb-এর - যেমন taken, loved, gone ইত্যাদি । তার আগে অবশ্য past tense বসবেই, তার কোন মানে নেই । active voice-এ যে tense ছিল, সেটাই passive voice-এ রাখতে হবে । তাই take (present tense) ছিল বলে এখানে হল is taken (present tense) । ভুল - was taken ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson1 (3)",
                        "text1": "We play football.",
                        "text2": "Football is played by us. <br> <br>'আমরা ফুটবল খেলি'-কে ঘুরিয়ে নিলে হবে 'আমাদের দ্বারা ফুটবল খেলা হয়' । অতএব passive voice-এ ফুটবল হয়ে গেল subject । ফুটবল খেলা হয় - football is played, কারণ play-এর past participle হল played আর present tense-টা present tense-ই রইল । আমাদের দ্বারা - by us । লক্ষ্য রাখবে, active voice-এ we আছে বলে passive voice-এ football are না হয়ে যায় । by us হবে, by we ভুল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson1 (4)",
                        "text1": "No one hates me.",
                        "text2": "I am hated by no one. <br> <br>'কেউ আমায় ঘৃণা করে না'-কে ঘুরিয়ে নাও 'আমি কারো দ্বারা ঘৃণিত হই না' । active voice-এর subject ছিল no one, সেটার জায়গায় passive voice-এ subject হয়ে গেল I । লক্ষ্য কর, me হয়ে গেল I am (কারণ বাক্যটা আছে present tense-এ), আর সেই আগের মতই hated হল (past participle) । 'কারো দ্বারা না'-র ইংরিজি হল by no one ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson1 (5)",
                        "text1": "You do not like them.",
                        "text2": "They are not liked by you. <br> <br>'তুমি তাদের পছন্দ কর না'-কে করে নাও 'তারা তোমার দ্বারা পছন্দিত হয় না' । এরপর subject-কে object করা, আর object-কে subject করা । তাই them থেকে হয়ে গেল they, আর you (subject) রইল you (object) । এবার tense । বলাই বাহুল্য, present tense-ই রাখতে হবে । তাই they are হল । ভুল - they are liked not by you । আরো ভুল - they do not be liked by you । মনে রাখবে, do not হয়ে যাবে is/are not liked ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson1 (6)",
                        "text1": "A dog does not like cats.",
                        "text2": "Cats are not liked by a dog. <br> <br>আগের মতই, শুধু are not liked হল । কখনো do not be liked লিখবে না, ওটা ভুল । আর Cats are liked not by a dog-ও ভুল ইংরিজি । past participle-গুলো ভালো করে শিখে নিলে তবেই voice change করতে সুবিধে হয় । "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson1 (7)",
                        "text1": "Pinky laughs loudly.",
                        "text2": "এটার passive voice হয় না, কারণ এই বাক্যের কোন object নেই (loudly হল adverb) । এই ধরণের verb-কে (laugh) বলে intransitive verb, যেগুলোর দ্বারা কাজ করা হয় বটে, কিন্তু সেগুলোর কোন object-এর ওপর কাজ করার দরকার পড়ে না, এসব কাজ একা একাই করা যায় । যেমন, laugh, cry, go, come ইত্যাদি । Transitive verb, যা object-এর ওপর কাজ করে, সেটা থাকলেই কেবলমাত্র আমরা passive voice করার কথা ভাবব । Intransitive verb থাকলে passive voice হয় না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson1 (8)",
                        "text1": "He is a liar.",
                        "text2": "এটারও passive voice হয় না, কারণ subject-verb-object কাঠামো এই বাক্যেরও নেই । He হল subject, আর is যদি verb ধরি, তাহলেও liar কোন object নয় যে, He তার ওপর কাজ করবে । liar হল একটা adjective । আরেকটা কথা জেনে রাখবে যে passive voice তখনই ব্যবহার করবে যখন কে কাজটা করছে (subject), সেটাকে তুমি গুরুত্ব দিতে চাইছ না তোমার বাক্যে, কাজটা কার ওপর বা কী কাজ (object), সেটাকে বেশী গুরুত্ব দিতে চাইছ । এই গুরুত্ব দেওয়ার ব্যাপারটা আবার গল্প বা paragraph  বা চিঠির পরিস্থিতির ওপর নির্ভর করে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson1 (9)",
                        "text1": "I am doing yoga now.",
                        "text2": "I am doing yoga now. <br> <br>আগে subject আর object ঘুরিয়ে নেবে । তাই passive voice-এ yoga হল subject, আর I হয়ে গেল by me (আমার দ্বারা) । Present continuous tense আছে (am doing), তাই সেটা passive-এ হয়ে গেল is being done, কারণ yoga হল third person singular । লক্ষ্য কর, is done আর being done-এর তফাৎ হল 'করা হয়' আর 'করা হচ্ছে'-র যা তফাৎ । football is being played, house is being made, Tajmahal is being seen - খেলা হচ্ছে, তৈরী করা হচ্ছে, দেখা হচ্ছে । 'হচ্ছে' আছে বলে being বসে, been নয় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson1 (10)",
                        "text1": "My mother is giving me food.",
                        "text2": "I am being given food by my mother. <br> <br>লক্ষ্য কর, এখানে active voice-এ দুটো object আছে - me আর food । তাই passive voice-এ যে কোনো একটিকেই subject করা যায়, কারণ সাজিয়ে নিতে পারো - মায়ের দ্বারা আমি খাবার প্রদত্ত হই বা মায়ের দ্বারা আমায় খাবার দেওয়া হয় । দুটো passive voice-এর ব্যবহার, কোনটা করবে তা নির্ভর করে তুমি 'খাবার' না 'আমি' কার ওপর জোর দিতে চাইছ । তাই প্রথমটা হবে I am being given food by my mother, আর দ্বিতীয়টা হবে food is being given to me by my mother । প্রথম বাক্যে given to food ভুল, আর দ্বিতীয় বাক্যে given me ভুল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson1 (11)",
                        "text1": "Your music has made a painful sound.",
                        "text2": "A painful sound has been made by your music. <br> <br>'তোমার সংগীত একটি পীড়াদায়ক শব্দ তৈরী করেছে'-কে ঘুরিয়ে সাজিয়ে নাও এইভাবে - তোমার সংগীত দ্বারা একটি পীড়াদায়ক শব্দ তৈরী হয়েছে । তাই হল, A painful sound has been made by your music । খেয়াল রাখবে, active voice-এ has, have বা had থাকলে passive voice-এ has been, have been বা had been লিখতে হবে । has being ভুল, কারণ being দিয়ে present continuous বা past continuous tense বোঝানো হয় passive voice-এ । এখানে আছে present perfect tense (has) । "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson1 (12)",
                        "text1": "Mr. Mitra had taught us grammar.",
                        "text2": "We had been taught grammar by Mr. Mitra. <br> <br>দুটো ব্যাপার খেয়াল কর । এক, had-এর পরেও been হল, কারণ been সবসময়ই perfect বোঝাতে ব্যবহার হবেই, তা সে present perfect হোক, বা past perfect । কখনো had being লিখবে না, ওটা ভুল । আর দুই, এখানেও দুটো object আছে - us আর grammar । যে কোন একটাকেই passive-এ subject করা যায় । তাই এমনও লেখা যেত - Grammar had been taught to us by Mr. Mitra । লক্ষ্য রেখো, আগের উদাহরণের মতই taught us (যেমন, given me) লিখলে ভুল হত ।"
                      }
]