[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson2 (1)",
                        "text1": "Nafsina touched my hand with love.",
                        "text2": "My hand was touched by Nafsina with love. <br> <br>সাজিয়ে নাও, আমার হাত নাফসিনার দ্বারা স্পর্শ করা হল । এবার tense দেখবে । এটা simple past tense । ঠিক যেমন simple present tense-এ am/is/are loved, am/is/are played, am/is/are taken হয়, simple past-এর passive voice-এর ক্ষেত্রেও was/were loved, was/were played বা was/were taken হয় । তাই এখানে হল was touched । লক্ষ্য রাখবে, with love বা কোন adverb বা কোন adjective-এর কোন পরিবর্তন করা হয় না voice change করতে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson2 (2)",
                        "text1": "I told you these words before.",
                        "text2": "These words were told to you by me before. <br> <br>তিনটে ব্যাপার লক্ষ্য করার আছে । এক, এখানেও দুটো object - you আর these words । আমরা these words দিয়ে শুরু করলাম, যদিও You were told these words before-ও লেখা যেত । দুই, were told হল, কারণ these words হল plural । আর তিন, told to you হল, told you নয় । বারবার আগে আমরা বলেছি, said to you হয়, কিন্তু told you লিখতে হয় । মনে করে দেখ, সেটা সবসময় active voice ছিল । passive-এ told to you লিখতেই হবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson2 (3)",
                        "text1": "My father was driving a car very fast.",
                        "text2": "A car was being driven very fast by my father. <br> <br>আছে - আমার বাবা খুব জোরে একটা গাড়ি চালাচ্ছিলেন । তাই সাজিয়ে নাও, একটা গাড়ি আমার বাবার দ্বারা খুব জোরে চালিত হচ্ছিল । সেই আগের মতই, past perfect অর্থাৎ was driving আছে বলে was being driven হল । present perfect থাকলে যেমন is being driven হয় । ভুল - A car was driven by my father very fast, কারণ very fast হল adverb, যা verb (driven)-এর পরেই আসবে । "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson2 (4)",
                        "text1": "Paritosh was cheating us lot of money.",
                        "text2": "We were being cheated lot of money by Paritosh. <br> <br>ঠিক আগের উদাহরণের মতই । এখানে we আর lot of money দুটোর যে কোন একটাকেই subject করা যায় passive voice-এ । দ্বিতীয়টাকে করা হলে বাক্যটা দাঁড়াত - Lot of money was being cheated on us by Paritosh । এখানে ভুল হত, যদি cheated on us না লিখে cheated us লেখা হত । আর লক্ষ্য কর, continuous আছে বলে cheating হল being cheated । আর past tense আছে বলে we were হল । lot of money কোন adverb নয়, তাই ওটা by Paritosh-এর পরে লিখলেও ভুল হয় না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson2 (5)",
                        "text1": "We were having lunch at that time.",
                        "text2": "Lunch was being had by us at that time. <br> <br>I have a pen-এর মত have-এর ব্যবহার এখানে হয় নি । এখানে were having অর্থ 'খাচ্ছিলাম' । তাই ঠিক আগের মতই নিয়ম মেনে was being had হল, খাওয়া অর্থে have-এরও past participle হল had । আর was being কেন হল, তা তো আগেই বলা হয়েছে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson2 (6)",
                        "text1": "I shall not give you any trouble.",
                        "text2": "You will not be given any trouble by me. <br> <br>সাজিয়ে নাও, তুমি আমার দ্বারা কোন অসুবিধাপ্রাপ্ত হবে না । active voice-এর will give, shall take ইত্যাদি হয়ে যায় will be given বা shall be taken । ভুল - will being given বা will been taken । এখানেও দুটো object আছে - you আর any trouble । তাই No trouble will be given to you by me-ও লেখা যেত, যদিও any trouble will not be given to you by me ভুল ইংরিজি । You will be not given-ও ঠিক নয় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson2 (7)",
                        "text1": "I shall go to the market.",
                        "text2": "এটার passive voice জোর করেও করবে না, কারণ market বাক্যের কোন object হিসেবে ব্যবহার হয় নি । Market was gone to by me কোন অবস্থাতেই ব্যবহারযোগ্য নয় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson2 (8)",
                        "text1": "He only would know the meaning of love.",
                        "text2": "The meaning of love would be known to him only. <br> <br>Shall, will যেমন passive voice-এ shall be, will be হয়, তেমনি would, should হয়ে যায় would be, should be । বাকিটা পরিষ্কার । শুধু লক্ষ্য কর, known to him হয়েছে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson2 (9)",
                        "text1": "The Guptas should not hate their neighbours.",
                        "text2": "Their neigbours should not be hated by the Guptas. <br> <br>আগে যেমন বলা হয়েছে, should not হয়ে যায় should not be । ভুল - should be not । বাকিটা আগের মত ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson2 (10)",
                        "text1": "I could be a cricketer.",
                        "text2": "এটার কোন passive voice হয় না, কারণ কোন object নেই, যার ওপর subject (I) কাজ করছে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson2 (11)",
                        "text1": "I could play cricket instead of football.",
                        "text2": "Cricket instead of football could be played by me. <br> <br>জেনে রাখবে, can, could, shall, should, may, might, must - এই সবেরই পরে যেমন active voice-এ শুধু verb-টি অপরিবর্তিতভাবে ব্যবহার হয়, যেমন I can speak, you may play, she must run ইত্যাদি, তেমনি passive voice-এও can be spoken, may be played, must be run হয়, অর্থাৎ be আর তারপর past participle হয় - অন্য কিছু হয় না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson2 (12)",
                        "text1": "Martha may learn Spanish in six months.",
                        "text2": "Spanish may be learnt by Martha in six months. <br> <br>আগের উদাহরণেই বলা হয়েছে, can, may ইত্যাদির পর be দিয়ে verb-এর past participle form ব্যবহার হয় । তাই এখানে হল may be learnt, কারণ learn-এর past participle হল learnt (অবশ্য learned-ও লেখা যায়) ।"
                      }
]