[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson3 (1)",
                        "text1": "Ashraful should have said nothing.",
                        "text2": "Nothing should have been said by Ashraful. <br> <br>'আশরাফুলের কিছু বলা উচিৎ হয় নি'-কে সাজিয়ে নিতে হবে 'কিছু আশরাফুলের দ্বারা বলা উচিৎ হয় নি' । এই 'হয় নি' (বা 'না হয়েছে') আছে বলে active voice-এ have ব্যবহার হয়েছে should-এর পর, আর have আছে বলে said বসল (should have said) । লক্ষ্য রাখবে, should-এর আগে I, he, you যা-ই থাকুক না কেন, should-এর পরে সবসময়ই have বসে, has কখনোই বসে না । এখন passive voice-এ have said-টা হয়ে গেল have been said - এটা have-এর নিয়ম মানল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson3 (2)",
                        "text1": "The killer may have killed many innocent people by now.",
                        "text2": "Many innocent people may have been killed by the killer by now. <br> <br>May ব্যবহার হয়, যখন কেউ কোন কাজ করতেও পারে, না-ও পারে - 'হয়ত করে' এমন সম্ভাবনা অর্থে । এই may have ব্যবহার হয় যখন ঘটনা নিকট-অতীতে ঘটে গেছে, কিন্তু তার রেশ রয়ে গেছে । যেমন এখানে বলা হচ্ছে, খুনীটি এতদিনে হয়ত অনেক নিরীহ মানুষকে খুন করেছে - এই 'হয়ত করেছে' অর্থে may have, আর 'হয়ত করেছিল' অর্থে might have ব্যবহার হয় । ঠিক আগের উদাহরণের মত এই বাক্যের passive voice করতে may যেমন আছে, তেমনি রাখবে, আর have-এর নিয়মে have killed হয়ে যাবে have been killed ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson3 (3)",
                        "text1": "The referee will have finished the match by then.",
                        "text2": "The match will have been finished by the referee by then. <br> <br>May have finished by now আর will have finished by then-এর তফাৎ হল এই যে, প্রথমটায় সম্ভাবনা বোঝায়, আর পরেরটায় নিশ্চিত কাজ বোঝায় । 'এতক্ষণে বোধহয় শেষ হয়ে গেছে' আর 'ততক্ষণে শেষ হয়ে যাবে' (কিন্তু রেশ থাকবে) - এই তফাৎ । রেশ না থাকলে will finish হত - 'শেষ হবে' । May have-এর মতই will have-এও have-এর নিয়ম মেনে have finished হয়ে গেল have been finished - পরিবর্তন হল না will-এর ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson3 (4)",
                        "text1": "Lalita loves to play table tennis.",
                        "text2": "Table tennis is loved to be played by Lalita. <br> <br>লক্ষ্য কর, এখানে দুটো verb আছে - love আর play । অতএব passive voice-এ দুটোরই পরিবর্তন করতে হবে । প্রথমে মূল verb-টা ধরবে, যেটা subject-এর (Lalita) পরপরই বসেছে - love । সেটা আগের নিয়ম অনুযায়ী love থেকে হয়ে যাবে is loved । পরেরটা হল play, যেটাকে করতে হবে to be played, কারণ to be played by Lalita বললে তবেই ললিতার দ্বারা খেলা হচ্ছে, এটা পরিষ্কার হয় । Table tennis is loved to play by Lalita ভুল । আর ভুল - Table tennis is played to be loved by Lalita বা Table tennis is played to love by Lalita । কিন্তু ঠিক - Playing table tennis is loved by Lalita । এটা আরো সুন্দর ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson3 (5)",
                        "text1": "I am planning to buy a new house.",
                        "text2": "A new house is being planned to be bought by me. <br> <br>এখানেও দুটো verb - plan আর buy । তাই দুটোকেই পরিবর্তন করতে হবে । লক্ষ্য কর, active voice-এ present continuous tense আছে বলে (planning) সেটা আগের বলা নিয়ম অনুযায়ী হল passive-এ হল is being planned, কারণ মূল verb হল plan (subject-এর পরেই আছে বলে) । এবার আগের উদাহরণটার মতই buy হয়ে গেল to be bought । ভুল - A new house is being bought to be planned by me আর A new house is being planned to buy by me । কিন্তু ঠিক - Buying a new house is being planned by me, যার অর্থ - নতুন বাড়ি কেনা আমার দ্বারা পরিকল্পিত হচ্ছে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson3 (6)",
                        "text1": "Shyam has learnt to cook fish.",
                        "text2": "Cooking fish has been learnt by Shyam. <br> <br>To cook fish যেমন infinitive-এর ব্যবহার, তেমনি cooking fish হল gerund-এর ব্যবহার । দুটোর অর্থই এক হলেও gerund ব্যবহার করে passive voice-কে এক্ষেত্রে সরল করে নেওয়া হল - মাছ রান্না করা শ্যামের দ্বারা শেখা হয়েছে । মাছ রান্না করা - cooking fish । নইলে জটিলভাবে করতে হত (আগের উদাহরণের মত) - Fish has been learnt to be cooked by Shyam । আগে বলা নিয়ম অনুযায়ী, has learnt হয়ে গেল has been learnt ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson3 (7)",
                        "text1": "You need to sing a song.",
                        "text2": "A song is needed to be sung by you. <br> <br>এখানেও দুটো verb - need আর sing । লক্ষ্য কর, need আছে subject-এর পর, তাই সেটাই মূল verb । অতএব passive voice-এ need হয়ে গেল is needed, আর পরের verb-টা (sing) হয়ে গেল to be sung । আগের উদাহরণের মত করে Singing a song by you is needed লেখা যায়, তবে A song is needed to be sung by you শুনতে বেশী ভাল লাগছে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson3 (8)",
                        "text1": "You have to play the game to win it.",
                        "text2": "The game has to be played to be won by you. <br> <br>মনে করে দ্যাখো, has (বা have) to play-র অর্থ হল 'খেলতেই হবে' (must-এর বিকল্প) । এবারে খেয়াল কর, has/have to play-টা passive voice-এ হয়ে যায় has/have to be played, কারণ to play তো to be played-ই হবে । তেমনি to win হয়ে গেল to be won । সাধারণ সব verb-এর past participle না জানলে passive voice করতে অসুবিধে হবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson3 (9)",
                        "text1": "My book has been stolen.",
                        "text2": "Somebody has stolen my book. <br> <br>My book has been stolen আছে passive voice-এ, কিন্তু এখানে কোন object নেই, যদিও অনির্দিষ্ট একটা object-এর ভাব আছে, কারণ কেউ তো চুরি (steal) করেছে । এর active voice করতে হলে সেই অনির্দিষ্ট object-কে নির্দিষ্ট subject করতেই হবে, কারণ object না থাকলেও বাক্য হয়, কিন্তু subject না থাকলে কখনোই হয় না । তাই somebody জোর করে ঢোকাতেই হল । যদি Somebody has stolen my book-কে passive voice করতে হত, My book has been stolen লিখলেই চলবে, by somebody না দিলেও চলে । steal-stole-stolen ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson3 (10)",
                        "text1": "Idrish was invited to the party.",
                        "text2": "Someone invited Idrish to the party. <br> <br>আগের উদাহরণের মতই passive voice-এ কোন object নেই, কিন্তু অনির্দিষ্ট একটা object-এর ভাব আছে, কারণ নিমন্ত্রণ (invite) না করলে Idrish কি আর invited হতে পারে ! সেইজন্য passive voice-এ someone (বা somebody) object হিসেবে এল । আরো লক্ষ্য কর, party কিন্তু কোন object নয় , যার ওপর Idrish বা someone কাজ করছে (invite), কারণ party-তে আছে এখানে (to the party) । আগেও বলা হয়েছে, যখন বাক্যে কোন preposition দিয়ে noun-কে জোড়া হবে, সেটা আর subject (বা object) হিসেবে ব্যবহার হবে না কোন voice-এই । আর তার কোন পরিবর্তন করতেও যাবে না - দুটো voice-এই to the party একই থাকবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC1-Lesson3 (11)",
                        "text1": "I was asked my name.",
                        "text2": "They asked me my name. <br> <br>I was asked my name বাক্যটা আছে passive voice-এ, আর by দিয়ে কোন object নেই । তাই active voice-এ They ঢোকানো হল । যদি They asked me my name-কে passive voice করতে হত, তবে অবশ্য I was asked my name by them লিখতেই হত, by them উহ্য রাখা যেত না ।"
                      }
]