[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (1)",
                        "text1": "Savitri may keep me waiting.",
                        "text2": "I may be kept waiting by Savitri. <br> <br>ঠিক আগের উদাহরণের মত । waiting-টা kept-এর পাশেই লিখবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (2)",
                        "text1": "It looks nice that they had painted the house blue.",
                        "text2": "It looks nice that the house had been painted blue by them. <br> <br>It looks nice-কে passive voice করা যাবে না । পরের বাক্যাংশের had হল had been, আর blue লেখা হল painted-এর পরপরই, আগের দুটো উদাহরণের মতই ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (3)",
                        "text1": "Bring it home.",
                        "text2": "Let it be brought home. <br> <br>Bring it home হল imperative sentence, যাতে কোন আদেশ, নির্দেশ বা অনুরোধ বোঝানো হয় । এই বাক্যগুলিরও passive voice হয় । যদি আদেশ হয় (এখানে যেমন), তবে let দিয়ে শুরু করবে, আর bring (verb) হয়ে যাবে be brought  (past participle) । তখন অর্থ দাঁড়াবে - এটা বাড়িতে আনা হোক । let দিয়ে এই 'হোক'-টা বোঝানো হয় । ভুল - let be brought it home বা let it be brought to home ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (4)",
                        "text1": "Do it at once.",
                        "text2": "Let it be done at once. <br> <br>আগের উদাহরণের মতই 'এটা এখনই করা হোক' - এরকম সাজিয়ে নিতে হবে । অতএব let দিয়ে শুরু করা হল আর তাই do it হয়ে গেল let it be done ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (5)",
                        "text1": "Do not insult the weak.",
                        "text2": "Let not the weak be insulted. <br> <br>এটা নির্দেশ - এই ক্ষেত্রেও let দিয়ে শুরু হয় । তবে লক্ষ্য কর, এখানে negative imperative আছে (do not insult) । এক্ষেত্রে let-এর জায়গায় let not দিয়ে শুরু হবে । বাকিটা একই - insult হয়ে গেল be insulted । এরকম লিখলেও ঠিক হত - Let the weak not be insulted  বা Let the weak be not insulted । তবে ভুল - Let not be insulted the weak ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (6",
                        "text1": "Do not beat the dog.",
                        "text2": "Let the dog not be beaten. <br> <br>আগের উদাহরণের মতই । এটিও নির্দেশ (বা আদেশ) । তাই let দিয়ে শুরু হল । মনে রাখবে, beat-beat-beaten হয় । অতএব হল, Let the dog not be beaten । তবে Let not the dog be beaten লিখলেও ঠিক হত ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (7)",
                        "text1": "Let me do it.",
                        "text2": "Let it be done by me. <br> <br>লক্ষ্য কর, এখানে Let দিয়েই শুরু করা আছে । অর্থ - আমায় এটা করতে দাও । তাই passive voice-এর জন্য সাজিয়ে নাও - এটা আমার দ্বারা করা হোক । তাই হল Let it be done by me । এখানে passive voice করার উদ্দেশ্য হল me-এর বদলে it-কে গুরুত্ব দেওয়া । ভুল - Let me be done it বা Let by me be done it ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (8)",
                        "text1": "Let Gopal marry Dipanwita.",
                        "text2": "Let Dipanwita be married by Gopal. <br> <br>আগের উদাহরণের মত - শুধু me-এর জায়গায় Gopal আর it-এর জায়গায় Dipanwita আছে । Passive voice-এ Dipanwita-কে গুরুত্ব দিয়ে subject করা হল । তাই হল Let Dipanwita be married by Gopal । খুব ভুল নয় - Let Gopal be married by Dipanwita ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (9)",
                        "text1": "Get out.",
                        "text2": "You are ordered to get out. <br> <br>এটা imperative, এটা আদেশ । কিন্তু এখানে কোন object নেই । তা সত্ত্বেও এর passive voice করা যেতে পারে । আদেশ আছে বলে order ব্যবহার করতে হবে । You are ordered হল, কারণ Get out 'তোমাকে' বলা হচ্ছে । পুরোটা দাঁড়াল এরকম - You are ordered to get out । নির্দেশ থাকলে ask বা tell ব্যবহার করবে, আর অনুরোধ থাকলে request । এগুলো আগেও কয়েকবার বলা হয়েছে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (10)",
                        "text1": "Work hard.",
                        "text2": "You are advised to work hard. <br> <br>এটা imperative, এটা নির্দেশ । এটারও কোন object নেই, তাই you-কে active voice-এর object ধরে passive voice-এ সেটাকে subject করা হল । নির্দেশ বলে asked বা told লেখা যেত, কিন্তু You are advised আরো সুন্দর ব্যবহার ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (11)",
                        "text1": "Please give me some money.",
                        "text2": "You are requested to give me some money. <br> <br>এটা অনুরোধ । তাই you are requested হল । You are requested to be given কখনো লিখবে না । Let some money be given to me যদি লিখতে, তবে অনুরোধের ভাবটা আসত না (please) । তাই request কথাটা আনতেই হবে । এটা একটু বুঝেশুনে করতে হবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (12)",
                        "text1": "Kindly do this work.",
                        "text2": "You are requested to do this work. <br> <br>Kindly আর please একই কথা, অতএব এটিও অনুরোধ । তাই you are requested হল । আগের মতই Let this work be done by you লিখলে অনুরোধের ভাব আসত না । আর Let this work be done by you kindly লিখলে ভাব আসত বটে, কিন্তু request ব্যবহারই যুক্তিযুক্ত । জানবে, সবসময়ই let বা you are দুটোর যে কোন একটা দিয়ে শুরু করলে খুব ভুল কিছু হয় না, শুধু একটু খেয়াল রেখে করতে হবে ।"
                      }
]