[
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson1 (1)",
                        "text1": "যত্নসহকারে শোন এবং নোট নাও",
                        "text2": "Listen carefully and take notes. <br> <br>And দিয়ে ২টো বাক্যকে জোড়া হয়েছে - Listen carefully আর take notes । Carefully listen ভাল ইংরিজি নয়, কারণ শোনাকে ভাব প্রদান করে \"যত্নসহকারে\", তাই পরে বসল । listen carefully to take notes কিন্তু এক্ষেত্রে ভুল -  নোট নিতে যত্নসহকারে শুনতে বলা হছে না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson1 (2)",
                        "text1": "সে গীটার বাজিয়ে পাগলের মত নাচে",
                        "text2": "He plays guitar and dances wildly. <br> <br>সাজিয়ে নাও, সে গীটার বাজায় ও পাগলের মত নাচে । এরকম করলে ভুল হবে না, যদিও এখানে He dances wildly playing guitar লিখলেও ঠিক হত । এখানে madly-এর চেয়ে wildly বেশী সুপ্রযুক্ত, কারণ \"পাগল\" বলতে \"উদ্দাম\" বোঝাচ্ছে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson1 (3)",
                        "text1": "সে প্রচুর মদ খেয়ে গীটার বাজিয়ে উদ্দাম নাচে",
                        "text2": "He drinks heavily, plays guitar and dances wildly. <br> <br>সাজিয়ে নাও - সে প্রচুর মদ খায়, গীটার বাজায় এবং উদ্দাম নাচে । তিনটি বাক্য থাকলেও ২বার and ব্যবহার হয় না, comma (,) দিয়ে প্রথম ২টি বাক্যকে আলাদা করা হয়, আর ৩য়টির আগে and বসে । প্রচুর মদ খাওয়া - drink heavily । drinks a lot-ও লেখা যেত ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson1 (4)",
                        "text1": "সে প্রচুর মদ খায়, উদ্দাম নাচে কিন্তু কখনো ভারসাম্য হারায় না",
                        "text2": "He drinks heavily, dances wildly but never loses balance. <br> <br>আগের মতই সাজিয়ে নাও । ৩য় বাক্যটি but দিয়ে জোড়া হয়েছে । লক্ষ্য কর, He drinks heavily, he dances wildly but he never loses balance লেখার দরকার নেই, কারণ তিনটে বাক্যেই subject হল he । তাই he  একবার লিখলেই চলে । ভারসাম্য - balance । হারানো - lose ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson1 (5)",
                        "text1": "দাবা বুদ্ধির খেলা এবং আনন্দ তাতে সেরা",
                        "text2": "Chess is a game of intelligence and Anand is the best in it. <br> <br>আবার and দিয়ে ২টো বাক্য জোড়া হল । intelligent game লিখলে ঠিক হত না, game of intelligence লিখতে হবে । শুধু best ভুল, the best লিখতে হবে, আগেই জেনেছ । তাতে - in it, কারণ \"তাতে\" মানে \"তার ভেতরে\" । best at it লিখলে অবশ্য আরো ভাল হত ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson1 (6)",
                        "text1": "দাবা একটি বুদ্ধির খেলা, আনন্দ তাতে সেরা কারণ তিনি তিনবারের বিজয়ী",
                        "text2": "Chess is a game of intelligence and Anand is the best at it because he has been champion for three times. <br> <br>লক্ষ্য কর, এখানে ৩টি বাক্য আছে, কিন্তু ২য়টির আগেই and বসল, কারণ ওই বাক্যের আগে \"এবং\" উহ্য আছে ও পরে আর and দিয়ে জুড়তে হচ্ছে না (\"কারণ\" বা because দিয়ে জুড়তে হল) । তিনবারের জন্য champion, তাই for three times হল । আরও দুটো ব্যাপার লক্ষ্য কর - এক, ৩য় বাক্যে he দিতেই হল, কারণ and দিয়ে ২য় আর ৩য় বাক্য জোড়া নেই, because দিয়ে আছে । আর দুই, has been-এর ব্যবহার ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson1 (7)",
                        "text1": "আনন্দ তিনবারের চ্যাম্পিয়ন কিন্তু কাসপরভ সর্ব্বকালের সেরা",
                        "text2": "Anand has been champion for three times but Kasparov is the greatest ever. <br> <br>But দিয়ে জোড়া হয়েছে এখানে । সর্ব্বকালের সেরা - greatest ever । ever greatest ঠিক নয় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson1 (8)",
                        "text1": "তিনি তার বিষয়টি ভালই জানেন কিন্তু পড়াতে পারেন না",
                        "text2": "He knows his subject well but can not teach. <br> <br>এখানে দুটি শব্দকে But দিয়ে জোড়া হল । এখানে He দুবার ব্যবহার হল না কারণ দুটি বাক্যেই একই subject - he ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson1 (9)",
                        "text1": "যদি পরিশ্রম কর তবে ভাল ফল পাবে",
                        "text2": "If you work hard, you will get good result. <br> <br>যদিও ২টো বাক্য আছে এবং প্রথমটা পরেরটার কারণ, ২য়টির আগে then দেওয়ার প্রয়োজন নেই, যদিও বাংলায় \"তবে\" আছে । আবার, যদিও বাংলায় ২য় বাক্যে \"তুমি\" উহ্য, ইংরিজিতে you ২য় বাক্যেও দিতে হল । and আর but দিয়ে জুড়লে you দ্বিতীয়বার না লিখলেও চলে । comma-র (,) ব্যবহার লক্ষ্য কর । আর hard হল, hardly হল না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson1 (10)",
                        "text1": "হাসলে বিপদ আছে",
                        "text2": "If you laugh, you will be in danger. <br> <br>এভাবে সাজাও - যদি হাসো, তবে বিপদগ্রস্ত হবে (\"তুমি\" উহ্য) । আগে \"হাসা\", পরে \"বিপদে\" পড়া, তাই you laugh প্রথমে এল । আবার, then দিতে হল না । বিপদে - in danger, কারণ \"বিপদের ভেতরে\" । you will fall in danger (বিপদে পড়বে) লিখলেও ভুল হত না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson1 (11)",
                        "text1": "মাসীর গোঁফ গজালে মাসী কি মেসো হয়ে যাবে ?",
                        "text2": "Will aunt become uncle if she grows moustache ? <br> <br>আগে উত্তরটা ভেবে নাও, কারণ প্রশ্ন আছে । এভাবে সাজাও - যদি মাসীর গোঁফ গজায়, তবে মাসী মেসো হয়ে যাবে । এবার প্রশ্নটা ভাবো । ২য় বাক্যে প্রশ্ন আছে (মাসী কি মেসো হয়ে যাবে ?) । তাই সেটা প্রথমে চলে আসবে ইংরিজিতে - Will aunt become uncle । লক্ষ্য কর - গোঁফ গজানো - grow moustache ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "Bco1-Lesson1 (12)",
                        "text1": "হাসির কথা বললে হাসব না ? ",
                        "text2": "Shall I not laugh if you say funny things ? <br> <br>আগের মতই । উত্তর - যদি তুমি হাসির কথা বল, (আমি) হাসব  না । সেটা হল, If you say funny things, I shall not laugh । প্রশ্ন - আমি কি হাসব না, যদি (তুমি) হাসির কথা বল ? এটা হল, কারণ প্রশ্নের বাক্যটিকে সামনে আনতে হবে । তাই হল, Shall I not laugh if you say funny things ? হাসির কথা - funny things ।"
                      }
]