[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson2 (1)",
                        "text1": "আমরা সবাই জানি যে পাপ আর দুঃখ একসঙ্গে যায়",
                        "text2": "We all know that sin and sorrow go together. <br> <br>এখানে চালক বাক্য \"আমরা সবাই জানি\" । know এর পরে that বসল, কারণ কি জানি, না \"পাপ আর দুঃখ একসঙ্গে যায়\" । একসঙ্গে যায় - go together । we all না লিখে all of us-ও লেখা যায় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson2 (2)",
                        "text1": "তুমি কি জানো না যে আমি তোমায় ভালোবাসি ?",
                        "text2": "Do not you know that I love you ? <br> <br>এখানে চালক বাক্য \"তুমি জানো না\" । অতএব উত্তর হল you do not know that I love you । সুতরাং প্রশ্নটি হবে Do not you know that I love you ? ভুল - I love you, do you not know ? ঠিক - Do you not know that I love you ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson2 (3)",
                        "text1": "যে লোকটিকে সে ভালোবাসত সে এখন মৃত",
                        "text2": "The man that she loved is dead now. <br> <br>এখানে that মাঝে ব্যবহার হল । সাজিয়ে নাও, সে লোকটি যাকে সে ভালোবাসত, সে এখন মৃত । That-টা man-এর সঙ্গে বসবে, কারণ \"যে লোকটি\" আছে । She loved the man, who is dead now - এটাতে ভাব ঠিক আসছে না । এখানে that-এর জায়গায় whom ব্যবহার করা যায় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson2 (4)",
                        "text1": "বাঘ এতটাই শক্তিশালী যে সে একসঙ্গে অনেকগুলি জন্তু মারতে পারে",
                        "text2": "Tiger is so strong that it can kill many animals at a time. <br> <br>\"এতটাই যে\" অর্থে so that ব্যবহার হয় । এতটাই শক্তিশালী যে - so strong that । একসঙ্গে - at a time । এরকম লিখবে না - Tiger is strong so that it can kill many animals at a time, এতে \"এতটাই শক্তিশালী\" এই ভাব আসছে না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson2 (5)",
                        "text1": "আমরা বীজ পুঁতি যাতে ফসল তুলতে পারি",
                        "text2": "We sow so that we may reap. <br> <br>এটি so that-এর আরেকটি ব্যবহার । লক্ষ্য কর, আগেরটার মত এটাতেও প্রথম বাক্যের ফলশ্রুতি হিসাবে দ্বিতীয় বাক্যটি আসছে (বীজ পোঁতা এবং ফসল তোলা, বা শক্তিশালী ও জন্তু মারা) । এই সব ক্ষেত্রেই so that ব্যবহার হয়, দ্বিতীয় বাক্যটিকে জুড়তে । এখানে may ব্যবহার হল, কারণ ফসল নাও উঠতে পারে । এখানে বীজ (seed) কথাটা উহ্য আছে, কারণ sow-এর অর্থই হল বীজ পোঁতা । reap - ফসল তোলা ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson2 (6)",
                        "text1": "নাফসিনা এতটাই ক্লান্ত ছিল যে সে খানিকটা বিশ্রাম নিল",
                        "text2": "Nafsina was so tired that she rested for some time. <br> <br>\"এতটাই যে\" অর্থে so that ব্যবহার হল । Nafsina was tired so that she rested for some time - হবে না, কারণ \"এতটাই ক্লান্ত\" আছে বলে tired-এর আগেই so ব্যবহার করতে হবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson2 (7)",
                        "text1": "সে যে একটা ভালো ছেলে আমার জানা আছে",
                        "text2": "That he is a good boy, is known to me. <br> <br>এটিও একটি বিশেষ ব্যবহার । that সংযোগকারী হলেও that দিয়ে এখানে শুরু হচ্ছে । পরের বাক্যে যদি passive voice (is known to me) ব্যবহার করা হয় তাহলে এইভাবে that দিয়েই শুরু করতে হবে । যেন that he is a good boy-ই is known to me-র subject । I know that he is a good boy - এরকমও লেখা যায়, কিন্তু সামান্য হলেও ভাবের তফাৎ আছে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson2 (8)",
                        "text1": "মোনালিসা যে একটা শিল্পকর্ম, তা ছাত্রদের জানা ছিল না",
                        "text2": "That Monalisa is a work of art, was not known to the students. <br> <br>যদি চালক বাক্য \"ছাত্রদের জানা ছিল না\" ধরি, তবে হত The student did not know that Monalisa is a work of art । এটাও ঠিক হত । কিন্তু যেহেতু দ্বিতীয় বাক্যটিতে passive voice (was not known) ব্যবহার করা হয়েছে, তাই এক্ষেত্রে that দিয়েই শুরু করতে হবে । that Monalisa is a work of art-ই এখানে পরের বাক্যের subject । known to-এর ব্যবহার লক্ষ্য কর  ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson2 (9)",
                        "text1": "আমি জানি না সে অফিসে আসছে কিনা",
                        "text2": "I do not know whether he is coming to office or not. <br> <br>\"আসছে কি আসছে না\" এরকম দ্বিধা থাকলে whether or not ব্যবহার হয় । এখানে চালক বাক্য \"I do not know\" । কি জানি না, না সে অফিসে আসছে কি আসছে না - whether he is coming to office or not । এখানে whether-এর জায়গায় if-ও ব্যবহার করা যায়, তখন or not দেওয়ার প্রয়োজন নেই ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson2 (10)",
                        "text1": "বৃষ্টি হোক বা না হোক, আমি তোমার ওখানে যাব",
                        "text2": "Whether or not it rains, I shall be at your place. <br> <br>আগের মতই, I shall be at your place, whether or not it rains লেখা যেত, আবার whether it rains or not, I shall be at your place-এটাও লেখা যেত । লক্ষ্য কর, at your place হল, in your place হল না । go to your place-ও ঠিক । If it rains or does not rain - খারাপ ইংরিজি ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson2 (11)",
                        "text1": "বাবুর জানা নেই সোমেন মিথ্যুক কি মিথ্যুক নয়",
                        "text2": "Whether Somen is a liar or not, is not known to Babu. <br> <br>এক্ষেত্রেও দ্বিধা (\"এটা বা ওটা\"), তাই whether হল । এটা সেই আগের that-এর বিশেষ ব্যবহারের মতই, শুধু that-এর জায়গায় whether-or not আছে । এখানেও whether দিয়ে শুরু করতেই হবে, কারণ পরে passive voice (is known to) আছে । অথবা এরকম লেখা যায়, Babu does not know whether Somen is a liar or not ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson2 (12)",
                        "text1": "ভারত নিশ্চিত নয় পাকিস্তানের কাছে পরমাণু অস্ত্র আছে কিনা",
                        "text2": "India is not sure whether Pakistan has nuclear weapon or not. <br> <br>ভারতের দ্বিধা আছে (\"আছে কি নেই\") বলে whether ব্যবহার হল । India is not sure, কি নিশ্চিত নয়, না  whether Pakistan has nuclear weapon or not ।"
                      }
]

