[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson1 (1)",
                        "text1": "হয় ব্রাজিল অথবা আর্জেন্টিনা বিশ্বকাপ জিতবে",
                        "text2": "Either Brazil or Argentina will win the world cup. <br> <br>Either ব্যবহার হয়, যখন \"হয়-নয় বা এটা অথবা ওটা\" এরকম বোঝায় । এখানে either কথাটা দিতে হবে, যদি শুরুতে \"হয়\" কথাটা না থাকত, তখন Brazil or Argentina লেখা যেত, either না দিলেও চলত ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson1 (2)",
                        "text1": "হয় তুমি জিতবে অথবা আমি জিতব",
                        "text2": "Either you will win or I shall win. <br> <br>যে দুটি বাক্যকে জোড়া হচ্ছে, সেই দুটি বাক্য যদি একই জিনিসের দুটি সম্ভাবনাকে সূচিত করে (যেমন, I shall win ও you will win) তখন either এবং or দুটোই ব্যবহার করতেই হবে । শুধু or ব্যবহার করলে ঠিক হবে না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson1 (3)",
                        "text1": "হয় সে ডুবেছে নয়তো কোন জাহাজ তাকে বাঁচিয়েছে",
                        "text2": "Either he is drowned or some ship has saved him. <br> <br>এখানেও either ও or দুটিই ব্যবহার হল দুটি বাক্যকে জুড়তে (শুধু or নয়), কারণ সে হয় ডুবেছে, নয় বেঁচেছে - একই জিনিসের দুটি সম্ভাবনা । যেহেতু কেউ ইচ্ছে করে ডোবে না, তাই \"is drowned\" (passive voice) হল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson1 (4)",
                        "text1": "তাকে কাঁদতেই হবে নয়তো সে মারা যাবে",
                        "text2": "She must cry or she will die. <br> <br>এখানে either ও or দুটোর ব্যবহার একসঙ্গে হল না, কারণ এখানে একই জিনিসের দুটি সম্ভাবনা বোঝাচ্ছে না (যেমন, must cry ও will die) । এক্ষেত্রে শুধু or হবে, যেটা \"নয়তো\" অর্থে ব্যবহার হয় । Or-এর জায়গায় else-ও লেখা যেত ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson1 (5)",
                        "text1": "হয় তুমি হারবে, নয় আমি মরব",
                        "text2": "You will lose or I will die. <br> <br>আগের মতই এখানেও either ব্যবহার হল না । কারণ lose এবং die একই জিনিসের দুটি সম্ভাবনা নয় । I will-ব্যবহার এখানে ঠিক, কারণ জোর দিয়ে বলা হচ্ছে । তাই এক্ষেত্রে I shall এর জায়গায় I will লেখা যায় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson1 (6)",
                        "text1": "স্পেন বা ইংল্যান্ড কেউই বিশ্বকাপ জিতবে না",
                        "text2": "Neither Spain nor England will win the world cup. <br> <br>\"দুজনের কেউই না\" অর্থে neither-nor ব্যবহার হয় । সাজিয়ে নাও - না স্পেন না ইংল্যান্ড বিশ্বকাপ জিতবে । Neither Spain nor England will not win the World Cup - ভুল ইংরিজি, কারণ দুবার \"না\" ব্যবহার হয় না, neither-nor এর ভিতরেই \"না\" কথাটা আছে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson1 (7)",
                        "text1": "সে তার স্ত্রী বা তার কাজ কোনটাকেই ভালোবাসেনি",
                        "text2": "He loved neither his wife nor his job. <br> <br>\"কোনটাকেই না\" অর্থে neither-nor ব্যবহার হল । He did not love either his wife or his job-ও লেখা ঠিক হত । এখানে neither-nor দুটোই ব্যবহার করো, neither বাদ দিও না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson1 (8)",
                        "text1": "সে তার স্ত্রীকে ভালোবাসেনি, আবার তার কাজকেও ভালোবাসেনি",
                        "text2": "Neither he loved his wife nor he loved his job. <br> <br>লক্ষ্য কর, আগেরটার সঙ্গে এটার ভাব একই হলেও, এই বাক্যটাকে একটু ঘোরানো আছে । এক্ষেত্রেও একই জিনিসের দুটি সম্ভাবনা (যেমন, স্ত্রীকে ভালোবাসা এবং কাজকে ভালোবাসা) বোঝাচ্ছে বলে, neither এবং nor দুটিই ব্যবহার হল । Neither he did not love his wife nor he did not love his job ভুল, আগের মতই ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson1 (9)",
                        "text1": "সে সেখানে যায়নি, আবার আমাকে জানায়ও নি",
                        "text2": "She did not go there, nor did she inform me. <br> <br>এটি একটি বিশেষ ব্যবহার । এখানে দুটি জিনিস লক্ষ্য কর । এক, একই জিনিসের দুটি সম্ভাবনা নয় (যাওয়া আর জানানো), তাই neither ব্যবহার হল না । দুই, nor she informed me হল না, nor did she inform me হল, যদিও প্রশ্ন কিছু নেই । 'আবার' (again অর্থে নয়) দিয়ে বাক্যদের জুড়লে শুধু nor ও এই বিশেষ ব্যবহার  হয় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson1 (10)",
                        "text1": "আমরা মনে করি সে নিরাপদে আছে, আবার আমরা কোন খারাপ খবরও পাইনি",
                        "text2": "We think that he is safe, nor have we received any bad news. <br> <br>এখানে তিনটি বাক্য আছে, that ও nor দিয়ে তারা যুক্ত আছে । এক্ষেত্রেও \"নিরাপদে থাকা\" এবং \"খারাপ খবর পাওয়া\" এক জিনিসের দুটি সম্ভাবনা নয়, তাই neither ব্যবহার হল না । শুধু nor আছে বলে we have received না হয়ে, have we received হল, প্রশ্ন না থাকা সত্ত্বেও । আগের মতই এটা একটি বিশেষ ব্যবহার, \"আবার\" দিয়ে যখন দুটো বাক্য জোড়া ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson1 (11)",
                        "text1": "এই সেই বাড়ী যেটা নরেনবাবু তৈরী করেছেন",
                        "text2": "This is the house that Narenbabu built. <br> <br>এখানে that দিয়ে দুটি বাক্যকে জোড়া হচ্ছে । দুটি বাক্যের মধ্যেই 'বাড়ী' কথাটা আছে । ১ম টায়  প্রত্যক্ষ ভাবে এবং ২য় টায় পরোক্ষ ভাবে, তাই house এর পরে পরেই that সংযোগকারী হিসাবে ব্যবহার হল । that এর জায়গায় which-ও লেখা যেত । Narenbabu built this house লিখলে ভাব ঠিক আসত না, কারণ সেক্ষেত্রে বাড়ির ওপর জোর হল না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson1 (12)",
                        "text1": "আমি বলেছিলাম যে ভারত জিতবে",
                        "text2": "I said that India would win. <br> <br>এখানে \"যে\" অর্থে that ব্যবহার হল (এক্ষেত্রে which প্রয়োগ ভুল হবে) । এখানে \"আমি বলেছিলাম\" এটিই চালক বাক্য, অতএব সেটা আগে এল । India would win that I said - ভুল ইংরিজি । এখানে will এর জায়গায় would হল, কারণ অতীতে  বলেছিলাম । India will win বললে ভুল হত ।"
                      }
]