[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson3 (1)",
                        "text1": "a+b =c, সুতরাং উপপাদ্য প্রমাণ হল",
                        "text2": "a+b = c, therefore the theorem is proved. <br> <br>So, therefore, hence একই অর্থ বহন করে । কিন্তু যেখানে খুব কঠিন যুক্তি প্রয়োগ হয় (এটা হল বলে নিশ্চিত করে ওটা হল), সেখানে so না ব্যবহার করে therefore বা hence ব্যবহার করা হয় । উপপাদ্য যেহেতু নিজে থেকে প্রমাণ হতে পারে না, তাই theorem is proved (passive voice) হল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson3 (2)",
                        "text1": "সে বোবা, সুতরাং সে মিথ্যাকথা বলতে পারে না",
                        "text2": "He is dumb, therefore he can not lie. <br> <br>এখানেও কঠিন যুক্তি । বোবা হলে সে কথাই বলতে পারবে না, তো মিথ্যেকথা । সেইজন্য এখানে therefore হল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson3 (3)",
                        "text1": "আমরা স্টেশনে পৌঁছনোর আগেই ট্রেনটি ছেড়ে গিয়েছিল",
                        "text2": "The train had left, before we reached the station. <br> <br>লক্ষ্য কর, before এখানে preposition হিসাবে ব্যবহার হচ্ছে না । দুটি বাক্যের সংযোগকারী হিসাবে ব্যবহার হচ্ছে । Before সেই বাক্যের আগেই ব্যবহার হল যেটা আগে ঘটেছে । Had left না বলে left বললেও একই অর্থ হত,  যদিও had left বেশী সুপ্রযুক্ত কারণ স্টেশনে পৌঁছনোর ঘটনায় ট্রেন ছেড়ে যাওয়ার রেশ আছে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson3 (4)",
                        "text1": "গোলরক্ষক নড়ার আগেই মেসি  গোলটা করেছিল",
                        "text2": "Before the goalkeeper could move, Messi scored the goal. <br> <br>উল্টো করেও লেখা যেত - Messi scored the goal, before the goalkeeper could move । এক্ষেত্রেও 'before' preposition হিসেবে নয়, দুটি বাক্যের সংযোগকারী হিসেবে ব্যবহার হল । গোল করা - score the goal । do the goal হবে না । দুটি বাক্যের মধ্যে যেটা আগে ঘটেছে, তার আগেই before ব্যবহার হয়েছে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson3 (5)",
                        "text1": "সে যাবার পর আমি বাড়ী ফিরেছিলাম",
                        "text2": "I returned home after he had gone. <br> <br>এখানে before-এর মতই after সংযোগকারী হিসাবে ব্যবহার হচ্ছে । এইভাবে সাজাও, আমি বাড়ী ফিরেছিলাম after সে চলে গিয়েছিল । Had gone হল, কারণ তার যাবার রেশ রেখেই আমি বাড়ী ফিরেছিলাম । Returned to home হয় না, returned home হবে । যদিও অন্য সব ক্ষেত্রে returned to হয়, যেমন returned to office, returned to Susmita ইত্যাদি ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson3 (6)",
                        "text1": "তার বাবা মারা যাবার পর সে ধনী হয়েছিল",
                        "text2": "After his father died, he became rich. <br> <br>দুটো বাক্যের যে কোনটাই আগে আসতে পারে, কিন্তু after বসবে যে ঘটনাটি আগে ঘটেছে তার আগে । become rich এর ব্যবহার লক্ষ্য কর । Then he became rich লিখবে না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson3 (7)",
                        "text1": "যতক্ষণ না আমি ফিরি, দয়া করে অপেক্ষা করুন",
                        "text2": "Please wait until I return. <br> <br>Until - যতক্ষণ না (অবধি) । please কথাটা থাকলে, বাক্যটি please দিয়ে শুরু করতে হবে । Until I return please wait লেখা ঠিক নয় । মনে রাখবে, ব্যবহারগত দিক দিয়ে till এবং until এর কোন তফাৎ নেই । till-এর জায়গায় until  এবং until-এর জায়গায় till লেখা যায় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson3 (8)",
                        "text1": "৭০ বছর বয়সে পৌঁছনো অবধি তিনি অবিবাহিত ছিলেন",
                        "text2": "He was unmarried till he reached 70 years. <br> <br>এইভাবে সাজাও, তিনি অবিবাহিত ছিলেন till তিনি ৭০ বছর বয়সে পৌঁছেছিলেন । অবধি অর্থে till বা until ব্যবহার হয় । সুতরাং এখানে before বা after (আগে বা পরে) ব্যবহার হবে না । Till-এর জায়গায় until-ও লেখা যেত । He was unmarried লেখা হল passive voice হিসেবে নয়, unmarried এখানে he-এর adjective ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson3 (9)",
                        "text1": "ট্রেনে যাবার সময়ে একজন মহান ব্যক্তির সঙ্গে আমার দেখা হয়েছিল",
                        "text2": "While travelling by train, I met a great man. <br> <br>সময়ের ব্যপ্তি বোঝাতে while কথাটা ব্যবহার হয় । ট্রেনে যাবার সময়টা বেশ খানিকটা জুড়ে, কয়েকটি মুহূর্ত নয়, সেইজন্য while হল । এক্ষেত্রে as বা when এর থেকে while বেশী সুপ্রযুক্ত । দুটি বাক্যের যে কোনটিকেই আগে ব্যবহার করা যায় । ট্রেনে যাওয়া - travel by train । এমনও লেখা যেত - while I was travelling by train ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson3 (10)",
                        "text1": "যখন আমি অফিসে ছিলাম, তখন আমার স্ত্রী বাড়ীতে বারে বারে অজ্ঞান হয়েছিল",
                        "text2": "While I was at office, my wife had a number of fits at home. <br> <br>দুটো বাক্যেরই ঘটনা অনেকটা সময় ধরে ঘটেছে, তাই while ব্যবহার হল । At office হল, at home-ও হল । অজ্ঞান হওয়া - has fits ।  অজ্ঞান  হওয়া অর্থে fainted-ও ব্যবহার করা যেত । দুটো বাক্যের মধ্যে then ব্যবহার করা ভুল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson3 (11)",
                        "text1": "যতক্ষণ শ্বাস ততক্ষণ আশ",
                        "text2": "While there is life, there is hope. <br> <br>এখানেও সময়ের ব্যাপ্তি আছে । এখানে কোন মতেই when, as বা till সুপ্রযুক্ত নয় (till 'অবধি' বোঝায়) । While life, there is hope - ভুল ইংরিজি । While there is hope, there is life - এটাও ভুল, কারণ শ্বাসের আগেই \"যতক্ষণ\" আছে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson3 (12)",
                        "text1": "ছেলেরা খেলল, একই সঙ্গে মেয়েরা গাইল",
                        "text2": "The girls sang, while the boys played. <br> <br>এটি while-এর আলাদা একটি ব্যবহার । এখানে কিন্তু \"যতক্ষণ\" অর্থে while ব্যবহার হল না, \"একই সময়\" অর্থে ব্যবহার হল । এক্ষেত্রে দুটি বাক্যের যে কোন একটির আগেই while ব্যবহার করা যায়, কারণ দুটি ঘটনাই একসঙ্গে ঘটেছে । while-এর জায়গায় at the same time ব্যবহার ঠিকই হত, তবে while-ই ভাল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson3 (13)",
                        "text1": "যদিও সে অসুস্থ ছিল, সে প্রথম হয়েছিল",
                        "text2": "Though he was sick, he stood first. <br> <br>Though - যদিও । though এর জায়গায় even if-ও লেখা যায় । became first এর জায়গায় stood first লেখা ভাল । ২য় বাক্যের আগে then বা that ব্যবহার এখানে ভুল হবে ।"
                      }
]