[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson4 (1)",
                        "text1": "আমার কাছে চাবি থাকা সত্ত্বেও আমি দরজা খুলতে পারিনি",
                        "text2": "I could not open the door though I had key. <br> <br>সাজিয়ে নাও, আমি দরজা খুলতে পারিনি, যদিও আমার চাবি ছিল । দুটো বাক্যের যে কোন একটিকেই আগে লেখা যায় । অর্থাৎ though প্রথমেও বসতে পারে, আবার মাঝেও বসতে পারে - Though I had key, I could not open the door ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson4 (2)",
                        "text1": "সে ধীরগতি ছিল, তা সত্বেও সব প্রশ্নের উত্তর করতে পেরেছিল",
                        "text2": "He was slow, yet he could answer all questions. <br> <br>Yet - তা সত্ত্বেও । এটিকে এমনও লেখা যেত - Though he was slow, he could answer all questions । দ্বিতীয় বাক্যে he উহ্য রাখা যায় yet ব্যবহার করলে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson4 (3)",
                        "text1": "আমরা দু গোল করেছিলাম, তাও জিততে পারিনি",
                        "text2": "We scored two goals, still we could not win. <br> <br>Still - তা সত্ত্বেও । yet এবং still - দুটোরই একই অর্থ, তাই এখানে yet ব্যবহারও ঠিক হত । Though we scored two goals, we could not win - এইভাবেও লেখা যেত ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson4 (4)",
                        "text1": "সে শুধু গরীব নয়, অসৎ-ও বটে",
                        "text2": "He is not only poor but also dishonest. <br> <br>Not only-but also ব্যবহার হয় যখন দুটি adjective বা দুটি বাক্যকে জোড়বার প্রয়োজন হয় \"শুধু এটা নয় ওটাও বটে\" অর্থে। এই বাক্যে দুটি adjective \"poor\" এবং \"dishonest\"-কে জোড়া হয়েছে । নয় কেবল মাত্র - not only, বটেও - but also । এখানে he is poor and dishonest লিখলে ভাবার্থ ঠিক আসবে না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson4 (5)",
                        "text1": "শিক্ষকটি শুধু ভাল পড়ান না, তিনি একজন ভাল মানুষও বটে",
                        "text2": "The teacher not only teaches well but also is a good man. <br> <br>এখানে not only-but also ব্যবহার হল দুটি বাক্যকে জুড়তে, adjective-কে নয় । লক্ষ্য কর, পরের বাক্যে teacher কথাটি উহ্য আছে । Not only the teacher teaches well but also he is a good man লিখলেও ঠিক হত ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson4 (6)",
                        "text1": "যে মুহূর্তে সে পৌঁছেছিল, সেই মুহূর্তেই সবাই চলে গিয়েছিল",
                        "text2": "As soon as he arrived, all left. <br> <br>একদম বা প্রায় একই মুহূর্তে দুটি কাজ ঘটলে as soon as ব্যবহার হয় । এখানে when বা এমনকি whenever ব্যবহারও সুপ্রযুক্ত নয় । এই ক্ষেত্রে all had left হবে না, all left হবে, কারণ পৌঁছনোর ঘটনার কোন রেশ নেই, দুটি ঘটনাই একসঙ্গে ঘটেছে । then all left-ও ঠিক নয়, কারণ \"তারপর\" তো কিছু হয় নি । Then-এর জায়গায় that ব্যবহারও ভুল । পৌঁছনো - arrive ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson4 (7)",
                        "text1": "যেই আমি লেখা শেষ করলাম, তখনই পরীক্ষার ঘণ্টা বাজল",
                        "text2": "As soon as I stopped writing, the examination bell rang. <br> <br>আগের মতই, যদিও \"যে মুহূর্তে\" বলা নেই, কিন্তু ভাবটা একই । \"I stopped writing\" একটি Gerund-এর ব্যবহার । Stopped to write লিখলে ভুল হবে । বাজা - Ring । ২য় বাক্যের আগে then বা that দিলে ভুল হবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson4 (8)",
                        "text1": "এবারও আমি আগের বার যেমন খেলেছিলাম, তেমনই খেললাম",
                        "text2": "This time again I played just like I played last time. <br> <br>দুটি বাক্যের ঘটনার সাদৃশ্য থাকলে like সংযোগকারী হিসাবে ব্যবহার করা হয় । এখানে Just like I played last time, this time again I played এটা ঠিক নয়, কারণ আমি কেমন খেলেছি, না আগের বারের মতন । অতএব হল This time again I played, just like I played last time । ভুল ইংরিজি - Played in (বা at) last time । আর ভুল -  This time again I played that just like I played last time । তবে ঠিক - This time I played just like last time ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson4 (9)",
                        "text1": "গতবার আমি যেমন খেলেছিলাম, এবার আমি তেমন খেলিনি",
                        "text2": "This time I played unlike I played last time. <br> <br>এখানে যেহেতু দুটি বাক্যের বৈসাদৃশ্য আছে, তাই unlike ব্যবহার হল । তা না হলে বাকীটা like-এর মতই । এমনও লেখা যেত, This time I did not play like I played last time অথবা This time I played unlike last time ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson4 (10)",
                        "text1": "বিনামূল্যে হলে তবেই যাব",
                        "text2": "As long as it is free, I shall go. <br> <br>এখানে বোঝাচ্ছে, একমাত্র বিনামূল্যে হলে যাব । \"একমাত্র\" কথাটা উহ্য আছে, যার ইংরিজি only if বা as long as । মনে রাখবে, as long as এই অর্থে only if-এর চেয়ে বেশী সুপ্রযুক্ত যেখানে \"যতক্ষণ এটা বিনামূল্যে আছে, আমি যাব\" । only if it is free, I shall go লিখলেও ভুল কিছু হত না, তবে as long as বেশী ভাল ব্যবহার এক্ষেত্রে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson4 (11)",
                        "text1": "তুমি সাবধান থাকলে আমার বাইকটা ধার নিতে পারো",
                        "text2": "As long as you are careful, you can borrow my bike. <br> <br>অর্থ - যতক্ষণ তুমি সাবধান আছ, তুমি বাইকটা ধার নিতে পার । তাই as long as ব্যবহার হল । if বা only if-এর চেয়ে এক্ষেত্রে as long as বেশী সুপ্রযুক্ত । একমাত্র সাবধান হলেই তুমি বাইকটা ধার নিতে পারো - এরকম ভেবে নিলেও খুব ভুল হবে না । As long as you are careful that you can borrow my bike - ভুল ইংরিজি । ধার নেওয়া - borrow ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson4 (12)",
                        "text1": "বিনামূল্যে না হলে যাবই না",
                        "text2": "Unless it is free, I shall not go. <br> <br>সাজিয়ে নাও, যদি না এটা বিনামূল্যে হয়, আমি যাবই না । If it is not free, I shall not go বললে কম জোর বোঝাত । তাই unless ব্যবহার হল ('যাবই না' আছে বলে) । Unless you love me, I shall not love you এরকমই আরেকটা ব্যবহার, যেখানে বক্তার অবস্থান খুব স্পষ্ট এবং জোরের সঙ্গে বলা হচ্ছে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCO2-Lesson4 (13)",
                        "text1": "যতদূর আমি জানি, তিনি এক জটিল মানুষ",
                        "text2": "As far as I know, he is a complex man. <br> <br>এই \"যতদূর\" অর্থে as far as ব্যবহার হয় । I know that he is a complex man ভাব ঠিক আসছে না । As long as I know that he is a complex man - ভুল ইংরিজি । as দিয়ে এরকম আরো কয়েকটি আছে - as good as, as mean as ইত্যাদি ।"
                      }
]