[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson9 (1)",
                        "text1": "আমায় ডাক্তার হতেই হবে",
                        "text2": "I have to be a doctor. <br> <br>আমায় হতেই হবে - I have to be (যেমন I have to play, I have to go, তেমনই I have to be) । ভুল - I have be । I must be a doctor-ও ঠিক ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson9 (2)",
                        "text1": "আমি ডাক্তার হতে পারতাম",
                        "text2": "I could be a doctor. <br> <br>হতে পারি - can be । হতে পারতাম - could be । might be ব্যবহারও হয় এক্ষত্রে । be could ভুল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson9 (3)",
                        "text1": "ভালো ছেলেটি ভালো ফুটবল খেলে",
                        "text2": "The good boy plays football well. <br> <br>good আর well-এর তফাৎ খেয়াল করা খুব জরুরী । লক্ষ্য কর, good এখানে adjective বা বিশেষণ হিসেবে ব্যবহার হল, আর well ব্যবহার হল adverb হিসেবে (যা play নামক verb-টিকে একটি ভাব প্রদান করছে) । The good boy plays football good বা The well boy plays football good ভুল ইংরিজি, কারণ প্রথমটিতে good-কে adverb হিসেবে আর দ্বিতীয়টিতে well-কে adjective হিসেবে ব্যবহার করার চেষ্টা হয়েছে, যেটা ভুল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson9 (4)",
                        "text1": "কাল ওর ভালো সময় ছিল",
                        "text2": "She had a good time yesterday. <br> <br>কি ছিল, না ভালো সময় । অতএব তার অধীনে ভালো সময় ছিল । তাই have verb বসল । অতীতকাল বলে had হল । লক্ষ্য কর, good time লেখা হয়েছে, কারণ \"সময়\" noun-এর adjective হল \"ভালো\", আর adjective বোঝাতে good ব্যবহার হয়, well হয় না । yesterday আর tomorrow-এর তফাৎ মনে আছে তো ?"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson9 (5)",
                        "text1": "তাকে ভালো দেখাচ্ছে না",
                        "text2": "He is not looking well. <br> <br>subject আগে ধরবে । একটাই তো হতে পারে - \"সে\" । \"তাকে\" আছে বলেই him হবে না । look অর্থ যেমন দেখা, তেমনই দেখানো অর্থেও look ব্যবহার হয় । The car looks beautiful বা money looks small ইত্যাদি । verb \"দেখানো\"-কে ভাব প্রদান করছে \"ভালো\", তাই adverb হিসেবে well বসল । দেখাচ্ছে না - is not looking । যদি থাকত, এটা ভালো দেখায় না - it does not look good, এখানে আবার good হবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson9 (6)",
                        "text1": "অঙ্ক বেশ ভালো পারি",
                        "text2": "I can do Mathematics very well. <br> <br>প্রথমত, \"আমি\" নেই, কিন্তু ইংরিজিতে I লিখতেই হবে । ঠিক তেমনই \"ভালো পারি\" আছে বলে can Mathematics well লিখবে না, can-এর পর একটা verb থাকতেই হবে । এবার very-র ব্যবহারটা লক্ষ্য কর । very বসে adjective আর adverb-এর আগে, noun-এর আগে বসাবার চেষ্টা কোরো না, যদিও বিশেষ বিশেষ ক্ষেত্রে সেটাও  ঠিক । very well (adverb), very bad (adjective), very soon (adverb), very nice (adjective) ইত্যাদি হয় । verb-এর আগেও very বসাবে না, যেমন \"সে খুব হাসছে\" বোঝাতে he is very laughing ভুল  । এক্ষেত্রে adverb জুড়তে হবে, he is laughing very much ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson9 (7)",
                        "text1": "আমার ছেলে আমায় খুব ভালোবাসে",
                        "text2": "My son loves me very much. <br> <br>লক্ষ্য কর, \"খুব\" আছে \"ভালোবাসে\" verb-এর সঙ্গে । তাই adverb ব্যবহার হবে - very much (খুব) । ভুল - My son very loves me । এর কারণ, verb-এর সঙ্গে ইংরিজিতে কখনো very বসে না । adverb আর adjective-এর সঙ্গে বসে । আরো ব্যবহার - he plays with me very much (সে আমার সঙ্গে খুব খেলে) । খেয়াল করে দেখো, verb-এর সঙ্গে \"খুব\" থাকলে তখনই very much হয় । My son loves me a lot-ও ঠিক ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson9 (8)",
                        "text1": "আমার ছেলে আমায় খুব খুব ভালোবাসে",
                        "text2": "My son loves me very much. <br> <br>বাঙলায় \"খুব খুব\" লিখলেও ইংরিজিতে very very much লিখবে না । Very much-ই হবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson9 (9)",
                        "text1": "সে দিনে অনেক জল খায়",
                        "text2": "He drinks a lot of water in a day. <br> <br>\"অনেক\" অর্থে a lot of বা lot of ব্যবহার করবে, much water লিখবে না । much কখনো affirmative sentence-এ বা positive অর্থে ব্যবহার হয় না । lot of-এর আরো ব্যবহার -  He gives me a lot of money every month, There is lot of water in the pond ইত্যাদি । many তো বসাবেই না, সংখ্যা থাকলে many হয় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson9 (10)",
                        "text1": "পুকুরটায় বেশী জল নেই",
                        "text2": "There is not much water in the pond. <br> <br>আগের উদাহরণে বলা হয়েছে, affirmative sentence-এ much  ব্যবহার হয় না । এখানে negative sentence (not আছে), তাই much ব্যবহার করা গেল । \"বেশী জল\" অর্থে much water লেখা যায় না, কিন্তু \"বেশী জল নেই\" অর্থে not much water লেখা যায় । আরো উদাহরণ - I do not have much money (আমার বেশী টাকা নেই) । The pond has not much water লিখলেও ঠিক হয় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson9 (11)",
                        "text1": "তোমায় অনেক ধন্যবাদ",
                        "text2": "I thank you very much. <br> <br>কথোপকথনে শুধু thank you very much লেখা চলতে পারে । বা lot of thanks to you । বা thanks a lot । কিন্তু লিখতে গেলে I thank you very much লিখবে । I thank you a lot-ও লিখতে পারো ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson9 (12)",
                        "text1": "পুকুরে কিন্তু অনেক ব্যাঙ আছে",
                        "text2": "But there are many frogs in the pond. <br> <br>সংখ্যা বোঝাচ্ছে বলে many হল । much বসবে না । very many লেখার দরকার নেই । a lot of frogs-ও লেখা যায় । অতএব তোমরা শিখলে, অনেক অর্থে much বসে negative sentence-এ, many বসে সংখ্যা বোঝাতে, very much একটা adverb যা কেবলমাত্র verb-এর পর বসে আর a lot of ব্যবহার করবে affirmative (positive) sentence-এ much-এর পরিবর্তে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BCP4-Lesson9 (13)",
                        "text1": "আলু কোনো ফল নয়",
                        "text2": "Potato is not a fruit. <br> <br>Potato is not fruit ভুল, কারণ fruit হল noun আর noun-এর আগে no বসে । কিন্তু not a fruit তো লেখা যায়, সেক্ষেত্রে নিয়ম ভাঙছে না । এখানে Potato is no fruit লিখতে পারো অবশ্য । The potato লেখা হল না ।"
                      }
]