[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson3 (1)",
                        "text1": "Rubaiya said, \"I had never been there before\".",
                        "text2": "Rubaiya said that she had never been there before. <br> <br>I had never been there before বাক্যটির অর্থ, আমি ওখানে আগে কখনো যাইনি । লক্ষ্য কর, এখানেও দুটো বাক্যেই past tense থাকলেও পরেরটায় had been বসেই রয়েছে, তাই সেটার আর পরিবর্তন করার প্রয়োজন হল না (শুধু I হল she) ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson3 (2)",
                        "text1": "Aditi told Rakesh, \"He is a nice man now\".",
                        "text2": "Aditi told Rakesh that he was a nice man then. <br> <br>লক্ষ্য কর, he-টা he-ই রইল, Aditi told Rakesh that Rakesh was a nice man then হল না । now হল then । যদি থাকত, Aditi told about Rakesh, \"He is a nice man now.\", তবে হত Aditi said that Rakesh was a nice man then ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson3 (3)",
                        "text1": "Jewel said to Chandrani, \"I can help you tomorrow\".",
                        "text2": "Jewel said to Chandrani that he could help Chandrani the next day. <br> <br>I হল he ।  can হল could । You হল Chandrani । আর tomorrow হল the next day ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson3 (4)",
                        "text1": "Asha said, \"If I lose my job now, I shall die\".",
                        "text2": "Asha said that if she lost her job then, she would die. <br> <br>Simple present tense (I lose) হল simple past tense (she lost) । আর I shall হল she would । লক্ষ্য কর, if আছে বলে নিয়ম অন্যরকম কিছু হল, তা নয় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson3 (5)",
                        "text1": "Asha said, \"If I lost my job then, I would die.\"",
                        "text2": "Asha said that if she had lost her job then, she would have died. <br> <br>লক্ষ্য কর, simple past tense (I lost) হল past perfect tense (she had lost) । আর পরের অংশে she would die লিখলে হবে না, she would have died লিখতে হবে, কারণ would-ও হল simple past, তাই would have died হল, যা past perfect । নিয়ম কিছু আলাদা হল না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson3 (6)",
                        "text1": "\"I know that God is great\", cried Bibhas.",
                        "text2": "Bibhas cried saying that he knew that God is great. <br> <br>লক্ষ্য কর, এখানে \"-এর ভেতরেই that দিয়ে দুটো বাক্যাংশ জোড়া আছে, যার দুটোই present tense । তাই indirect speech-এ he knew হল, আর God is great একই রইল, কারণ এটি ধ্রুবসত্য, তা মনে করা যেতে পারে । অবশ্য God was great লিখলেও ভুল হত না । cried saying না লিখে cried and said-ও লেখা যায় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson3 (7)",
                        "text1": "Bibhas said, \"I know that a great thing happened in my life then\".",
                        "text2": "Bibhas said that he knew that a great thing had happened in his life then. <br> <br>\"-এর মধ্যে দুটো বাক্যাংশ, যা that দিয়ে জোড়া আছে, তার একটি simple present tense (know), অন্যটি simple past tense (happened) । তাই indirect speech-এ প্রথমটি হল simple past tense (I knew), আর দ্বিতীয়টি হল past perfect tense (had happened) ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson3 (8)",
                        "text1": "Bibhas said, \"I knew that a great thing happened in my life then\".",
                        "text2": "Bibhas said that he had known that a great thing had happened in his life then. <br> <br>আগের মতই, শুধু দুটো past tense, তাই indirect speech-এ দুটোই past perfect হল । "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson3 (9)",
                        "text1": "She said that she didn’t want to come with me.",
                        "text2": "She said, \"I don't want to go with you\". <br> <br>Indirect থেকে direct speech করার নিয়ম ঠিক একরকম । যেহেতু এখানে didn't want আছে indirect speech-এ, তাই direct speech-এ don't want হল । শুধু come-এর go ব্যবহার হল, 'আমার' দিক থেকে দেখা হচ্ছে বলে indirect-এ come লেখা হল আর direct-এ তার দিক থেকে দেখা হচ্ছে বলে come with me (মেয়েটি) হল । go-এর জায়গায় come-ও অবশ্য লেখা যায় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson3 (10)",
                        "text1": "Deb said to Shubhashree that he was thinking of her.",
                        "text2": "Deb said to Shubhashree, \"I am thinking of you\". <br> <br>Direct speech-এ I am thinking থাকলে তবেই তো indirect-এ he was thinking থাকবে । I had been thinking কিন্তু direct speech-এ হবে না indirect-এর he was thinking-এর জায়গায়, কারণ ওটা উল্টো হয় - direct-এর was thinking হয়ে যায় indirect-এর had been thinking । he যে I হবে, আর her হবে you, সেটা তো পরিষ্কার ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson3 (11)",
                        "text1": "She cried to say that I had not visited her for many years.",
                        "text2": "She cried, \"You did not visit me for many years\". <br> <br>লক্ষ্য কর, direct speech-এ শুধু cried লিখলেই যথেষ্ট হল cried to say-র জায়গায় । আর লক্ষ্য কর, had not visited হল did not visit হল, কারণ আগেই বলা হয়েছে, indirect speech-এর past perfect tense হবে direct speech-এ simple past tense । আর I হল you ও her হল me ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson3 (12)",
                        "text1": "Sabita said that I had been playing cricket when she had seen me.",
                        "text2": "Sabita said, \"You were playing cricket when I saw you\". <br> <br>indirect speech-এ I had been আছে, তাই direct-এ you were playing হল, কারণ আগেই বলা হয়েছে যে, direct-এর past continuous হয়ে যাবে indirect-এর past perfect । তেমনি she had seen me হল she saw - একই নিয়মে । were playing না লিখে অবশ্য have been playing বা had been playing-ও লেখা যায়, কারণ এগুলো থেকেও indirect speech-এ had been playing আসতে পারে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson3 (13)",
                        "text1": "Dilip said to his mother that he would be late that night.",
                        "text2": "Dilip said to his mother, \"I shall be late tonight\". <br> <br>he would be আছে বলে direct speech-এ I shall be হল । এই নিয়ম আগেই বলা হয়েছে direct থেকে indirect করার সময় । আর that night হল tonight (অর্থ - আজ রাত) ।  "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson3 (14)",
                        "text1": "I said that I knew that if I had said something wrong there, the teacher would have punished me.",
                        "text2": "I said, \"I know that if I said something wrong there, the teacher would punish me\". <br> <br>লক্ষ্য কর, I knew তখনই হতে পারে indirect speech-এ, যখন direct speech-এ simple present tense আছে । তাই direct-এ I know হল । আবার I had said তখনই হতে পারে, যদি direct-এ simple past tense থাকে । তাই if I said something wrong হল । আর would have-ও (past perfect) তখনই হয়, যখন direct-এ would (simple past) আছে । there-টা there-ই রইল, কারণ something wrong বলাটা অতীতেই ঘটছে, তাই here হল না ।"
                      }
]