[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson1 (1)",
                        "text1": "He says, \"An ass has four ears\".",
                        "text2": "He says that an ass has four ears. <br> <br>উল্টোদিকের বাক্যটি direct speech অর্থাৎ কারো মুখে বলা বাক্য, আক্ষরিকভাবে যা কেউ বলছে বা বলেছে । আর এই বাক্যটি হল indirect speech, লেখকের দিক থেকে দেখা বক্তার বক্তব্য । Direct speech-এ \"-এর ব্যবহার হয়, আর indirect speech-এ that ব্যবহার করে\"-এর আগের আর পরের বাক্যদুটিকে যুক্ত করা হয় । এখানে লক্ষ্য কর, দুটো বাক্যেরই কোন পরিবর্তন হল না, শুধু that দিয়ে ওরা যুক্ত হল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson1 (2)",
                        "text1": "He says, \"My ass had eight legs.\"",
                        "text2": "He says that his ass had eight legs. <br> <br>লক্ষ্য কর, এখানেও that দিয়ে বাক্যদুটি যুক্ত হল indirect speech-এ, আর my ass হয়ে গেল his ass । I থাকলে indirect speech-এর পরের বাক্যে (প্রথম বাক্য একই থাকে) he হয়ে যায়, আর my হয়ে যায় his অথবা her । যদি He said that his ass had eight legs লেখা হত, তবে সেটা ভুল হত, কারণ সে এখনও এই কথাটা বলে, আগে শুধু বলত তা নয় । একারণে had four legs আছে বলেই he said হবে, তা নয় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson1 (3)",
                        "text1": "Aneeta told me, \"I love chocolate.\"",
                        "text2": "Aneeta told me that she loved chocolate. <br> <br>প্রথম বাক্যের কোন পরিবর্তন হল না এবং that দিয়েই বাক্যদুটি যুক্ত হল । Indirect speech-এ পরের বাক্যে I হল she (she loved chocolate), কারণ Aneeta মেয়ে (এটা নাম দেখে বুঝে নিতে হবে) । আরেকটা ব্যাপার লক্ষ্য কর, I love chocolate হয়ে গেল she loved chocolate, কারণ Aneeta told me আছে আগের বাক্যে (past tense) । পরের বাক্যে direct speech-এর simple present tense হয়ে গেল indirect speech-এ simple past tense । আর যদি Aneeta tells me থাকত, তবে হত Aneeta tells me that she loves chocolate, সেক্ষেত্রে past tense বসত না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson1 (4)",
                        "text1": "Aneeta told me, \"I love chocolate now.\"",
                        "text2": "Aneeta told me that she loved chocolate then. <br> <br>ঠিক আগের মতই, কিন্তু now-টা হয়ে গেল then, কারণ আগের বাক্যে অতীতকাল আছে (told me) । এখানে then কিন্তু 'যদি-তবে'-র if-then নয়, 'এখন-তখন'-এর now-then ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson1 (5)",
                        "text1": "The teacher said to Akash, \"Your friend is here.\"",
                        "text2": "The teacher said to Akash that his friend was there. <br> <br>লক্ষ্য কর, indirect speech-এ পরের বাক্যের is হল was, কারণ আগের বাক্যে past tense আছে (said) । আর your হল his, কারণ তা দিয়ে আকাশকে বোঝানো হচ্ছে (পরের বাক্যেও your লিখলে direct আর indirect মিশে গিয়ে ভুল হয়ে যেত) । আরো লক্ষ্য কর, here-টা হল there, ঠিক now যেমন then হয়েছিল । এরকমই today হয়ে যায় that day, আবার tomorrow হবে next day । তেমনি yesterday হয় day before ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson1 (6)",
                        "text1": "He has said, \"I am writing a letter.\"",
                        "text2": "He has said that he is writing a letter. <br> <br>দুটো ব্যাপার লক্ষ্য করার মত । এক, আগের বাক্যে present (perfect) tense আছে বলে পরের বাক্যেও present tense হল (he is writing), কিন্তু তাই বলে পরের বাক্যে present perfect tense হল না, present continuous tense হল (he is writing), কারণ সেটাতে direct speech-এ তা-ই আছে  (I am writing)। পরের বাক্যে past tense করলে ভুল হত । আর দুই, I am হয়ে গেল he is ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson1 (7)",
                        "text1": "They have said to all, \"You can go now.\"",
                        "text2": "They have said to all that all can go now. <br> <br>কয়েকটা ব্যাপার লক্ষ্য কর । এখানে you-এর জায়গায় all বসল indirect speech-এ, কারণ যদি you-এর বদলে they লেখা হত (They have said to all that they can go now), তবে এ ব্যাপারটা গুলিয়ে যেত যে কারা যেতে পারে । তাই স্পষ্ট করে all বলে দেওয়া হল । আরো লক্ষ্য কর, now কিন্তু then হল না indirect speech-এ, কারণ past tense নেই, present tense-ই আছে । এটা বুঝে ব্যবহার করতে হবে । ভুল - They have said to all that all could go now (বা then) ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson1 (8)",
                        "text1": "Lalit said, \"I have passed the examination.\"",
                        "text2": "Lalit said that he had passed the examination. <br> <br>That দিয়েই বাক্যদুটো যুক্ত হল । I have-এর জায়গায় he had বসল indirect speech-এ, কারণ আগের বাক্যে past tense আছে (Lalit said) তাই পরের বাক্যের present perfect tense হল past perfect tense (he had) । ভুল - Lalit said that he has passed the examination বা Lalit said that he passed the examination ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson1 (9)",
                        "text1": "Prakash said, \"You have never loved me, Tanima.\"",
                        "text2": "Prakash said to Tanima that she had never loved him. <br> <br>লক্ষ্য কর, said to Tanima লেখা হল indirect speech-এ, যদিও direct speech-এর প্রথম বাক্যে তা নেই । কিন্তু \"-এর ভেতর Tanima-কে সম্বোধন করা আছে, তাই Prakash said to Tanima হল । indirect speech-এ you হল she, কারণ সেটা তনিমাকে বোঝাচ্ছে আর Tanima মেয়ে । আরো লক্ষ্য কর, you have হল she had (আগের মত),  past tense আছে বলে । আর me হল him, যা প্রকাশকে বোঝাচ্ছে indirect speech-এ । যদি Prakash said that Tanima had not loved him লেখা হত, তবে পুরোটা ঠিক হত না, কারণ সেক্ষেত্রে বাক্যটা যে তনিমাকে বলা হচ্ছে, সেই তথ্য বাদ পড়ে যেত ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson1 (10)",
                        "text1": "Prakash told me, \"You are a cheat.\"",
                        "text2": "Prakash told me that I was a cheat. <br> <br>তিনটে ব্যাপার লক্ষ্য কর । এক, Prakash told me বাক্যটির কোন পরিবর্তন হল না । দুই, you-এর জায়গায় I বসল indirect speech-এ, কারণ প্রকাশ আমায় cheat (ঠক) বলেছে, নিজেকে বলেনি (নিজেকে বললে লেখা হত Prakash said that he was a cheat) । আর তিন, indirect speech-এ I was হল পরের বাক্যে, কারণ আগের বাক্যে past tense আছে (Prakash told me) । ভুল - Prakash told me that I am a cheat বা Prakash told me that you are a cheat ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson1 (11)",
                        "text1": "Prakash told Dilip, \"You are a cheat.\"",
                        "text2": "Prakash told Dilip that Dilip was a cheat. <br> <br>আগের মতই, কিন্তু একটু তফাৎ আছে । যদি লেখা হত, Prakash told Dilip that he was a cheat, তবে গুলিয়ে যাবার সম্ভাবনা থাকে, he দিয়ে কাকে বোঝানো হচ্ছে - প্রকাশ না দিলীপ । তাই পরিষ্কার করে লিখতে হবে Dilip was a cheat । খেয়াল রাখবে, told to Dilip হয় না, told Dilip হয় । said to Dilip হয় আবার, said Dilip ভুল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI1-Lesson1 (12)",
                        "text1": "He said, \"My father died in the morning.\"",
                        "text2": "He said that his father had died in the morning. <br> <br>জেনে রাখবে, direct speech-এর simple past tense পরবর্তিত হয় past perfect tense-এ । তাই father had died in the morning হল । আর my হয়ে গেল his ।"
                      }
]