[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson3 (1)",
                        "text1": "Alice said, \"How clever I am !\"",
                        "text2": "Alice exclaimed that she was very clever. <br> <br>প্রশ্ন আর আদেশ-অনুরোধের মতই  direct-indirect speech-এ বিস্ময়-আশ্চর্যসূচক বা আশাসূচক বাক্য আর একটি রকম । এখানে বিস্ময় আছে - How clever I am ! যে শব্দ দিয়ে ইংরিজিতে বিস্ময় বোঝানো হয়, তা হল exclaim (verb) । তাই হল, Alice exclaimed that । বাকিটা পরিষ্কার - she was very clever, কারণ I হবে she (Alice মেয়ে তাই), আর am হবে was । লক্ষ্য কর, এক্ষেত্রে that দিয়ে জোড়া হল, if বা to দিয়ে নয় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson3 (2)",
                        "text1": "Geeta cried, \"My God ! I am lost in the forest.\"",
                        "text2": "Geeta cried and exclaimed that she was lost in the forest. <br> <br>এখানেও অবাক হওয়া (বিস্ময়) আছে, তাই exclaimed হল । শুধু exclaimed লেখা হল না, cried and exclaimed লেখা হল, কারণ আগেই বলা হয়েছে । exclaimed to say লেখার প্রয়োজন নেই, exclaim-এর ভেতরেই say লুকিয়ে আছে । I am হল she was । আগের উদাহরণের how-এর মত এখানে My God এলই না indirect speech-এ ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson3 (3)",
                        "text1": "Nandita said to Jagdish, \"Happy birthday !\"",
                        "text2": "Nandita wished Jagdish a happy birthday. <br> <br>আশ্চর্যবোধক চিহ্ন থেকে বাক্যের রকম বোঝা গেলেও বিস্ময় (exclaim) না ইচ্ছাপ্রকাশ বা আশাপ্রকাশ (wish) সেটা তোমাকে বুঝতে হবে । Happy birthday জানানো মানে ইচ্ছে জানানো যে জন্মদিন আনন্দময় হোক । তাই wished হল এখানে । Nandita wished that Jagadish had a happy birthday-ও লেখা যায় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson3 (4)",
                        "text1": "He said, \"Oh, if only I am taller !\"",
                        "text2": "He wished that he was/were taller. <br> <br>খানেও ইচ্ছে বা আশাপ্রকাশ করা হচ্ছে, তাই wished বসল । he were taller-ও ঠিক - এটা একটা বিশেষ ব্যবহার, কিছু হওয়ার ইচ্ছে থাকলে if I were a king, if I were a God এরকম হয় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson3 (5)",
                        "text1": "He said, \"How sad that you did not come !\"",
                        "text2": "He exclaimed sadly that I had not come. <br> <br>exclaimed হল এখানে, কারণ এটা একটা ব্যঞ্জনা । How sad-টা sadly (adverb) হল । sadly না লিখে লেখা যেত, He exclaimed that it had been sad that I did not come । লক্ষ্য কর, I had not come হল, I did not come হল না, কারণ simple past হয় past perfect ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson3 (6)",
                        "text1": "She asked me what I was going to do at the weekend.",
                        "text2": "She told me, \"What are you going to do at the weekend ?\" <br> <br>Indirect থেকে direct speech করার নিয়ম ঠিক একরকম, আগেই বলা হয়েছে । indirect speech-এ ask আছে, সেটাকে told করা হল direct-এ, যদিও asked লিখলেও ঠিকই হত । আগে ভেবে নেবে, I was going-টা কী হবে direct speech-এ । আগে আমরা দেখেছি, direct থেকে indirect করতে হলে present continuous tense হয়ে যায় past continuous । এখানে অতএব past continuous হবে present continuous, তাই হল you are going । এবার প্রশ্ন করার জন্য ঘুরিয়ে দাও - what are you going ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson3 (7)",
                        "text1": "Deepa asked me how my journey had been.",
                        "text2": "Deepa asked me, \"How was your journey ?\" <br> <br>asked আছে বলে বোঝাই যাচ্ছে, direct speech-এ প্রশ্ন হবে এ উদাহরণেও । আর Indirect speech-এ had been কখন হয় ? যখন direct speech-এ was থাকে । তাই প্রশ্ন করার জন্য ঘুরিয়ে নাও, how was your journey, কারণ my এখানে your হবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson3 (8)",
                        "text1": "Navin asked me what I had been doing when he had seen me.",
                        "text2": "Navin said to me, \"What were you doing when I saw you ?\" <br> <br>ask আছে মানেই প্রশ্ন । এটা আগে ধরতে হবে - প্রশ্ন কি প্রশ্ন নয় । এরপর দেখ, had been doing কখন হয় indirect speech-এ ? যখন direct-এ was/were doing থাকে । তাই এখানে I had been doing-টা হল you were doing । এবার প্রশ্ন কর - what were you doing ? একইভাবে had seen থাকার জন্য direct speech-এ হল saw । পরিবর্তন করার সময় I আর me হবে you, আর he হবে I । "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson3 (9)",
                        "text1": "Michael asked his friend if he could borrow his friend's car on Sunday.",
                        "text2": "Michael asked his friend, \"Can I borrow your car on Sunday ?\" <br> <br>প্রশ্ন তো বোঝাই যাচ্ছে, কারণ indirect speech-এ ask আছে । এরপর দেখ, how, what, when ইত্যাদি কিছু নেই indirect-এ, if আছে । if কখন হয় ? যখন প্রশ্নে can I, shall you, are you ইত্যাদি থাকে (আগেই বলা হয়েছে) । এখানে আছে, he could । তাই হল, can I । লক্ষ্য কর, his friend's car লেখা হয়েছিল বিভ্রান্তি এড়াতে, কিন্তু direct speech-এ সেই বিভ্রান্তি নেই । তাই সেখানে your car লেখাই যথেষ্ট । "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson3 (10)",
                        "text1": "She asked me whether I had studied indirect speech before.",
                        "text2": "She said to me, \"Have you studied indirect speech before ?\" <br> <br>দেখ, I had studied আছে । সেটা direct speech-এর প্রশ্নে have you studied থেকে আসতে পারে, আবার did you study থেকেও আসতে পারে - দুটোই ঠিক । whether আর if বদলে বদলে লেখা যায়, মানে একই ।  "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson3 (11)",
                        "text1": "Mother ordered us not to play in front of the window.",
                        "text2": "Mother told us, \"Don't play in front of the window.\" <br> <br>ordered দেখেই বুঝতে পারছ, এটা আদেশ-নির্দেশ-ইচ্ছার উদাহরণ । এখানে আদেশ । তাই শুধু don't play হল, please দেওয়া হল না । মনে করে দেখ, indirect speech-এ don't smoke, don't drink, don't run ইত্যাদি থাকলে direct speech-এ not to smoke, not to drink, not to run ইত্যাদি ব্যবহার হয় ordered বা requested-এর পর ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson3 (12)",
                        "text1": "Mr. Gomes requested Arindam to shut the door.",
                        "text2": "Mr. Gomes said to Arindam, \"Please shut the door.\" <br> <br>Request হল অনুরোধ । তাই শুধু shut the door না লিখে please shut the door হল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson3 (13)",
                        "text1": "Parveen wished that she had a new house.",
                        "text2": "Parveen said, \"Oh, if I have a new house !\" <br> <br>ইচ্ছাপ্রকাশ যখন বোঝাই যাচ্ছে (wished), তখন direct speech-এ একটা oh বা well বা অন্য কোন আশ্চর্যবোধক শব্দ ঢুকিয়ে তার সঙ্গে if জুড়ে দাও । she had আছে বলে I have হল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BDI2-Lesson3 (14)",
                        "text1": "He exclaimed with joy that he had won a prize.",
                        "text2": "He said, \"Hurrah! I have won a prize.\" <br> <br>এটি আশ্চর্যবোধক বাক্যের উদাহরণ, কারণ exclaimed (with joy) রয়েছে । তাই Hurrah (আনন্দদায়ক ব্যঞ্জনা) শব্দটি ঢোকানো হল direct speech-এ । এরকম উদাহরণ আর হতে পারে - He had exclaimed with sorrow that he had lost a friend । সেক্ষেত্রে direct speech হবে - He said, \"Alas! I have lost a friend.\" (alas একটি দুঃখপূর্ণ ব্যঞ্জনা) । আবার লক্ষ্য কর, he had won আছে indirect speech-এ, তাই direct-এ I have won না হয়ে I won-ও হতে পারত ।"
                      }
]
