[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson3 (1)",
                        "text1": "একটি সুন্দর করে আঁকা ছবি হাজার শব্দের চেয়ে ভাল",
                        "text2": "A picture nicely painted is better than thousand words. <br> <br>A picture nicely painted - একটি সাধারণ participle-এর ব্যবহার, যদিও  nicely painted picture-ও লেখা যেত । সেটি হত participle adjective-এর ব্যবহার ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson3 (2)",
                        "text1": "ভালবাসা পেয়ে সে তার ভালবাসা দিল",
                        "text2": "Being loved, she gave her love. <br> <br>ভালবাসা পেয়ে - being loved । ভাল ইংরিজি নয় - getting love বা getting loved । বরং having been loved  লেখা যেত । আবার মনে করিয়ে দিই, এখানেও দুটি বাক্যাংশ আছে, ভালবাসা পাওয়া আর ভালবাসা দেওয়া । ভালবাসা পাওয়া আগে আছে বলে, being loved আগে হল । being loved একটি passive voice-এর ব্যবহার ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson3 (3)",
                        "text1": "তাড়াতাড়ি পাওয়া শিক্ষা তাড়াতাড়ি ভুলেও যাওয়া হয়",
                        "text2": "Lessons learned quickly are soon forgotten. <br> <br>এখানে quickly learned lessons-ও লেখা যেত, সেটা হত participle adjective-এর ব্যবহার । lessons learned quickly - সাধারণ participle । লক্ষ্য কর, কে ভুলে যাচ্ছে, সেটা বলা নেই বলে passive voice -  'is forgotten' ব্যবহার হল । quickly এবং soon দুটিই adverb, একই অর্থ বহন করে । forget - ভুলে যাওয়া । Forget - Forgot - Forgotten ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson3 (4)",
                        "text1": "দোষ বার করা সোজা",
                        "text2": "To find fault is easy. <br> <br>লক্ষ্য কর, এটি infinitive-এর ব্যবহার । এখানে infinitive 'to find fault' noun হিসেবে ব্যবহার হল, অর্থ দোষ (খুঁজে) বার করা । infinitive-এর জায়গায় gerund-ও ব্যবহার করা যায়, যেমন Finding fault is easy । ভুল ইংরিজি - find fault is easy । এখানে to find fault লিখতে হবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson3 (5)",
                        "text1": "দেখলে বিশ্বাস হয়",
                        "text2": "To see is to believe. <br> <br>আগে 'দেখলে বিশ্বাস হয়' gerund-এর ব্যবহার দিয়ে 'Seeing is believing' লেখা হয়েছিল । gerund-এর বদলে infinitive দিয়ে To see is to believe লেখা হল । দুটিই ঠিক বাক্য, দুটির অর্থই সমান । See is believe - ভুল ইংরিজি ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson3 (6)",
                        "text1": "আমি তোমায় যেতে দেব না",
                        "text2": "I will not let you go. <br> <br>কিছু কিছু verb আছে যার পরে to না ব্যবহার করলেও চলে, যেমন let, see, hear, make ইত্যাদি । এখানে let-এর অর্থ হল allow-এর মত । লক্ষ্য কর, I will not let you to go না হয়ে, I will not let you go হল । জোর বোঝাতে I shall not না হয়ে I will not হল । I shall not allow you to go - লেখা যেত ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson3 (7)",
                        "text1": "ঈশানকে দাঁড় করিয়ে রাখো",
                        "text2": "Make Ishan stand. <br> <br>এটিও আগের মতই । make(verb) আছে বলে Make Ishan to stand হল না, Make Ishan stand হল । কারোকে কিছু করানো অর্থে make-এর ব্যবহার লক্ষ্য কর (শুধু তৈরী করা অর্থেই make ব্যবহার করা হয় না), যেমন make him stand (দাঁড় করিয়ে রাখা), make him run (দৌড় করানো), make him walk (হাঁটানো) ইত্যাদি ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson3 (8)",
                        "text1": "আমি কুকুরটাকে ছুটিয়েছিলাম",
                        "text2": "I made the dog run. <br> <br>আগের মতই । দৌড় করানো বা ছোটানো অর্থে make somebody run হল । I made run the dog বা I made the dog running - ভুল ইংরিজি ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson3 (9)",
                        "text1": "আমি সুস্মিতকে হাসতে দেখেছিলাম",
                        "text2": "I saw Susmit laugh. <br> <br>এটাও আগের মত । কাউকে হাসতে দেখা - see someone laugh । আসলে এখানে to উহ্য আছে, আগের দুটো বাক্যের মতই । I saw Susmit laughing বা I saw laughing Susmit - ভুল ইংরিজি ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson3 (10)",
                        "text1": "আমি নন্দিতাকে গান গাইতে শুনেছিলাম",
                        "text2": "I heard Nandita sing. <br> <br>Let, make, see-এর মতই hear-এর পরে to উহ্য রইল । এখানে I heard Nandita to sing না লিখে, লেখা হল I heard Nandita sing ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson3 (11)",
                        "text1": "দৌড়নো ছাড়া তাদের অন্য কোন উপায় নেই",
                        "text2": "They have no choice but to run. <br> <br>এটিও একটি infinitive-এর ব্যবহার । তাদের কোন উপায় নেই - they have no choice, দৌড়নো ছাড়া - but to run । এখানে but to run-এর জায়গায় but running, except running বা other than running-ও লেখা যেত, কিন্তু no choice but to run বেশী ভালো ব্যবহার ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson3 (12)",
                        "text1": "আমার অভ্যাস ধূমপান করা আর আনন্দ হল গান করা",
                        "text2": "My habit is to smoke, and my pleasure is to sing. <br> <br>এখানে to smoke-এর জায়গায় smoking এবং to sing-এর জায়গায় singing লেখা যেত । কিন্তু My habit is smoke, and my pleasure is sing হবে না, to smoke এবং to sing লিখতে হবে (infinitive), যেগুলি noun হিসেবে ব্যবহার হচ্ছে (ধুমপান করা, গান করা এই কাজগুলি) ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson3 (13)",
                        "text1": "রোগীটি হাঁটার পক্ষে দুর্বল",
                        "text2": "The patient is too weak to walk. <br> <br>এটি একটি বিশেষ ব্যবহার । too weak to walk-এর অর্থ হল, এত দুর্বল যে হাঁটতে পারে না । অতএব The patient is so weak, that he can not walk লিখলেও ঠিক হত । too weak to walk-এর মত too bad to eat (এত খারাপ যে খাওয়া যায় না), too fool to learn (এত বোকা যে শিখতে পারে না), too important to forget (এত গুরুত্বপূর্ণ যে ভোলা যায় না) ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson3 (14)",
                        "text1": "স্বামী বিবেকানন্দ এক শ্রদ্ধা করার মত মানুষ",
                        "text2": "Swami Vivekananda is a man to be respected. <br> <br>লক্ষ্য কর, এখানে passive voice ব্যবহার হল to be respected, কারণ তিনি শ্রদ্ধা করছেন না, শ্রদ্ধা পাচ্ছেন । Swami Vivekananda is a respected man লিখলে ভাবার্থ ঠিক আসত না, কারণ তাহলে অর্থ দাঁড়াত, স্বামী বিবেকানন্দ শ্রদ্ধা পাচ্ছেন, কিন্তু এখানে আছে 'শ্রদ্ধা করার মত', তাকে শ্রদ্ধা করা হচ্ছে তা নয় ।"
                      }
]