[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson1 (1)",
                        "text1": "শব্দ শুনতে পেয়ে পুষ্পিতা চোরটাকে ধরে ফেলল",
                        "text2": "Hearing a noise, Pushpita caught the thief. <br> <br>এটি participle-এর প্রয়োগ । participle-এর সঙ্গে gerund-এর তফাৎ হল, gerund - noun হিসেবে ব্যবহার হয়, আর participle - দুটি বাক্যের সংযোগকারী হিসেবে ব্যবহার হয় । যদিও দুক্ষেত্রেই verb-এর সঙ্গে ing বা ed ইত্যাদি যোগ করা হয় । এই বাক্যের দুটি অংশ আছে, 'শব্দ শুনতে পাওয়া' এবং 'চোরকে ধরা' । যেটি আগে ঘটেছে (শব্দ শুনতে পাওয়া), সেখানেই participle-এর প্রয়োগ হবে । তাই হল hearing a noise ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson1 (2)",
                        "text1": "সব নিরাপদ ভেবে পীযূষ তার বাড়ির বাইরে এল",
                        "text2": "Thinking all was safe, Pijush came out of his house. <br> <br>এখানেও দুটি বাক্যের ভাব আছে, 'নিরাপদ ভাবা' এবং 'বাড়ির বাইরে আসা' । যেহেতু নিরাপদ ভাবাটা আগে ঘটেছে, তাই participle-টা সেই বাক্যাংশেই ব্যবহার হল, যেমন thinking all was safe । এরকমও লেখা যেত, Pijush thought that all was safe, so he came out of his house । সেটা কিন্তু participle-এর ব্যবহার হত না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson1 (3)",
                        "text1": "দরজায় দাঁড়াতে একটা বল চন্দনকে আঘাত করল",
                        "text2": "Standing at the gate, Chandan was hit by a ball. <br> <br>'দরজায় দাঁড়ানো' আগে ঘটেছে বলে standing at the gate হল । যদি লেখা হত, Standing at the gate, a ball hit Chandan তাহলে ভুল হত, কারণ চন্দন যেহেতু দরজায় দাঁড়িয়ে আছে, পরের বাক্যাংশে তাকে (চন্দন) দিয়েই শুরু করতে হবে । 'বল' দিয়ে নয় । দরকার হলে সেক্ষেত্রেও passive voice ব্যবহার করতে হবে, এখানে যেমন করা হল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson1 (4)",
                        "text1": "আকাশের দিকে তাকাতে অনেক মেঘ দেখা গেল",
                        "text2": "Looking at the sky, we saw lots of clouds. <br> <br>যদি Looking at the sky, lots of clouds were seen (passive voice) লেখা হত , তবে সেটা ভুল হত, কারণ যে looking at the sky, তাকেই মেঘ দেখতে হবে । সেইজন্য we saw lots of clouds হল । ভুল বাক্যটিতে মনে হচ্ছে যেন, lots of clouds-ই looking at the sky । এমনও করা যেত, We looked at the sky and saw lots of clouds ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson1 (5)",
                        "text1": "আবহাওয়া ভালো থাকায় সামিনা বেরিয়ে পড়ল",
                        "text2": "The weather being fine, Samina went out. <br> <br>যেটা আগে ঘটেছে, সেই বাক্যাংশটিকেই আগে লিখবে । তাই হল, weather being fine । ভুল ইংরিজি - being the weather fine । এমনও লেখা যেত, The weather was fine, so Samina went out ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson1 (6)",
                        "text1": "ঈশ্বর চাইলে আমাদের আবার দেখা হবে",
                        "text2": "God willing, we will meet again. <br> <br>আগের মতই । চাওয়া অর্থে will কথাটা verb হিসেবে ব্যবহার হয়, মাঝে মাঝে want-এর জায়গায় । Willing god, we will meet again - ভুল ইংরিজি । If god want, we will meet again-ও লেখা যেত, কিন্তু god willing লিখলে বাক্য সুন্দর হয় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson1 (7)",
                        "text1": "সময় থাকলে নন্দন আমার বাড়ি আসবে",
                        "text2": "Time permitting, Nandan will come to my house. <br> <br>এটি আর একটি সুন্দর ব্যবহার । এখানে time permitting মানে 'সময় যদি অনুমতি দেয়' । permitting time - ভুল ইংরিজি । If Nandan has time, he will come to my house বা If time permits, Nandan will come to my house - এই দুটিও ঠিক ইংরিজি ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson1 (8)",
                        "text1": "অনেকে চলে আসায় আমরা সভা শুরু করলাম",
                        "text2": "Many having come, we started the meeting. <br> <br>এখানেও দুটি বাক্যাংশ আছে, 'অনেকের চলে আসা' এবং 'সভা শুরু করা' । লক্ষ্য করে দেখ, 'অনেকের চলে আসা'-র রেশ  রেখে 'আমরা সভা শুরু করলাম' । তাই many having come হল, many coming হল না । রেশটা যেহেতু 'চলে আসা'-র ওপর আছে, তাই সেখানেই have ব্যবহার হল, পরের বাক্যাংশে নয় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson1 (9)",
                        "text1": "বৃষ্টি থামাতে আমরা যাত্রা শুরু করলাম",
                        "text2": "The rain having stopped, we began our journey. <br> <br>বৃষ্টি থামার রেশ নিয়ে, আমরা যাত্রা শুরু করলাম । তাই rain having stopped হল । having been (passive voice) হল না, কারণ বৃষ্টি নিজেই থামে, বৃষ্টিকে কেউ থামায় না । begin এবং start একই কথা । After the rain stopped, we began our journey - এটাও লেখা যায় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson1 (10)",
                        "text1": "রাত্রে ঘুমিয়ে নিয়ে আমরা বাড়ির বাইরে গেলাম",
                        "text2": "Having slept at night, we went out of our house. <br> <br>এখানেও রাত্রে ঘুমিয়ে নেওয়ার রেশ নিয়ে আমরা বাড়ির বাইরে গেলাম, তাই having slept হল । sleeping at night হল না । having been slept (passive voice) হল না, কারণ আমরাই ঘুমোচ্ছি । যে বাক্যাংশটির ঘটনা আগে ঘটেছে, সেটিকেই আগে লিখবে । যেমন having slept at night । Sleep - Slept - Slept ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson1 (11)",
                        "text1": "সেই সুযোগ নিয়ে একটা চোর আমাদের বাড়িতে চুরি করতে থাকল",
                        "text2": "Taking that chance, a thief kept stealing in our house. <br> <br>এখানে having taken-ও লেখা যেত, কিন্তু যেহেতু পরের বাক্যাংশেও রেশ আছে (চুরি করতে থাকা), তাই সুযোগ নেওয়ার রেশটা আর থাকছে না । সেই জন্য taking that chance হল । এখানে লক্ষ্য কর, keep stealing একটি gerund এবং taking একটি participle । দুটির তফাৎ এখানে সুন্দর বোঝা যাচ্ছে । steal - চুরি করা ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BGP2-Lesson1 (12)",
                        "text1": "কিন্তু আমাদের কুকুরটা ওর দিকে চেঁচাতে থাকল",
                        "text2": "But our dog kept on shouting at him. <br> <br>এটি কিন্তু gerund-এর ব্যবহার । kept shouting-ও লেখা যেত । shouting at হয় shouting on বা shouting in হয় না ।"
                      }
]