[
                      {
                        "description": "",
                        "image1": "godinside",
                        "name": "BPP3-Lesson1 (1)",
                        "text1": "ঈশ্বর তোমার ভিতরে আছেন <br> <br>God is _______ you.",
                        "text2": "God is <u>inside</u> you. <br> <br>কোথায় in ব্যবহার করবে আর কোথায় inside, এটা বুঝে নাও । যখন একটা boundary বা সীমানার ভেতরে কিছু আছে সেটা পরিষ্কার বোঝা যাচ্ছে, তখন inside ব্যবহার করবে । মানে, পাশাপাশি যখন একটা outside-এর ব্যাপার ভালোমত বোঝা যাচ্ছে, তখন in না লিখে inside লিখবে । যেমন, The clothes are inside the bag,  chocolate is inside the packet ইত্যাদি । ঠিক তেমনই God is inside you - তোমার দেহ তোমার সীমানা, তার ভেতরে আছেন বলে inside লেখা হল ।"
                      },
                      {
                        "description": "",
                        "image1": "letterinside",
                        "name": "BPP3-Lesson1 (2)",
                        "text1": "চিঠির বাক্সে পাঁচটা চিঠি আছে <br> <br>There are five letters _______ the letterbox.",
                        "text2": "There are five letters <u>inside</u> the letterbox. <br> <br>Inside সবসময় outside-এর পরিপ্রেক্ষিতে ব্যবহার হবে । outside-এর প্রশ্ন আছে, তাই তো inside the letterbox লেখা হল । in the letterbox লিখলেও ভুল হয় না । তবে বলতে পারো, we are inside India বলি না কেন ? এখানে সীমানা বা চৌহদ্দির ভাব এলেও দেওয়াল দিয়ে আলাদা করার ভাবটা আসছে না । বেশ দেওয়াল দিয়ে আলাদা করে সীমানা ভাগ করে দিলে inside লিখবে ।"
                      },
                      {
                        "description": "",
                        "image1": "outsidehouse",
                        "name": "BPP3-Lesson1 (3)",
                        "text1": "বেশীরভাগ উদ্ভিদ বাড়ির বাইরে বেশী ভালো বাড়ে <br> <br>Most plants grow better ________ house.",
                        "text2": "Most plants grow better <u>outside</u> house. <br> <br>inside যেমন outside-এর পরিপ্রেক্ষিতে বসে, outside তেমনই inside-এর পরিপ্রেক্ষিতে বসে । বাড়ির inside আছে বলেই না outside-এর প্রশ্ন উঠছে ! বাড়ির বাইরে - outside house ।"
                      },
                      {
                        "description": "",
                        "image1": "outsidebasket",
                        "name": "BPP3-Lesson1 (4)",
                        "text1": "কেমন করে সবকটা কাগজের বল ঝুড়ির বাইরে ছুঁড়তে পারলে ? <br> <br>How could you throw all the paper balls ________ the basket ?",
                        "text2": "How could you throw all the paper balls <u>outside</u> the basket ? <br> <br>basket-এর 'ভেতর' আছে বলেই 'বাইরে'-র প্রশ্ন উঠছে । এখানে outside ছাড়া আর কিছু হবেই না ।"
                      },
                      {
                        "description": "",
                        "image1": "withintoy",
                        "name": "BPP3-Lesson1 (5)",
                        "text1": "খেলনাগুলিকে নাগালের মধ্যে রাখো <br> <br>Keep the toys _______ reach.",
                        "text2": "Keep the toys <u>within</u> reach. <br> <br>within আর inside-এর ব্যবহারগত তফাৎ খুবই কম, অতএব বেশীরভাগ জায়গাতেই বদলাবদলি করে লিখতেই পারো । যেমন, inside the box-এর জায়গায় within the box । কিন্তু যখন কোন ভৌতিক বা রক্তমাংসের কিছু বোঝাবে না, তখন within-ই লিখতে হবে, inside লিখলে চলবে না । নাগালের ভেতর (within reach), আইনের মধ্যে (within law), এক ঘন্টার মধ্যে (within an hour) - এরকম হবে । inside reach, inside law, inside an hour কখনো লিখবে না ।"
                      },
                      {
                        "description": "",
                        "image1": "withincompany",
                        "name": "BPP3-Lesson1 (6)",
                        "text1": "কোম্পানী-র মধ্যে বিভেদ বেড়ে চলেছে <br> <br>Divisions _______ the company are growing.",
                        "text2": "Divisions <u>within</u> the company are growing. <br> <br>company কোন ভৌতিক বা রক্তমাংসের জিনিশ নয়, মানুষের তৈরী একটা ধারণা । তাই তার আগে within বসল । সীমানার ব্যাপারটা এখানে আছে, কিন্তু দেওয়াল নেই । তাই এখানে in তবু লিখতে পারো, কিন্তু inside লিখলে ঠিক হবে না । Division - বিভেদ (এক্ষেত্রে division অঙ্কের ভাগ করা বোঝায় না), grow (বা increase) - বেড়ে চলা ।"
                      },
                      {
                        "description": "",
                        "image1": "withinmeans",
                        "name": "BPP3-Lesson1 (7)",
                        "text1": "সামর্থ্যের মধ্যে থাকার চেষ্টা করা উচিৎ <br> <br>One should try to live _______ means.",
                        "text2": "One should try to live <u>within</u> means. <br> <br>একই কারণে within বসল । সামর্থ‍্য বা উপায় (means) একটি মানুষের তৈরী ধারণা । এখানে আবার in means লিখলে ভুল হবে । mean আর means কিন্তু একই শব্দের বহুবচন নয় - দুটো আলাদা শব্দ ।"
                      },
                      {
                        "description": "",
                        "image1": "withindog",
                        "name": "BPP3-Lesson1 (8)",
                        "text1": "কুকুরটির ভিতরে আনন্দ রয়েছে <br> <br>The dog has joy _______ it.",
                        "text2": "The dog has joy <u>within</u> it. <br> <br>আবার মনে করিয়ে দেওয়া যাক, ভৌতিক বা রক্তমাংসের কিছুর আগে within বা inside যে কোন একটাই লিখতে পারো । it কুকুরকে বোঝাচ্ছে, তাই তার আগে inside (বা এমনকি in-ও) লেখা যেত ।"
                      },
                      {
                        "description": "",
                        "image1": "intochocolate",
                        "name": "BPP3-Lesson1 (9)",
                        "text1": "চকলেটটিকে ভেঙ্গে ছয় টুকরো করো <br> <br>Break the chocolate _____ six pieces.",
                        "text2": "Break the chocolate <u>into</u> six pieces. <br> <br>in, inside আর within-এর ব্যবহারের তফাৎ বোঝানো হয়েছে । এই তিনটে preposition-ই বস্তুর স্থির অবস্থায় বা স্থিতিতে একটা ভেতর আরেকটা জিনিশ বোঝাতে ব্যবহার হয় । এবারে into, যা চলনের ক্ষেত্রে ব্যবহার হয়, স্থিতিতে নয় । উদাহরণ - they went into the house, put some sugar into my milk, break the chocolate into six pieces । লক্ষ্য কর - go, put বা break এই সব verb চলন বোঝায় । এখানে into ব্যবহার করবে ।"
                      },
                      {
                        "description": "",
                        "image1": "intocloth",
                        "name": "BPP3-Lesson1 (10)",
                        "text1": "পোষাক বদলে কিছু শীতের পোষাক পরো <br> <br>Change _____ some warm clothes.",
                        "text2": "Change <u>into</u> some warm clothes.  <br> <br>ছবিতে তো আর চলন বোঝানো যায় না, ভিডিও লাগে । তাই 'শীতের পোষাক' পরাটা দেখানো গেল না । কিন্তু change আগের উদাহরণের মতই চলন অর্থে ব্যবহার হল (action verb) । তাই এখানে into বসবে । in, inside, into আর within-এর তফাৎ এখন পরিষ্কার তো ?"
                      },
                      {
                        "description": "",
                        "image1": "totea",
                        "name": "BPP3-Lesson1 (11)",
                        "text1": "চায়ে অল্প একটু চিনি দাও <br> <br>Add a little sugar _____ the tea.",
                        "text2": "Add a little sugar <u>to</u> the tea. <br> <br>এটা একটু ব্যতিক্রম হল । যদিও 'চায়ে' বলতে 'চায়ের ভেতর'-ই বোঝায়, তবু যেহেতু add to হয় (phrasal বা group verb) তাই add into লেখা হল না । আমেরিকান ইংরিজিতে আবার add into লেখা হয় অবশ্য ।"
                      }
]