[
                      {
                        "description": "",
                        "image1": "age",
                        "name": "BPT1-Lesson3 (1)",
                        "text1": "আমিনা একুশ বছর বয়সে স্নাতক হয়েছিল <br> <br>Ameena completed her graduation ___ the age of twenty one.",
                        "text2": "Ameena completed her graduation <u>at</u> the age of twenty one. <br> <br>প্রশ্ন করতে পারো, কেন at হল ? ছবিটা লক্ষ্য কর । ১, ২, ৩, ৪ করে বয়স বাড়ছে আমিনার, তার মধ্যে অতি নির্দিষ্ট একটি বছর হল একুশ । তাই at হল । in হল না, কারণ এটা সময়কাল বোঝালেও সারা একুশ বছর বয়স ধরেই তো আর আমিনা স্নাতক হয়নি, একুশ বছরের মধ্যে একটা সময়ে হয়েছে  । তাহলে on কেন হল না ? উত্তর - যখন অনেকটার মধ্যে (যেমন 24 hours) অতি নির্দিষ্ট কোন একটা সময় (যেমন 7 o'clock) বোঝানো হয়, তখন at বসে । on-ও নির্দিষ্ট সময় বোঝাতেই ব্যবহার হয়, কিন্তু সেটা অনেকটার মধ্যে একটা সময় নয় (যেমন, on Sunday হয়, কারণ মাত্র ৭ দিনের মধ্যে একটা সময় Sunday) ।"
                      },
                      {
                        "description": "",
                        "image1": "at",
                        "name": "BPT1-Lesson3 (2)",
                        "text1": "বন্ধুরা সপ্তাহশেষে মিলিত হবে, ভেবেছে <br> <br>The friends have thought of meeting ___ the weekend.",
                        "text2": "The friends have thought of meeting <u>at</u> the weekend. <br> <br>নির্দিষ্ট করে weekend-এর একটা সময় বন্ধুরা meet করবে, তাই at হল  (meet তো একবারই করবে) । এক্ষেত্রে on-ও ঠিক । ইংরেজরা at আর আমেরিকানরা on ব্যবহার করে weekend-এর সঙ্গে ।"
                      },
                      {
                        "description": "",
                        "image1": "at",
                        "name": "BPT1-Lesson3 (3)",
                        "text1": "সভা এমন সময় শুরু হওয়া উচিৎ যখন প্রত্যেকে আসতে পারে <br> <br>The meeting should start ___ a time when everybody can come.",
                        "text2": "The meeting should start <u>at</u> a time when everybody can come. <br> <br>সভা একটা অতি নির্দিষ্ট সময়েই শুরু হয়, ৫-১০ মিনিট ধরে তো হয় না । তাই at  বসল ।"
                      },
                      {
                        "description": "",
                        "image1": "inonat",
                        "name": "BPT1-Lesson3 (4)",
                        "text1": "এই মুহূর্তে আমার হাতে কোন কাজ নেই <br> <br>___ the moment I have no work in hand. ",
                        "text2": "<u>At</u> the moment I have no work in hand. <br> <br>মুহূর্ত যে অতি নির্দিষ্ট একটা সময়, সেটা তো বোঝা সহজ । তাই at ।"
                      },
                      {
                        "description": "",
                        "image1": "pastten",
                        "name": "BPT1-Lesson3 (5)",
                        "text1": "এখন বাজে দশটা বেজে দশ মিনিট  <br> <br>It is ten minutes _____ ten o’clock now.",
                        "text2": "It is ten minutes <u>past</u> ten o’clock now. <br> <br>এক্ষেত্রে past অর্থ হল 'পেরিয়ে', 'অতীত' অর্থে past এখানে ব্যবহার হয় নি । এই past হল preposition । তাই 'দশ মিনিট পেরিয়ে দশটা' বোঝাতে লেখা হল ten minutes past ten o'clock । লিখতে যাবে না - ten minutes after ten o'clock । আর লিখবে না - ten o'clock past ten minutes ।"
                      },
                      {
                        "description": "",
                        "image1": "toeleven",
                        "name": "BPT1-Lesson3 (6)",
                        "text1": "এখন ১১টা বাজতে ৫০ মিনিট বাকি <br> <br>It is fifty minutes ___ eleven o’clock now.",
                        "text2": "It is fifty minutes <u>to</u> eleven o’clock now. <br> <br>fifty minutes to eleven o’clock মানে eleven o'clock আসতে (to eleven o'clock) এখনো fifty minutes লাগবে - ঘড়ির লাগুক আর মানুষের লাগুক । fifty minutes before eleven o’clock লিখবে না । আর লিখবে না - eleven o'clock to fifty minutes । কোন subject নেই বলে it দিয়ে শুরু করা হল ।"
                      },
                      {
                        "description": "",
                        "image1": "till",
                        "name": "BPT1-Lesson3 (7)",
                        "text1": "ঠাকুমার রূপকথাগুলি সোহমের আজও (আজ অবধি) মনে আছে <br> <br>___ this day Soham remembers his grandmother’s fairy tales.",
                        "text2": "<u>To</u> this day Soham remembers his grandmother’s fairy tales. <br> <br>যেমন 'এগারোটা অবধি যেতে পঞ্চাশ মিনিট' বোঝাতে to eleven o'clock ব্যবহার হয়েছিল, তেমনই 'আজ অবধি' বোঝাতে to this day ব্যবহার হল । to today হয় না । অবশ্য till today লিখলেও ঠিক হয় । তবে to this day বেশী ভাল প্রয়োগ ।"
                      },
                      {
                        "description": "",
                        "image1": "bysix",
                        "name": "BPT1-Lesson3 (8)",
                        "text1": "ছটার ভেতর মাঠে এসো <br> <br>Come to the field ___ six o clock.",
                        "text2": "Come to the field <u>by</u> six o clock. <br> <br>'ভেতর' (by) আর 'আগে' (before) - তফাৎ খুব সামান্যই । 'ছ'টার আগে এসো' মানে ছ'টায় এলে হবে না -পরিষ্কার । 'ছ'টার ভেতর এসো' বলার মধ্যে একটু ছাড় আছে - ছ'টায় এলেও চলবে । এইটুকুই তফাৎ ।"
                      },
                      {
                        "description": "",
                        "image1": "bytomorrow",
                        "name": "BPT1-Lesson3 (9)",
                        "text1": "কালকের মধ্যে আমায় এই কাজটা শেষ করতে হবে <br> <br>I must finish this work ___ tomorrow.",
                        "text2": "I must finish this work <u>by</u> tomorrow. <br> <br>এখানে কিন্তু by আর before-এর বেশ খানিকটা তফাৎ আছে । before tomorrow লিখলে বোঝায় যে, tomorrow আসার আগেই আমায় কাজটা শেষ করতে হবে । আর by tomorrow মানে কালকের মধ্যে শেষ করলেও হবে - একটু ছাড় আছে । ছ'টার উদাহরণে ছ'টা সময়টা খুব নির্দিষ্ট বলে তফাৎ কম, কিন্তু tomorrow বেশ খানিকটা সময় বলে by আর before-এর তফাৎ বেশী ।"
                      },
                      {
                        "description": "",
                        "image1": "bythattime",
                        "name": "BPT1-Lesson3 (10)",
                        "text1": "ততদিনে (ততদিনের মধ্যে) আমার তপ্ত আবহাওয়ায় অভ্যেস হয়ে গেছিল <br> <br>___ that time I was used to the hot weather.",
                        "text2": "<u>By</u> that time I was used to the hot weather. <br> <br>এখানে before হবেই না, by-ই হবে । কারণ before that time লিখলে বোঝায়, that time-এর আগেই আমি hot weather-এ অভ্যস্ত হয়ে গেছি । to this time-ও হবে না এখানে । 'অবধি' আর 'মধ্যে'-র তফাৎ তোমরা জানো, সেটাই to this time আর by this time-এর তফাৎ । used to মানে অভ্যস্ত হওয়া, এটা ব্যবহার করতে গেলে সবসময় passive voice ব্যবহার করবে - I am used to (something) ।"
                      }
]