[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson1 (1)",
                        "text1": "Affirmative (হ্যাঁ-বাচক) to Negative (না-বাচক): <br> <br>He is a liar.",
                        "text2": "He is not truthful. <br> <br>বাক্যের রূপান্তর (Transformation of sentences) হল বাক্যের অর্থ পরিবর্তন না করে বাক্যের গঠন পরিবর্তন করা । বিভিন্ন প্রয়োজন বা বাক্যের সৌন্দর্য বাড়াতে আমাদের বাক্যের রূপান্তর করতে হয় । \nHe is a liar-এর অর্থ, সে মিথ্যাবাদী। এটা হ্যাঁ-বাচক বাক্য । আমরা অর্থ একই রেখে বাক্যটিকে যখন না-বাচক করব, তখন লিখব He is not truthful, মানে সে সত্যবাদী ( truthful) নয়। অতএব not ব্যবহার করে liar-এর বিপরীতার্থক শব্দ truthful বসানো হল । এখানে প্রশ্ন হতে পারে, এর প্রয়োজন কী ? সরাসরি  কঠোরভাবে কারোর সম্বন্ধে 'মিথ্যেবাদী' না বলে 'সে সত্যবাদী নয়' বললে একটু নরমভাবে মনের ভাব বোঝানো যায় । সেরকম লেখার দরকার হলে বাক্যের রূপান্তর প্রয়োজন ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson1 (2)",
                        "text1": "Affirmative (হ্যাঁ-বাচক) to Negative (না-বাচক): <br> <br>I always love my country.",
                        "text2": "I never hate my country. <br> <br>আমি আমার দেশকে সবসময় ভালবাসি ( I always love my country) - এটা হ্যাঁ-বাচক বাক্য।  এই বাক্যটিকে না-বাচক করতে গেলে always  আর love এই শব্দ দুটোকে পরিবর্তন করতে হবে। always-এর বিপরীত শব্দ never আর love-এর বিপরীত hate । তাই বাক্যটিকে সাজাতে হবে এইভাবে যে, I never hate my country । ব্যাকরণগতভাবে বাক্যটি নির্ভুল, কিন্তু আক্ষরিক অর্থে I never hate my country-এর অর্থ হল, আমি আমার দেশকে কখনো ঘৃণা করিনা; তার মানেই কিন্তু এটা নয় যে আমি আমার দেশকে সবসময় ভালবাসি ।  হ্যাঁ- বাচক বাক্য যেমন নির্দিষ্ট করে কোন অর্থ বোঝায়, ইংরিজিতে সেই বাক্যকে না-বাচক করলে অনেকসময় বাক্যটির মানে কিছুটা হালকা হয়ে যায় ।  I always love my country - এই বাক্যকে না-বাচক লিখতে গেলে আমরা এটাও লিখতে পারি যে  I can not but love my country, যার অর্থ - আমি আমার দেশকে না ভালোবেসে পারি না । বা Don't I love my country ! (বিস্ময়বোধক)"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson1 (3)",
                        "text1": "Affirmative (হ্যাঁ-বাচক) to Negative (না-বাচক): <br> <br>Only the truthful can be happy.",
                        "text2": "None but the truthful can be happy. <br> <br>Truthful মানে সত্যবাদী ।  Only the truthful can be happy-এর অর্থ - শুধুমাত্র সত্যবাদীরাই সুখী হতে পারে।  একে না-বাচক করতে আমরা লিখব none but the truthful can be happy । বাক্যে only শব্দ ব্যবহার করে হ্যাঁ-বাচক বাক্য থাকলে বাক্যটি কে না-বাচক করতে গেলে কিছু নিয়ম জানতে হবে । Only (person) হিসাবে ব্যবহার হলে সেক্ষেত্রে বাক্যটি কে না-বাচক করতে গেলে None but ব্যবহার করা হয়। উদাহরণ - Only God can help us (হ্যাঁ-বাচক), None but God can help us (না-বাচক), এখানে God যেহেতু person । Only (thing) হিসাবে ব্যবহার হলে সেক্ষেত্রে বাক্যটি কে না-বাচক করতে nothing but ব্যবহার করা হয়। উদাহরণ  - He likes only sweet (হ্যাঁ-বাচক), He likes nothing but sweet (না-বাচক), এখানে sweet যেহেতু thing । এবার Only (age অথবা number) হিসাবে ব্যবহার হলে বাক্যটি কে না-বাচক করতে not more than /not less than  ব্যবহার করা হয় । উদাহরন : He is only ten (হ্যাঁ-বাচক), He is not more than ten (না-বাচক), এখানে ten যেহেতু age । আর একটি উদাহরণ - The man has only a shirt  (হ্যাঁ-বাচক), The man has no more than a shirt (না-বাচক), এখানে a shirt যেহেতু number । <br> <br>উপরের বাক্যটিতে truthful বোঝাচ্ছে person-কে, তাই না-বাচক করতে গেলে none but ব্যবহার করতে হবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson1 (4)",
                        "text1": "Negative (না-বাচক) to Affirmative (হ্যাঁ-বাচক): <br> <br>His action is not legal.",
                        "text2": "His action is illegal. <br> <br>His action is illegal বাক্যটির অর্থ, তার কাজকর্ম আইনসম্মত নয় । not legal-এর জায়গায় বিপরীতার্থক শব্দ illegal বসালেই না-বাচক হ্যাঁ-বাচক হয়ে যাবে । তাই বাক্যের রূপান্তরের জন্য বিপরীতার্থক শব্দ জানা দরকার ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson1 (5)",
                        "text1": "Negative (না-বাচক) to Affirmative (হ্যাঁ-বাচক): <br> <br>His behaviour did not please me.",
                        "text2": "His behaviour dissatisfied me. <br> <br>হ্যাঁ- বাচক  বাক্যকে না-বাচক বাক্যে রূপান্তরিত করতে হলে (বা তার উল্টোটা) আমরা অনেক সময় বাক্যের verb-এর বিপরীতার্থক শব্দ ব্যবহার করি । please এখানে verb হিসেবে ব্যবহার হয়েছে - অর্থ সন্তুষ্ট করা আর এর বিপরীতার্থক শব্দ হল  dissatisfy (অসন্তুষ্ট) বা displease । His behaviour dissatisfied me - তার ব্যবহার আমাকে অসন্তুষ্ট করেছিল । past tense-এর ব্যবহারটা লক্ষ্য কর - did not ছিল বলে dissatisfied হল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson1 (6)",
                        "text1": "Negative (না-বাচক) Affirmative (হ্যাঁ-বাচক): <br> <br>Nobody was absent.",
                        "text2": "Everybody was present. <br> <br>Nobody was absent - কেউ অনুপস্থিত ছিল না, everybody was present - সবাই উপস্থিত ছিল । কিছু কিছু শব্দের নিজেরই একটা না-বাচক শব্দ থাকে । যেমন everybody-র না-বাচক শব্দ হল nobody । everybody মানে সবাই,  nobody মানে একজনও নয় ।  বিপরীতার্থক শব্দ জানতেই হবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson1 (7)",
                        "text1": "Affirmative (হ্যাঁ-বাচক) to Interrogative (প্রশ্ন-বাচক): <br> <br>Everyone loves his mother.",
                        "text2": "Who does not love his mother ? <br> <br>হ্যাঁ- বাচক থেকে প্রশ্নবাচক বাক্যে রূপান্তরিত করতে হলে আমাদের দেখতে হবে, বাক্যটিকে প্রশ্নবোধক বাক্যে রূপান্তরিত করলে সেই প্রশ্নের আমরা কি উত্তর পাব । উপরের বাক্যটি যেমন আছে - Everyone loves his mother (সবাই তার মা কে ভালবাসে), এটিকে প্রশ্নবোধক বাক্যে রূপান্তরিত করতে গেলে লিখতে হবে 'কে তার মাকে ভালবাসে না ?' (who does not love his mother ?), যেহেতু এই প্রশ্নের একটাই নির্দিষ্ট উত্তর আছে - সবাই । প্রশ্ন করতে পারো, এইভাবে প্রশ্নবোধক বাক্যে ঘুরিয়ে লিখে লাভটা কি হবে ? লাভ এই যে, who does not love his mother এই বাক্যে আবেগ আছে, যেটা Everybody loves his mother-এ নেই । যদি রচনায় আবেগ দেওয়ার দরকার থাকে, এইভাবে প্রশ্নবোধক করে লেখা ভাল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson1 (8)",
                        "text1": "Affirmative (হ্যাঁ-বাচক) to Interrogative (প্রশ্ন-বাচক): <br> <br>Their glory can never fade.",
                        "text2": "When can their glory fade ? <br> <br>Glory - গৌরব বা মাহাত্ম্য, fade - মিলিয়ে যাওয়া । Their glory can never fade-এর অর্থ, তাদের মাহাত্ম্য কখনো মিলিয়ে যেতে পারবে না । এই বাক্যটিকে প্রশ্নবোধক বাক্যে রূপান্তর করতে গেলে আমাদের এমনভাবে প্রশ্ন করতে হয়, যাতে সেই প্রশ্নের একটাই নির্দিষ্ট উত্তর পাওয়া যায় - কোনদিনও নয় ।  সে প্রশ্ন হল - 'তাদের গৌরব কবে মিলিয়ে যেতে পারবে ?' । আর এবার তার ইংরিজি কর - When can their glory fade ? জানবে, when-এর জায়গায় how-ও লেখা যায় এক্ষেত্রে, মানে কিভাবে মিলিয়ে যেতে পারে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson1 (9)",
                        "text1": "Affirmative (হ্যাঁ-বাচক) to Interrogative (প্রশ্ন-বাচক): <br> <br>He killed the snake.",
                        "text2": "Did he not kill the snake ? <br> <br>মূল বাক্যটি হোল - He killed the snake (সে সাপটিকে মেরেছিল) । এই বাক্যটিকে প্রশ্নবোধক বাক্যে রূপান্তর করতে গেলে আমাদের বলতে হয়, 'সে কি সাপটিকে মারে নি ?' এই প্রশ্নের ভেতর \"হ্যাঁ\" উত্তরের ভাবটা বেশী আছে । তাই হল Did he not kill the snake । কিন্তু যদি Did he kill the snake লেখা হয়, তার উত্তর খুব নির্দিষ্ট নয় - \"হ্যাঁ\" বা \"না\" দুটোই হতে পারে ।  তাই Did he kill the snake-এর চেয়ে Did he not kill the snake সুপ্রযুক্ত । killed আছে বলে did বসল প্রশ্নে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson1 (10)",
                        "text1": "Affirmative (হ্যাঁ-বাচক) to Interrogative (প্রশ্ন-বাচক): <br> <br>I am your well-wisher.",
                        "text2": "Am I not your well-wisher ? <br> <br>মূল বাক্য - I am your well-wisher মানে ' আমি তোমার শুভাকাঙ্ক্ষী '। আগের উদাহরণের মতই এই বাক্যটিকে প্রশ্নবোধক বাক্যে রূপান্তর করতে গেলে আমাদের বলতে হয়, 'আমি কি তোমার শুভাকাঙ্ক্ষী নই ?', কারণ আমি জানি যে আমি তোমার শুভাকাঙ্ক্ষী।  প্রশ্নটি এইভাবে করলে আমরা উত্তর পাব- \"হ্যাঁ\" । আর Am I your well-wisher লেখা হলে তার উত্তর কিন্তু \"হ্যাঁ\" বা \"না\" দুটোই হতে পারে । অতএব ওটা না লেখা উচিৎ ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson1 (11)",
                        "text1": "Interrogative (প্রশ্ন-বাচক) to Affirmative (হ্যাঁ-বাচক): <br> <br>Am I not your friend ?",
                        "text2": "I am surely your friend. <br> <br>Am I not your friend - আমি কি তোমার বন্ধু নই ? এক্ষেত্রে Interrogative sentence থেকে affirmative sentence এ পরিবর্তন করতে হলে আমাদের লিখতে হবে I am your friend । যেহেতু মূল প্রশ্নবোধক বাক্যটিতে (যেন খানিকটা আবেগের সঙ্গে) প্রশ্ন করা হচ্ছে, আমি কি তোমার বন্ধু নই, তাই হ্যাঁ-বাচক বাক্যটিকে আরও নিশ্চয় করতে আমরা একটা adjective (surely) ব্যবহার করে লিখব I am surely your friend, অর্থ আমি সত্যিই তোমার বন্ধু ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson1 (12)",
                        "text1": "Interrogative (প্রশ্ন-বাচক) to Affirmative (হ্যাঁ-বাচক): <br> <br>When can Shakespeare's glory fade ?",
                        "text2": "Shakespeare's glory can never fade. <br> <br>When can Shakespeare's glory fade ? - কবে শেক্সপিয়ারের গৌরব ম্লান হবে বা মিলিয়ে যাবে ? উপরের প্রশ্নবোধক বাক্যটিকে হ্যাঁ-বোধক বাক্যে রূপান্তর করতে আমাদের লিখতে হবে 'শেক্সপিয়ারের গৌরব কোনো দিন ম্লান হবেনা' - Shakespeare's glory can never fade । 'কোনো দিনও নয়' বলতে এখানে never ব্যবহার করা হয়েছে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson1 (13)",
                        "text1": "Interrogative (প্রশ্ন-বাচক) to Affirmative (হ্যাঁ-বাচক): <br> <br>Who is so cruel as to hate him ?",
                        "text2": "Nobody would be so cruel as to hate him. <br> <br>Who is so cruel as to hate him ? - ওকে ঘৃণা করে এমন নিষ্ঠুর কে আছে ? so আর as to ব্যবহার হয় 'এমন' বা 'যাতে' বোঝাতে । এরকম বাক্য আরো হয় - He is running so as to reach in time (সে ছুটছে যাতে সময়ে পৌঁছতে পারে), He sat at the front so as to be able to hear (সে সামনে বসল যাতে শুনতে পায়) । এখন এই প্রশ্নবোধক বাক্য থেকে হ্যাঁ-বাচক বাক্যে রূপান্তর করতে গেলে প্রশ্নটা পড়ে বুঝতে হবে, প্রশ্নটা কি বোঝাতে চাইছে । ওপরের প্রশ্নটা পড়ে বোঝা যাচ্ছে - 'এমন কেউ নেই যে ওকে ঘৃণা করে' । এবারে হ্যাঁ-বাচক বাক্যে subject কি দেওয়া যায় ? subject হল 'এমন কেউ নেই', যার ইংরিজি হল ' Nobody' । অতএব হ্যাঁ- বাচক বাক্যটি লিখতে গেলে লিখতে হবে - Nobody is so cruel as to hate him । যদি আরও ভাল করে বোঝাতে চাওয়া হয় যে 'এমন কেউ এরকমই হবে না যে ওকে  ঘৃণা করবে', তো আমরা এইভাবে লিখব - Nobody would be so cruel as to hate him । এখানে 'would be' দিয়ে বাক্যের বক্তব্যটিকে আরও ভাল করে নির্দিষ্ট করা হয়েছে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson1 (14)",
                        "text1": "Interrogative (প্রশ্ন-বাচক) to Affirmative (হ্যাঁ-বাচক): <br> <br>Who does not fear darkness ?",
                        "text2": "Everyone fears darkness. <br> <br>Darkness মানে অন্ধকার ।  Who does not fear darkness ? মানে হল 'কে অন্ধকারকে ভয় পায় না ?' । এই প্রশ্নের মধ্যে দিয়েই বলে দেওয়া হচ্ছে, সবাই অন্ধকারকে ভয় পায়, যার ইংরিজি হল 'Everyone fears darkness' । এটাই হ্যাঁ-বাচক বাক্য ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson1 (15)",
                        "text1": "Interrogative (প্রশ্ন-বাচক) to Affirmative ( হ্যাঁ-বাচক): <br> <br>Where will you find such a beautiful country ?",
                        "text2": "Nowhere will you find such a beautiful country. <br> <br>মূল প্রশ্নবোধক বাক্যটি হোল - 'Where will you find such a beautiful country ?' (কোথায় তুমি এত সুন্দর একটি দেশ পাবে ?) । এই প্রশ্নবোধক বাক্যটির মধ্যেই প্রশ্নের উত্তর আছে  - 'কোথাও তুমি এত সুন্দর দেশ পাবে না' ।  কোথাও নেই - nowhere । তাই হ্যাঁ-বাচক বাক্যটি লেখা যায় you will find such a beautiful country nowhere (you will not আর nowhere একসঙ্গে ব্যবহার হবে না, দুটো negative) । কিন্তু আরো ভালো ইংরিজি হল Nowhere will you find such a beautiful country । এই বাক্যে nowhere-এর ওপর জোর দেওয়া হয়েছে ।"
                      }
]