[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson2 (1)",
                        "text1": "Affirmative (হ্যাঁ-বাচক) to Exclamatory (বিস্ময়-বোধক): <br> <br>The flower is very beautiful.",
                        "text2": "How beautiful the flower is ! <br> <br>Exclamatory বা বিস্ময়বোধক বাক্য হল সেই ধরণের বাক্য, যা আমাদের মনে হঠাৎ করে আসা কোন ভাবকে (রাগ/দুঃখ/আনন্দ/ বিস্ময় ইত্যাদি) প্রকাশ করে বিশেষ কিছু শব্দের মাধ্যমে, যেমন Alas/ Hurrah/ Bravo/ What/ Were/ How ইত্যাদি । ওপরের বাক্যটিতে বলা আছে 'ফুলটি খুব সুন্দর' । এই বাক্যটিকে বিস্ময়বোধক বাক্যে রূপান্তর করতে হলে বলতে হয় 'ফুলটি কি সুন্দর !' । আর ইংরিজিতে সাজিয়ে নিতে হয় - কি সুন্দর ফুলটি । এই 'কি সুন্দর' হল how beautiful । Exclamatory sentence-এ যখন adjective বা  adverb-কে বিস্ময় দিয়ে ফোটাতে চাওয়া হয় তখন বেশীর ভাগ ক্ষেত্রেই শুরুতে How ব্যবহার হয় । এখানে সুন্দর (beautiful) এই adjective-টির ভেতর বিস্ময় ফোটানোর চেষ্টা করা হয়েছে । সেজন্য এখানে How ব্যবহার করতে হবে ।  How beautiful the flower is ঠিক, how beautiful is the flower তো প্রশ্নবোধক হয়ে যাবে । অতএব ওটা ভুল । আর ভুল, The flower is how beautiful । তোমার রচনায় যখন রাগ-দুঃখ-অভিমান-বিস্ময় প্রকাশ করার দরকার হবে, তখন এইভাবে বিস্ময়বোধক বাক্য ব্যবহার করবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson2 (2)",
                        "text1": "Affirmative (হ্যাঁ-বাচক) to Exclamatory (বিস্ময়-বোধক): <br> <br>The scene is horrible.",
                        "text2": "How horrible the scene is ! <br> <br>Horrible মানে ভয়ঙ্কর ।  মূল হ্যাঁ-বাচক বাক্যটির অর্থ হল 'দৃশ্যটি ভয়ঙ্কর' (The scene is horrible) । এই বাক্যটিকে বিস্ময়বোধক (exclamatory) বাক্যে রূপান্তর করতে গেলে বলতে পারা যায় 'দৃশ্যটি কি ভয়ংকর !' । আগের উদাহরণের মতই তাই How horrible বসল আর পুরোটা হল How horrible the scene is । ভুল - How the scene is horrible, How is the scene horrible, The scene is how horrible, How horrible is the scene ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson2 (3)",
                        "text1": "Affirmative (হ্যাঁ-বাচক) to Exclamatory (বিস্ময়-বোধক): <br> <br>The fish is very big.",
                        "text2": "How big the fish is ! <br> <br>আগের দুটো উদাহরণের মতই । ভুল - The fish is how big, How big is the fish, How is the fish big ইত্যাদি ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson2 (4)",
                        "text1": "Exclamatory (বিস্ময়-বোধক) to Affirmative (হ্যাঁ-বাচক): <br> <br>Hurrah! We have won !",
                        "text2": "It is a pleasure that we have won. <br> <br>Hurrah দিয়ে কোন হঠাৎ আনন্দকে প্রকাশ করা হয় ।  Hurrah বিস্ময়বোধক বাক্যে ব্যবহার করা হয় । এখানে  মূল বাক্যটি হল 'Hurrah! we have won!', অর্থ  'কি মজা/ কি আনন্দ ! আমরা জিতে গেছি' । বিস্ময়-বোধক বাক্যের যখন হ্যাঁ- বাচক বাক্যে রূপান্তর হয় তখন বিস্ময় বা মনের ভাবটা না রেখে কেবল ঘটনাটা প্রকাশ করবে । Hurrah থাকা বাক্যকে হ্যাঁ- বাচক বাক্যে রূপান্তর করতে গেলে hurrah-এর বদলে 'It is a pleasure' বা 'It is a matter of joy' এইসব বাক্যাংশ ব্যবহার করতে হবে এবং তার সঙ্গে that জুড়ে বাকিটা যেমন ছিল বসিয়ে দিতে হবে । তাই হল,  It is a pleasure that we have won ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson2 (5)",
                        "text1": "Exclamatory (বিস্ময়-বোধক) to Affirmative (হ্যাঁ-বাচক): <br> <br>Alas, the man is dead !",
                        "text2": "We are sorry that the man is dead. <br> <br>Exclamatory sentence-এ যখন 'Alas' এই শব্দটি ব্যবহার হয় তার মানে হল কোন দুঃখজনক ঘটনা ঘটেছে । তাই 'Alas' থাকা বাক্যটিকে হ্যাঁ-বাচক বাক্যে রূপান্তর করতে হলে 'Alas'-এর বদলে 'We are sorry' / 'It is a matter of sorrow' এই সব বাক্যাংশগুলি ব্যবহার করা হয় এবং আগের উদাহরণের মতই  that জুড়ে বাকিটা একই রেখে দেওয়া হয় । তাই হল We are sorry that the man is dead । মনে রাখবে, বিস্ময় থেকে হ্যাঁ-বাচক করতে হলে আবেগকে কাটিয়ে দিয়ে সরলভাবে মনের ভাব প্রকাশ হবে । এই ধরণের বাক্য পরিবর্তনের প্রয়োজন কি ? যদি ধর, dead man-টি খারাপ মানুষ ছিল জীবিতকালে, তখন কি আর alas ব্যবহার করবে ? তখন বলবে, we are sorry that the man is dead (, but the man was bad) ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson2 (6)",
                        "text1": "Exclamatory (বিস্ময়-বোধক) to Affirmative (হ্যাঁ-বাচক): <br> <br>Shame ! Shame !",
                        "text2": "It is a shame on you. <br> <br>Shame - লজ্জা । কোন কোন সময় আমরা পুরো বাক্যটা না বলে কিছু Exclamatory (বিস্ময়বোধক) শব্দ ব্যবহার করে আমাদের মনের ভাব ব্যক্ত করি। যেমন ওপরের বাক্যটি : Shame! shame! এইসব ক্ষেত্রে সেই বাক্যটি যখন হ্যাঁ-বাচক বাক্যে রূপান্তর হবে, তখন It অথবা I-কে Subject করে ঘটনাটা বিবৃত হবে ।  তাই এইভাবে লেখা হবে - It is a shame on you (এটা তোমার লজ্জা) অথবা I feel shame on you (আমি তোমার ব্যাপারে লজ্জাবোধ করছি) ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson2 (7)",
                        "text1": "Simple (সরল বাক্য) to Complex (জটিল বাক্য): <br> <br>He is an intelligent boy.",
                        "text2": "He is a boy who is intelligent. <br> <br>Simple sentence (সরল বাক্য) থেকে complex sentence-এ (জটিল বাক্য) রূপান্তর করতে জটিল বাক্যটিকে একটি প্রধান বাক্য আর একটি/একাধিক সাহায্যকারী বাক্য দিয়ে তৈরী করতে হবে ।  এই ক্ষেত্রে প্রধান বাক্যটির সঙ্গে অন্য বাক্য/বাক্যগুলি preposition বা conjunction দিয়ে  জুড়তে হবে, যাতে প্রধান বাক্যের উপর নির্ভরশীল অন্য বাক্য/বাক্যগুলি  প্রধান বাক্যটিকে আরও ভাল করে বোঝাতে সাহায্য করে । ওপরের বাক্যটি হল  He is an intelligent boy,  অর্থ  'সে বুদ্ধিমান ছেলে' । এই বাক্যটিকে প্রসারিত করতে গেলে আমাদের বলতে হবে- 'সে একটি ছেলে যে বুদ্ধিমান', যার ইংরিজি He is a boy who is intelligent । ছেলেটি কেমন ? ছেলেটি বুদ্ধিমান । He is a boy who is intelligent এই বাক্যটির মধ্যে He is a boy প্রধান বাক্য । is intelligent এটি প্রধান বাক্যের উপর নির্ভরশীল বাক্য । এই প্রধান বাক্য আর নির্ভরশীল বাক্যটিকে 'who' এই pronoun -এর সাহায্যে জোড়া হয়েছে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson2 (8)",
                        "text1": "Simple (সরল বাক্য) to Complex (জটিল বাক্য): <br> <br>You saw a happy man.",
                        "text2": "You saw a man who was happy. <br> <br>You saw a happy man - তুমি একটি সুখী মানুষকে দেখেছিলে । এই সরল বাক্যটিকে জটিল বাক্যে রূপান্তর করতে গেলে এই রকম করে ভাবতে হবে - তুমি একটি মানুষকে দেখেছিলে যে সুখী ছিল, যার ইংরিজি হল You saw a man who was happy। প্রশ্ন হতে পারে, কেন এভাবে লিখব আদৌ, You saw a happy man তো দিব্যি ছিল ? উত্তর হল, লোকটির অবস্থাটাকে (সুখী) গুরুত্ব দিতে হলে তোমার রচনায় এইভাবে ঘুরিয়ে লিখতে হবে । এখানে লোকটার সুখটা গুরুত্ব পাচ্ছে লোকটার চেয়ে, কিন্তু happy man-এ man বেশী গুরুত্ব পাচ্ছে । যার ওপর গুরুত্ব বেশী দিতে চাইবে, সেই অনুযায়ী সরল বা জটিল বাক্য বেছে নেবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson2 (9)",
                        "text1": "Simple (সরল বাক্য) to Complex (জটিল বাক্য): <br> <br>The Taj Mahal, the most beautiful building in India, was built by Shahjahan.",
                        "text2": "The Taj Mahal which is the most beautiful building in India was built by Shahjahan. <br> <br>The Taj Mahal, the most beautiful building in India, was built by Shahjahan - তাজমহল, ভারতের সবচেয়ে সুন্দর সৌধ (building), শাহজাহান তৈরি করেছিলেন । কোন কোন সরল বাক্য বড় হলে এইভাবে (,) এই punctuation দিয়ে লেখা হয় । সেই ক্ষেত্রে বাক্যটি থেকে প্রধান বাক্যটি খুঁজে নিতে হবে । উপরের বাক্যে প্রধান বাক্যটি হল 'শাহজাহান তাজমহল  তৈরি করেছিলেন' । এরপর দেখতে হবে, শাহজাহান যে তাজমহল তৈরি করেছিলেন সেটা কেমন ? সেটি ভারতের সবচেয়ে সুন্দর ভবন ।  'যেটি ভারতের সবচেয়ে সুন্দর ভবন' এটা লিখতে গেলে আমরা এইভাবে লিখতে পারি যে 'which is the most beautiful building in India.' । তাহলে আমরা জটিল বাক্যটি এইভাবে লিখতে পারি 'তাজমহল যেটা ভারতের সবচেয়ে সুন্দর ভবন শাহজাহান তৈরি করেছি্লেন  - The Taj Mahal which is the most beautiful building in India was built by Shahjahan । এখানে which এই pronoun টি দিয়ে প্রধান বাক্য আর নির্ভরশীল বাক্যকে যোগ করা হয়েছে । আর is ব্যবহার হল, কারণ এখনো তাজমহল ভারতের সবচেয়ে সুন্দর ভবন ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson2 (10)",
                        "text1": "Simple (সরল বাক্য) to Complex (জটিল বাক্য): <br> <br>Jewel saw a wounded bird.",
                        "text2": "Jewel saw a bird that was wounded. <br> <br>মূল বাক্যটি হল 'জুয়েল একটি আহত পাখিকে দেখেছিল' (Jewel saw a wounded bird) । এই সরল বাক্যটিকে জটিল বাক্যে রূপান্তর করতে গেলে আমাদের এইভাবে ভাবতে হবে : জুয়েল একটি পাখি দেখেছিল সেটা আহত ছিল - Jewel saw a bird that was wounded । এখানে পাখিটার অবস্থা (wounded) গুরুত্ব দিয়ে বর্ণনা করা হয়েছে । কোন কিছুর অবস্থা বর্ণনা করতে conjunction হিসাবে 'which', 'what', 'that' এইসব শব্দ ব্যবহার করা হয় । which-ও ব্যবহার হতে পারে, কিন্তু that বেশী সুপ্রযুক্ত ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson2 (11)",
                        "text1": "Simple (সরল বাক্য) to Complex (জটিল বাক্য): <br> <br>Mijanur bought his uncle's palace.",
                        "text2": "Mijanur bought the palace which belonged to his uncle. <br> <br>আগেই বলা হয়েছে, সরল বাক্য থেকে জটিল বাক্যে রূপান্তর করতে গেলে বাক্যটাকে ভাল করে প্রসারিত করতে হয় যাতে বাক্যের মধ্যের বক্তব্য, সেই বাক্যের কারণ, সময়, অবস্থা ভাল ভাবে উপস্থাপিত হয় । ওপরের বাক্যে বলা হয়েছে Mijanur bought his uncle's palace । এর অর্থ, মিজানুর তার কাকার প্রাসাদ কিনেছিল । এই বাক্যটিকে প্রসারিত করতে হলে ভাবতে হবে : 'মিজানুর যে প্রাসাদটা কিনেছিল সেটা তার কাকার ছিল', যার ইংরিজি হল Mijanur bought the palace which belonged to his uncle । কোন কোন ক্ষেত্রে সরল বাক্য থেকে জটিল বাক্য করতে গেলে preposition/ pronoun ব্যবহার করা ছাড়াও কিছু কিছু অতিরিক্ত Verb আনতে হয়, belong (অধীনে থাকা) এরকমই একটা verb ।  belong to হয় । অবশ্য Mijanur bought the palace which was his uncle's-ও লেখা যায় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson2 (12)",
                        "text1": "Simple (সরল বাক্য) to Complex (জটিল বাক্য): <br> <br>Tell the truth.",
                        "text2": "Tell me what the truth is. <br> <br>Tell the truth মানে 'সত্য বলো' । এই  সরল বাক্যকে জটিল বাক্যে রূপান্তর করতে গেলে আমাদের এইভাবে ভাবতে হবে :  আমাকে সেটাই বোলো যেটা সত্য । কখনো কাউকে যদি নির্দিষ্ট করে কিছু বলতে বলা হয় (যেমন, সত্য) তো এইভাবে জটিল বাক্য করে বলতে হবে। এখানে 'বলা' এই Verb টাকে প্রসারিত করা হয়েছে । কি বলতে হবে--- যেটা সত্য । তাই 'Tell the truth' এই সরল বাক্যটিকে জটিল বাক্যে রূপান্তর করতে গেলে আমাদের এই ভাবে লিখতে হবে : Tell me what the truth is ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson2 (13)",
                        "text1": "Simple (সরল বাক্য) to Complex (জটিল বাক্য): <br> <br>Tell me your age.",
                        "text2": "I ask you to tell how old you are. <br> <br>Tell me your age - তোমার বয়স আমাকে বলো । আগের উদাহরণের নিয়ম মেনে Tell me what your age is লেখাই যায় । তবে আরেকভাবেও লেখা যায় । এখানে মূল বাক্যকে বিস্তৃত করলে এভাবেও লেখা যায় যে 'আমি তোমাকে বলতে বলছি তোমার বয়স কত'। এখানে 'আমি তোমাকে বলতে বলছি' (I ask you) এটি প্রধান বাক্য। আর 'তোমার বয়স কত (how old are you)' এটি নির্ভরশীল বাক্য। এই জটিল বাক্যটিতে প্রধান বাক্য আর নির্ভরশীল বাক্য 'how'  এই 'pronoun'  দ্বারা যুক্ত হয়েছে। তাই হল, I ask you to tell how old you are' । প্রশ্নবোধক নয় বলে how old you are হয়ে গেল, লক্ষ্য রাখো । "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson2 (14)",
                        "text1": "Simple (সরল বাক্য) to Complex (জটিল বাক্য): <br> <br>Itlufa's silence proves her guilt.",
                        "text2": "That Itlufa is silent proves her guilt. <br> <br>মূল বাক্যটি হল 'Itlufa's silence proves her guilt',  যার অর্থ 'ইতলুফার চুপ থাকাটা ওর দোষ প্রমাণ করে । silence মানে হল নীরবতা বা চুপ করে থাকা । guilt মানে হল দোষ । এই হ্যাঁ-বাচক বাক্যটিকে জটিল বাক্যে রূপান্তর করতে গেলে এইভাবে ভাবতে হবে, '(ঘটনাটা এটা) যে ইতলুফা চুপ করে আছে সেটা তার দোষ প্রমাণ করে ' ।  জটিল বাক্যে সবসময়ই একটা প্রধান বাক্য আর একটা নির্ভরশীল বাক্য থাকবে । এখানে প্রধান বাক্যটি হল '(ঘটনাটা এটা) যে ইতলুফা চুপ করে আছে', যার ইংরিজি That Itlufa is silent ।  নির্ভরশীল বাক্যটি হল 'সেটা তার দোষ প্রমাণ করে' (proves her guilt) । লক্ষ্য কর, That Itlufa is silent এটাই পরের বাক্য proves her guilt-এর subject । "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS1-Lesson2 (15)",
                        "text1": "Simple (সরল বাক্য) to Complex (জটিল বাক্য): <br> <br>The management is thoroughly bad.",
                        "text2": "The management is as bad as it can be. <br> <br>'The management is thoroughly bad' - 'ব্যবস্থাপনা পুরোপুরি বাজে ছিল' । Thoroughly মানে পুরোপুরি । এটা একটি সরল বাক্য । আগেই বলা হয়েছে, জটিল বাক্যে সরল বাক্যের ঘটনাটিকে দুই বা তার বেশী বাক্যের সাহায্যে বিস্তৃত করে বলা হয় । এখানে 'thoroughly bad'-কে বিস্তৃত করে বোঝাতে এইভাবে বলা যায় 'as bad as it can be' - অর্থ, যতটা বাজে হতে পারে । যদি simple sentence -এ থাকত 'thoroughly good' তবে লেখা যেত 'as good as it can be' (যতটা ভাল হতে পারে) । তাহলে 'The management is thoroughly bad' জটিল বাক্য হিসাবে লিখতে গেলে লেখা যায় 'The management is as bad as it can be' । এই বাক্যে 'The management is bad' এটা প্রধান বাক্য । এখানে কতটা বাজে সেটা বোঝাতে 'as bad as it can be' এটার সাহায্য নেওয়া হয়েছে । এটা একটু বুদ্ধির ব্যাপার ।"
                      }
]