[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson2 (1)",
                        "text1": "Compound (যৌগিক বাক্য) to Simple (সরল বাক্য): <br> <br>Rahul washed his hands and started eating.",
                        "text2": "Washing his hands Rahul started eating. <br> <br>Rahul washed his hands and started eating - রাহুল হাত ধুয়েছিল এবং খাওয়া শুরু করেছিল । রাহুলের হাত ধোয়ার কাজটা আগে হয়েছিল । আগের আলোচনা অনুযায়ী  Compound sentence থেকে simple sentence-এ রূপান্তর করতে গেলে যে কাজটি আগে হয়েছে তার verb এর সঙ্গে ing যোগ করা হয় । তাহলে এক্ষেত্রে হল Washing his hands Rahul started eating ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson2 (2)",
                        "text1": "Compound (যৌগিক বাক্য) to Simple (সরল বাক্য): <br> <br>He tried hard but did not succeed.",
                        "text2": "In spite of trying hard he did not succeed. <br> <br>Compound Sentence-টি হল 'He tried hard but did not succeed' । অর্থ, 'সে চেষ্টা করেছিল কিন্তু সাফল্যলাভ করেনি'। 'কিন্তু'-র জায়গায় 'হওয়া সত্ত্বেও' বসালেই simple sentence হয়ে যাবে, 'চেষ্টা করা সত্ত্বেও সে সাফল্যলাভ করেনি' (In spite of trying hard he did not succeed) । সবসময় নিয়মের খোঁজে না থেকে বুদ্ধি খরচা করবে, তাহলেই এই বাক্য পরিবর্তন সহজ হয়ে যাবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson2 (3)",
                        "text1": "Complex (জটিল বাক্য) to Compound (যৌগিক বাক্য): <br> <br>If you listen to me, you will be happy.",
                        "text2": "Listen to me and be happy. <br> <br>Complex sentence-এ একটি প্রধান বাক্য (main clause) আর সেই প্রধান বাক্যের ওপর নির্ভরশীল আরেকটি বাক্য (subordinate clause) থাকে । Compound sentence-র ক্ষেত্রে দুই বা তার বেশি সরল বাক্যকে যোগ করে বক্তব্যটি বলা হয় । ওপরের complex sentence-টিতে আছে যে 'If you listen to me, you will be happy', যার অর্থ 'যদি তুমি আমার কথা শোন, তুমি সুখী  হবে' । এটাকে এই ভাবে ভাবতে হবে যে 'আমার কথা শোন এবং সুখী হও'। তাই হল 'Listen to me and be happy' । এটাকে সরল বাক্য করতে হলে কি করতে ? Listening to me will make you happy । এটা gerund-এঁর ব্যবহার ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson2 (4)",
                        "text1": "Complex (জটিল বাক্য) to Compound (যৌগিক বাক্য): <br> <br>As you are young, you must work hard.",
                        "text2": "You are young, so you must work hard. <br> <br>জটিল বাক্যে প্রধান বাক্য (principal clause) এবং নির্ভরশীল বাক্যের (dependent clause) সাহায্যে যে বক্তব্য বলা হয়, Compound sentence-এ সেই বক্তব্যকে দুই বা তার বেশি সরল বাক্যে ভেঙে তারপর conjunction বা coma (,) দিয়ে যোগ করা হয়ে থাকে । ওপরের complex sentence-টিতে আছে 'As you are young, you must work hard' (যেহেতু তুমি কমবয়সী, তোমায় কঠিন পরিশ্রম করতে হবে) । এখানে দুটো বাক্য - তোমার বয়স কম এবং তোমায় কঠিন পরিশ্রম করতে হবে । কিন্তু এদের মধ্যে কার্য-কারণ সম্পর্ক আছে । তাই so দিয়ে জোড়া হল - You are young, so you must work hard । "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson2 (5)",
                        "text1": "Complex (জটিল বাক্য) to Compound (যৌগিক বাক্য): <br> <br>We can prove that the earth is round.",
                        "text2": "The earth is round and we can prove it. <br> <br>ওপরের জটিল বাক্যে দুটো ঘটনা বলা হয়েছে -  Earth is round এবং We can prove it । সহজ তো, and দিয়ে জুড়ে দাও । ভাবটা এল তো ? এল । কেন এভাবে লেখার দরকার ? দ্যাখো, The earth is round and we can prove it - এই বাক্যে prove-এর ওপর বেশী জোর দেওয়া আছে, যেন আত্মবিশ্বাস বোঝাচ্ছে । সেটা বোঝানো বেশী প্রয়োজন হলে এইভাবে লিখবে । We can prove that the earth is round-এ দুটো বাক্যেরই প্রায় সমান গুরুত্ব । এটার সরল বাক্য কেমন হবে ? We can prove the roundness of earth ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson2 (6)",
                        "text1": "Complex (জটিল বাক্য) to Compound (যৌগিক বাক্য): <br> <br>As soon as Tanay got the telegram, he left in a taxi.",
                        "text2": "Tanay got the telegram and immediately left in a taxi. <br> <br>Complex sentence-টি হল 'As soon as Tanay got the telegram, he left in a taxi' (তনয় যখনই টেলিগ্রামটা পেয়েছিল, সে ট্যাক্সি করে বেরিয়ে গিয়েছিল) । আগের উদাহরণের মতই and দিয়েই জুড়তে হবে, তবে as soon as আছে বলে and-এর সঙ্গে আরো কিছু জুড়তে হবে (আগের উদাহরণে যেমন so বসেছিল) । immediately মানে তৎক্ষণাৎ (তক্ষুণি), অতএব and-এর পর immediately বসিয়ে দিয়ে লেখো - Tanay got the telegram and immediately left in a taxi । দ্বিতীয় বাক্যে he লিখতে পারো, না-ও পারো । immediately-জায়গায় then লিখলে কিন্তু ভাব ঠিক আসবে না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson2 (7)",
                        "text1": "Complex (জটিল বাক্য) to Compound (যৌগিক বাক্য): <br> <br>Barun is more a philosopher than a poet.",
                        "text2": "Barun is something of a poet, but rather more of a philosopher. <br> <br>বাক্য রূপান্তর করতে গেলে বাক্যের বক্তব্য ঠিক রাখতে অনেক সময় সুপ্রযুক্ত শব্দ (appropriate word) ব্যবহার করতে হয়। ওপরের complex sentence-টি হল 'Barun is more a philosopher than a poet' - অর্থ, 'বরুণ কবির থেকেও বেশি মাত্রায় দার্শনিক' । এই জটিল বাক্যটিকে যৌগিক বাক্যে রূপান্তর করতে গেলে এই ভাবে ভাবতে হবে - বরুণ কবি কিন্তু তার থেকেও বেশী দার্শনিক ।  তাই হল, Barun is something of a poet, but rather more of a philosopher । something of - কিছুটা মতো, rather more of a - বেশীটা মত । এই শব্দগুলোর ব্যবহার শিখে রাখো ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson2 (8)",
                        "text1": "Complex (জটিল বাক্য) to Compound (যৌগিক বাক্য): <br> <br>If you do not hurry, you will miss the train.",
                        "text2": "You must hurry or you will miss the train. <br> <br>'If you do not hurry, you will miss the train' এই জটিল বাক্যটির অর্থ - 'যদি তুমি তাড়াতাড়ি না কর, তুমি ট্রেন মিস করবে'। এই বাক্যটিকে compound sentence-এ রূপান্তর করতে হলে এইভাবে ভাবতে হবে 'তুমি তাড়াতাড়ি কর নয়ত তুমি ট্রেন মিস করবে' যেটা ইংরাজিতে লিখলে লিখতে হয় 'You must hurry or you will miss the train' । You must hurry-র জায়গায় শুধু Hurry-ও লেখা যায়, Hurry or you will miss the train । লক্ষ্য কর, or এখানে 'অথবা' অর্থে নয়, 'নয়ত' অর্থে ব্যবহার হল ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson2 (9)",
                        "text1": "Compound (যৌগিক বাক্য) to Complex (জটিল বাক্য): <br> <br>I won prizes and I was surprised.",
                        "text2": "I was surprised when I won prizes. <br> <br>Compound sentence-টি হল 'I won prizes and I was surprised', যার অর্থ 'আমি পুরস্কার জিতেছিলাম এবং আমি বিস্মিত হয়েছিলাম' । Compound sentence থেকে  complex sentence-এ রূপান্তর (transform) করতে গেলে মূল বক্তব্যকে একটি প্রধান বাক্য এবং প্রধান বাক্যের উপর নির্ভরশীল একটি বাক্যে প্রকাশ করতে হয় । এখানে এই নিয়ম অনুসরণ করলে দাঁড়ায় - 'আমি বিস্মিত হয়েছিলাম যখন পুরস্কার জিতেছিলাম' ।  তাহলে এইভাবে লিখতে হবে 'I was surprised when I won prizes' । এই বাক্যে surprised-এর ওপর জোর আছে, যেটা অতটা ঠিক compound sentence-এ নেই । সরল বাক্য করতে হলে লেখা হত I was surprised to have won prizes । লক্ষ্য কর, surprise সবসময় passive voice-এ ব্যবহার হয় ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson2 (10)",
                        "text1": "Compound (যৌগিক বাক্য) to Complex (জটিল বাক্য): <br> <br>Work hard or fail.",
                        "text2": "If you do not work hard, you will fail. <br> <br>এটা ঠিক আগের উদাহরণের উল্টোটা । বলা হয়েছে, 'বেশী খাটো, নয়ত ব্যর্থ হবে'। তার মানে, তোমার বেশী খাটার উপর তোমার ব্যর্থ না হওয়া নির্ভরশীল । তাহলে complex sentence এইভাবে লিখতে হবে 'If you do not work hard, you will fail' । যদি লিখতে, If you work hard, you will not fail তবে সেটা ঠিক ভাব আনত না, কারণ বেশী খাটলে তুমি ব্যর্থ হবে না, তা তো যৌগিক বাক্যে বলেনি । বলেছে, বেশী না খাটলে ব্যর্থ হবে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson2 (11)",
                        "text1": "Compound (যৌগিক বাক্য) to Complex (জটিল  বাক্য): <br> <br>Waste not, want not.",
                        "text2": "If you do not waste today, you will not want (lack) tomorrow. <br> <br>Waste not, want not - এটি একটি আমেরিকান বাগধারা, অর্থ 'নষ্ট না করলে (পরে) চাহিদা হবেনা', মানে যদি নষ্ট না কর জিনিস থেকে যাবে তোমার সঙ্গে, পরে তোমাকে আর সেটা চাইতে হবে না । 'যদি' বোঝাচ্ছে তো, তাই If দিয়ে জুড়ে দাও -  'If you do not waste today, you will not want tomorrow' । জানবে, today আর tomorrow-এর জায়গায় now আর later-ও লেখা যায় । "
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson2 (12)",
                        "text1": "Compound (যৌগিক বাক্য) to Complex (জটিল বাক্য): <br> <br>Do or die.",
                        "text2": "If you do not do this, you will die. <br> <br>আগেরটার মতই । 'Do or die' মানে 'করো নয়ত মরো', যদি না কর, তবে মরবে । তাই if লাগাও আগের মতই - 'If you do not do this, you will die' । this না-ও দিতে পারো ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson2 (13)",
                        "text1": "Compound (যৌগিক বাক্য) to Complex (জটিল বাক্য): <br> <br>She must weep or she will die.",
                        "text2": "If she does not weep, she will die. <br> <br>এটা একটা বিখ্যাত কবিতার লাইন । weep - ফুঁপিয়ে কাঁদা । লাইনটার অর্থ, সে যদি ফুঁপিয়ে না কাঁদে তো সে মরবে । একইরকম ভাবে if ব্যবহার হল । লক্ষ্য কর, If she must not weep হল না, কারণ must not weep মানে তো 'কাঁদতে হবে না', আর যেটা complex sentence চাইছে তা হল, 'যদি সে না কাঁদে' (if she does not weep) ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson2 (14)",
                        "text1": "Compound (যৌগিক বাক্য) to Complex (জটিল বাক্য): <br> <br>Dipanwita saw the danger and paused.",
                        "text2": "When Dipanwita saw the danger, she paused. <br> <br>Dipanwita saw the danger and  paused - দীপান্বিতা বিপদ দেখেছিল এবং থেমে গিয়েছিল । এখানে প্রথম ঘটনাটা ঘটেছিল এবং সেজন্য দ্বিতীয় ঘটনাটা ঘটেছিল। এইরকম ক্ষেত্রে বুঝতে হবে 'যখন প্রথম ঘটনাটা ঘটেছিল, তখন  দ্বিতীয় ঘটনাটি ঘটল' । তাই এইসব ক্ষেত্রে When (যখন) দিয়ে শুরু করা হয় ।  pause - থেমে যাওয়া বা থমকে যাওয়া ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BTS2-Lesson2 (15)",
                        "text1": "Compound (যৌগিক বাক্য) to Complex (জটিল বাক্য): <br> <br>Do your best and you will never regret it.",
                        "text2": "If you do your best, you will never regret it. <br> <br>বলা হয়েছে, তুমি তোমার সেরাটা (best) দিলে কখনোই অনুতাপ বা পরে দুঃখ (regret) করবে না । সহজ তো, আগের মতই করে দাও If you do your best, you will never regret it ।"
                      }
]