[
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (1)",
                        "text1": "One should take care of old people.",
                        "text2": "Old people should be taken care of. <br> <br>Active voice-এর should যে passive voice-এ হয়ে যায় should be, এটা তো জানা আছেই । এখানে আরো দুটো ব্যপার লক্ষ্য কর । এক, take care - যত্ন নেওয়া, আর take care of old people - বয়স্ক মানুষদের যত্ন নেওয়া । এখানে of নামক preposition দিয়ে take care (verb) আর old people (adjective-noun) জোড়া আছে, অর্থাৎ তোমরা প্রশ্ন করতে পার, old people-কে কি object হিসেবে নেওয়া যায় ? হ্যাঁ যায়, কারণ one সরাসরি old people-এর ওপর কাজ করছে - 'take care of' এই পুরো phrase-টা দিয়ে । তাই হল, old people should be taken care of । আর দুই, by one শেষে আর জুড়তে হল না - আগের উদাহরণের নিয়ম মেনে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (2)",
                        "text1": "The policeman chased after the thief.",
                        "text2": "The thief was chased after by the policeman. <br> <br>এখানেও মনে হতে পারে, the thief-কে আদৌ object হিসেবে ধরা যায় কি না, কারণ chased-এর সঙ্গে the thief জোড়া আছে preposition (after) দিয়ে । কিন্তু এখানেও policeman সরাসরি thief-এর ওপর কাজ করছে, অতএব chased after-কে একটা phrase ধরে passive voice করা হল - The thief was chased after by the policeman । দুটো preposition পাশাপাশি বসতে পারে, এটা লক্ষ্য কর । বিচার করে দেখবে, subject কি object-এর ওপর সরাসরি কাজ করছে ? এক্ষেত্রে করছে, তাই passive voice করা গেল, কিন্তু We met at the party-তে করছে না, অতএব এটার ক্ষেত্রে passive voice হবে না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (3)",
                        "text1": "The guardians will speak to the teacher on this matter.",
                        "text2": "The teacher will be spoken to by the guardians on this matter. <br> <br>এখানেও guardians সরাসরি teacher-এর ওপর কাজ করছে (speak to), যদিও preposition (to) দিয়ে verb (speak) আর object (teacher) জোড়া আছে । তাই speak to-কে একটা phrase ধরে The teacher will be spoken to by the guardians করা হল । এখানেও দুটো preposition পাশাপাশি এসেছে । আরো লক্ষ্য কর, matter কিন্তু passive voice-এ subject হিসেবে ব্যবহার করা হল না, যদিও The matter will be spoken on between the teacher and the guardians লিখলে ভুল হয় না ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (4)",
                        "text1": "Bhagat Singh died for his country.",
                        "text2": "এটার passive voice হবে না, Bhagat Singh যেহেতু country-র জন্য প্রাণ দিয়েছিলেন, country-র ওপর সরাসরি কাজ করেন নি । The country was died for by Bhagat Singh - এই বাক্যের কোন অর্থ নেই । He died in the country-রও কোন passive voice হয় না একই কারণে ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (5)",
                        "text1": "Rubaiya jumped onto the thief and caught it.",
                        "text2": "The thief was jumped onto by Rubaiya and was caught. <br> <br>দেখ, এখানে subject (Rubaiya) সরাসরি object-এর (thief) ওপর কাজ করছে (jump onto) । তাই jump onto-কে একটা phrase ধরে passive voice করা হল The thief was jumped onto by Rubaiya । আরেকটা ব্যাপার লক্ষ্য কর, caught-ও was caught হল (and দিয়ে জোড়া আছে) । The thief was jumped onto and caught by Rubaiya - এরকমও লেখা যেত ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (6)",
                        "text1": "We know that you are a cheat.",
                        "text2": "It is known to us that you are a cheat. <br> <br>আগের উদাহরণের মতই এটা একটা compound sentence, যা একাধিক বাক্যংশের সমষ্টি । জানবে, সবকটা বাক্যাংশকেই যে passive voice করতেই হবে, তা কিন্তু নয় । এখানে যেমন you are a cheat-কে passive voice করা যায় না, কারণ আগে বলা হয়েছে । আর কোন বাক্যাংশকে passive voice করা গেলেই যে তা করতে হবে, তার কোন মানে নেই । সৌন্দর্যহানি হলে জোর করে করবে না, পরীক্ষায় নম্বর পেতে করতে পারো । We know হল It is known to us (এটা by us-এর চেয়ে ভালো ইংরিজি) । that যেমন ছিল, রইল । এমনও লেখা যেত - That you are a cheat is known to us ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (7)",
                        "text1": "All want money, but some get it.",
                        "text2": "Money is wanted by all, but is got by some. <br> <br>এখানে দুটো বাক্যাংশকেই passive voice করা হল । All want money - Money is wanted by all । আর but some get it - but is got by some । লক্ষ্য কর, পরের বাক্যাংশে আর it বা money দেওয়ার দরকার পড়ল না, কারণ দুটো বাক্যাংশের subject-ই এক - Money ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (8)",
                        "text1": "Jewel's boss was telling him that she did not like his work style.",
                        "text2": "Jewel was being told by his boss that his work style was not liked by her. <br> <br>প্রথমে দেখ, was telling হল was being told আর did not like হল was not liked - কারণ আগের আগের উদাহরণে সবিস্তারে বলা হয়েছে । এখানে দুটো বাক্যাংশকেই passive voice করার দরকার আছে, কারণ প্রথম বাক্যাংশের subject যদি Jewel-কে করি, তবে দ্বিতীয় বাক্যাংশে তার কাজের পদ্ধতি দিয়েই শুরু করতে হবে (his work style) । যদি Jewel was being told by his boss that she did not like his work style লেখা হত (একটা বাক্যাংশের passive voice করে), তাহলে মনে হতে পারত যে, Jewel একটি মেয়ে (she) এবং সে তার boss-এর work style পছন্দ করছে না !!!"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (9)",
                        "text1": "The teacher has told the students that cow eats grass.",
                        "text2": "The students have been told by the teacher that cow eats grass. <br> <br>লক্ষ্য কর, এই দুটো বাক্যাংশের কোন যোগ নেই, আগের উদাহরণে কিন্তু ছিল । তাই দ্বিতীয় অংশটিকে passive voice করতেই হবে, তার কোন মানে নেই । The students have been told by the teacher that grass is eaten by cow শুনতে খারাপ লাগে । অবশ্য পরীক্ষার খাতায় এরকম করতে পারো, জীবনের খাতায় কোরো না । eat-ate-eaten এটা মনে আছে তো ? মনে করিয়ে দেওয়া যাক, passive voice-এ সবসময় past participle ব্যবহার হয় verb-এর পর ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (10)",
                        "text1": "They had stolen all the gold before they set fire to the shop.",
                        "text2": "All the gold had been stolen before fire was set to the shop. <br> <br>লক্ষ্য কর, passive voice-এ এখানে they এলই না - দিতে পারো, না-ও দিতে পারো । এরকম করা যায়, কারণ they এমন একটা subject (যথা - someone, somebody, one), যেটা অনির্দিষ্ট কিছু লোককে বোঝায় (জনগণ, চোর-ডাকাত আবার ভালমানুষও হতে পারে), passive voice-এ এটাকে তাই বাদ দিলেও চলে । দ্বিতীয় বাক্যাংশটিকেও passive voice করতে হবে, কারণ প্রথমটায় they বাদ দিলে তো আর দ্বিতীয়টায় নেওয়া যায় না । এই বাক্যাংশে fire-কে object থেকে subject করা হল, যদিও the shop was set fire to লেখা যেত । set-set-set এটা জানো তো ?"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (11)",
                        "text1": "Nobody would have asked him any question if he knew what places he had to avoid.",
                        "text2": "He would not have been asked any question if it was known to him what places had to be avoided. <br> <br>এখানে তিনটে passive voice করার মত বাক্যাংশ আছে, তিনটেই করাও হল । have-এর নিয়ম মেনে would have হল would have been (nobody দেওয়া হল না) । he knew আগের এক উদাহরণের নিয়মে it was known to him হল । আর আগেই বলা হয়েছে, যেমন have to do, have to make হয় have to be done, have to be made তেমনি had to avoid হয়ে গেল had to be avoided । avoid - এড়িয়ে চলা ।"
                      },
                      {
                        "description": "",
                        "image1": "",
                        "name": "BvC2-Lesson2 (12)",
                        "text1": "They saw the storm coming.",
                        "text2": "The storm was seen coming by them. <br> <br>Storm মানে ঝড় । coming - এই gerund-এর ব্যবহারটা লক্ষ্য কর । এটার কোন পরিবর্তন হল না বটে, কিন্তু তা seen-এর পরপরেই বসল । ভুল - The storm was seen by them coming । আর ভুল - The storm was coming seen by them ।"
                      }
]